{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PROOFSTATE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[PROOFSTEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[TACTICS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Punctuation",
        "behavior": "Isolated"
      },
      {
        "type": "Whitespace"
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[EOS]": 2,
      "[PROOFSTATE]": 3,
      "[PROOFSTEP]": 4,
      "[TACTICS]": 5,
      "!": 6,
      "\"": 7,
      "#": 8,
      "$": 9,
      "%": 10,
      "&": 11,
      "'": 12,
      "(": 13,
      ")": 14,
      "*": 15,
      "+": 16,
      ",": 17,
      "-": 18,
      ".": 19,
      "/": 20,
      "0": 21,
      "1": 22,
      "2": 23,
      "3": 24,
      "4": 25,
      "5": 26,
      "6": 27,
      "7": 28,
      "8": 29,
      "9": 30,
      ":": 31,
      ";": 32,
      "<": 33,
      "=": 34,
      ">": 35,
      "?": 36,
      "@": 37,
      "A": 38,
      "B": 39,
      "C": 40,
      "D": 41,
      "E": 42,
      "F": 43,
      "G": 44,
      "H": 45,
      "I": 46,
      "J": 47,
      "K": 48,
      "L": 49,
      "M": 50,
      "N": 51,
      "O": 52,
      "P": 53,
      "Q": 54,
      "R": 55,
      "S": 56,
      "T": 57,
      "U": 58,
      "V": 59,
      "W": 60,
      "X": 61,
      "Y": 62,
      "Z": 63,
      "[": 64,
      "\\": 65,
      "]": 66,
      "^": 67,
      "_": 68,
      "`": 69,
      "a": 70,
      "b": 71,
      "c": 72,
      "d": 73,
      "e": 74,
      "f": 75,
      "g": 76,
      "h": 77,
      "i": 78,
      "j": 79,
      "k": 80,
      "l": 81,
      "m": 82,
      "n": 83,
      "o": 84,
      "p": 85,
      "q": 86,
      "r": 87,
      "s": 88,
      "t": 89,
      "u": 90,
      "v": 91,
      "w": 92,
      "x": 93,
      "y": 94,
      "z": 95,
      "{": 96,
      "|": 97,
      "}": 98,
      "~": 99,
      "¥": 100,
      "§": 101,
      "«": 102,
      "¬": 103,
      "°": 104,
      "±": 105,
      "²": 106,
      "³": 107,
      "´": 108,
      "µ": 109,
      "·": 110,
      "¹": 111,
      "»": 112,
      "½": 113,
      "Á": 114,
      "É": 115,
      "×": 116,
      "ß": 117,
      "à": 118,
      "á": 119,
      "ä": 120,
      "æ": 121,
      "ç": 122,
      "è": 123,
      "é": 124,
      "ê": 125,
      "ë": 126,
      "ì": 127,
      "í": 128,
      "ï": 129,
      "ò": 130,
      "ó": 131,
      "ô": 132,
      "ö": 133,
      "ø": 134,
      "ü": 135,
      "ý": 136,
      "ă": 137,
      "ć": 138,
      "Č": 139,
      "č": 140,
      "ĝ": 141,
      "Ł": 142,
      "ł": 143,
      "ń": 144,
      "ō": 145,
      "ő": 146,
      "ř": 147,
      "ś": 148,
      "Š": 149,
      "š": 150,
      "Ž": 151,
      "ɢ": 152,
      "ɪ": 153,
      "ɴ": 154,
      "ʀ": 155,
      "ʏ": 156,
      "ʙ": 157,
      "ʜ": 158,
      "ʟ": 159,
      "ʰ": 160,
      "ʲ": 161,
      "ʳ": 162,
      "ʷ": 163,
      "ʸ": 164,
      "ˡ": 165,
      "ˢ": 166,
      "ˣ": 167,
      "̀": 168,
      "̂": 169,
      "Β": 170,
      "Γ": 171,
      "Δ": 172,
      "Θ": 173,
      "Ι": 174,
      "Λ": 175,
      "Π": 176,
      "Σ": 177,
      "Φ": 178,
      "Ψ": 179,
      "Ω": 180,
      "α": 181,
      "β": 182,
      "γ": 183,
      "δ": 184,
      "ε": 185,
      "ζ": 186,
      "η": 187,
      "θ": 188,
      "ι": 189,
      "κ": 190,
      "λ": 191,
      "μ": 192,
      "ν": 193,
      "ξ": 194,
      "π": 195,
      "ρ": 196,
      "σ": 197,
      "τ": 198,
      "υ": 199,
      "φ": 200,
      "χ": 201,
      "ψ": 202,
      "ω": 203,
      "ϕ": 204,
      "ϖ": 205,
      "И": 206,
      "а": 207,
      "в": 208,
      "и": 209,
      "н": 210,
      "о": 211,
      "ч": 212,
      "ᗮ": 213,
      "ᘁ": 214,
      "ᴀ": 215,
      "ᴄ": 216,
      "ᴅ": 217,
      "ᴇ": 218,
      "ᴊ": 219,
      "ᴋ": 220,
      "ᴍ": 221,
      "ᴏ": 222,
      "ᴘ": 223,
      "ᴛ": 224,
      "ᴜ": 225,
      "ᴠ": 226,
      "ᴡ": 227,
      "ᴢ": 228,
      "ᴬ": 229,
      "ᴮ": 230,
      "ᴰ": 231,
      "ᴱ": 232,
      "ᴳ": 233,
      "ᴴ": 234,
      "ᴵ": 235,
      "ᴶ": 236,
      "ᴷ": 237,
      "ᴸ": 238,
      "ᴹ": 239,
      "ᴺ": 240,
      "ᴼ": 241,
      "ᴾ": 242,
      "ᴿ": 243,
      "ᵀ": 244,
      "ᵁ": 245,
      "ᵂ": 246,
      "ᵃ": 247,
      "ᵇ": 248,
      "ᵈ": 249,
      "ᵉ": 250,
      "ᵋ": 251,
      "ᵍ": 252,
      "ᵏ": 253,
      "ᵐ": 254,
      "ᵒ": 255,
      "ᵖ": 256,
      "ᵗ": 257,
      "ᵘ": 258,
      "ᵛ": 259,
      "ᵝ": 260,
      "ᵞ": 261,
      "ᵟ": 262,
      "ᵠ": 263,
      "ᵡ": 264,
      "ᵢ": 265,
      "ᵣ": 266,
      "ᵤ": 267,
      "ᵥ": 268,
      "ᵦ": 269,
      "ᵧ": 270,
      "ᵨ": 271,
      "ᵩ": 272,
      "ᵪ": 273,
      "ᶜ": 274,
      "ᶠ": 275,
      "ᶥ": 276,
      "ᶹ": 277,
      "ᶻ": 278,
      "ᶿ": 279,
      "ầ": 280,
      "ỳ": 281,
      "​": 282,
      "‌": 283,
      "–": 284,
      "—": 285,
      "‖": 286,
      "’": 287,
      "“": 288,
      "”": 289,
      "†": 290,
      "•": 291,
      "…": 292,
      "′": 293,
      "‹": 294,
      "›": 295,
      "‼": 296,
      "⁄": 297,
      "⁅": 298,
      "⁆": 299,
      "⁰": 300,
      "ⁱ": 301,
      "⁴": 302,
      "⁵": 303,
      "⁶": 304,
      "⁷": 305,
      "⁸": 306,
      "⁹": 307,
      "⁺": 308,
      "⁻": 309,
      "⁼": 310,
      "⁽": 311,
      "⁾": 312,
      "ⁿ": 313,
      "₀": 314,
      "₁": 315,
      "₂": 316,
      "₃": 317,
      "₄": 318,
      "₅": 319,
      "₆": 320,
      "₇": 321,
      "₈": 322,
      "₉": 323,
      "₊": 324,
      "₋": 325,
      "₌": 326,
      "₍": 327,
      "₎": 328,
      "ₐ": 329,
      "ₑ": 330,
      "ₒ": 331,
      "ₓ": 332,
      "ₕ": 333,
      "ₖ": 334,
      "ₗ": 335,
      "ₘ": 336,
      "ₙ": 337,
      "ₚ": 338,
      "ₛ": 339,
      "ₜ": 340,
      "ℂ": 341,
      "ℋ": 342,
      "ℍ": 343,
      "ℐ": 344,
      "ℑ": 345,
      "ℒ": 346,
      "ℓ": 347,
      "ℕ": 348,
      "№": 349,
      "ℙ": 350,
      "ℚ": 351,
      "ℜ": 352,
      "ℝ": 353,
      "™": 354,
      "ℤ": 355,
      "ℬ": 356,
      "ℰ": 357,
      "ℱ": 358,
      "ℳ": 359,
      "ℵ": 360,
      "⅓": 361,
      "⅟": 362,
      "←": 363,
      "↑": 364,
      "→": 365,
      "↓": 366,
      "↔": 367,
      "↗": 368,
      "↘": 369,
      "↟": 370,
      "↠": 371,
      "↥": 372,
      "↦": 373,
      "↪": 374,
      "↭": 375,
      "↻": 376,
      "↾": 377,
      "↿": 378,
      "⇉": 379,
      "⇑": 380,
      "⇒": 381,
      "⇔": 382,
      "⇘": 383,
      "⇨": 384,
      "∀": 385,
      "∂": 386,
      "∃": 387,
      "∅": 388,
      "∆": 389,
      "∇": 390,
      "∈": 391,
      "∉": 392,
      "∋": 393,
      "∏": 394,
      "∐": 395,
      "∑": 396,
      "−": 397,
      "∖": 398,
      "∗": 399,
      "∘": 400,
      "∙": 401,
      "√": 402,
      "∞": 403,
      "∠": 404,
      "∡": 405,
      "∣": 406,
      "∤": 407,
      "∥": 408,
      "∧": 409,
      "∨": 410,
      "∩": 411,
      "∪": 412,
      "∫": 413,
      "∮": 414,
      "∯": 415,
      "∼": 416,
      "≃": 417,
      "≅": 418,
      "≈": 419,
      "≌": 420,
      "≟": 421,
      "≠": 422,
      "≡": 423,
      "≣": 424,
      "≤": 425,
      "≥": 426,
      "≪": 427,
      "≫": 428,
      "≰": 429,
      "≱": 430,
      "≺": 431,
      "≼": 432,
      "⊂": 433,
      "⊃": 434,
      "⊆": 435,
      "⊇": 436,
      "⊈": 437,
      "⊓": 438,
      "⊔": 439,
      "⊕": 440,
      "⊗": 441,
      "⊙": 442,
      "⊚": 443,
      "⊛": 444,
      "⊞": 445,
      "⊢": 446,
      "⊣": 447,
      "⊤": 448,
      "⊥": 449,
      "⊨": 450,
      "⊸": 451,
      "⊻": 452,
      "⊼": 453,
      "⋀": 454,
      "⋁": 455,
      "⋂": 456,
      "⋃": 457,
      "⋆": 458,
      "⋈": 459,
      "⋊": 460,
      "⋖": 461,
      "⋙": 462,
      "⋮": 463,
      "⋯": 464,
      "⌈": 465,
      "⌉": 466,
      "⌊": 467,
      "⌋": 468,
      "⌟": 469,
      "⍟": 470,
      "⏩": 471,
      "⏳": 472,
      "─": 473,
      "│": 474,
      "┌": 475,
      "├": 476,
      "□": 477,
      "△": 478,
      "▷": 479,
      "▸": 480,
      "▼": 481,
      "▽": 482,
      "◁": 483,
      "◃": 484,
      "○": 485,
      "◢": 486,
      "◥": 487,
      "◫": 488,
      "◹": 489,
      "◾": 490,
      "◿": 491,
      "♩": 492,
      "♯": 493,
      "⚠": 494,
      "⚬": 495,
      "✝": 496,
      "✶": 497,
      "❓": 498,
      "⟂": 499,
      "⟋": 500,
      "⟍": 501,
      "⟦": 502,
      "⟧": 503,
      "⟨": 504,
      "⟩": 505,
      "⟪": 506,
      "⟫": 507,
      "⟮": 508,
      "⟯": 509,
      "⟵": 510,
      "⟶": 511,
      "⟹": 512,
      "⤳": 513,
      "⥤": 514,
      "⥥": 515,
      "⦃": 516,
      "⦄": 517,
      "⧏": 518,
      "⧸": 519,
      "⨁": 520,
      "⨂": 521,
      "⨅": 522,
      "⨆": 523,
      "⨍": 524,
      "⨯": 525,
      "⨳": 526,
      "⨿": 527,
      "⩿": 528,
      "⬝": 529,
      "ⱼ": 530,
      "ⱽ": 531,
      "꙳": 532,
      "ꜰ": 533,
      "ꜱ": 534,
      "ꞯ": 535,
      "ꟴ": 536,
      "️": 537,
      "－": 538,
      "／": 539,
      "＼": 540,
      "￢": 541,
      "𐞥": 542,
      "𝐒": 543,
      "𝐓": 544,
      "𝐞": 545,
      "𝑳": 546,
      "𝑹": 547,
      "𝒄": 548,
      "𝒅": 549,
      "𝒜": 550,
      "𝒞": 551,
      "𝒟": 552,
      "𝒢": 553,
      "𝒥": 554,
      "𝒪": 555,
      "𝒫": 556,
      "𝒮": 557,
      "𝒯": 558,
      "𝒰": 559,
      "𝒱": 560,
      "𝒳": 561,
      "𝒴": 562,
      "𝒵": 563,
      "𝓐": 564,
      "𝓑": 565,
      "𝓒": 566,
      "𝓓": 567,
      "𝓕": 568,
      "𝓖": 569,
      "𝓘": 570,
      "𝓚": 571,
      "𝓜": 572,
      "𝓝": 573,
      "𝓞": 574,
      "𝓟": 575,
      "𝓡": 576,
      "𝓢": 577,
      "𝓣": 578,
      "𝓤": 579,
      "𝓥": 580,
      "𝓦": 581,
      "𝔇": 582,
      "𝔖": 583,
      "𝔗": 584,
      "𝔠": 585,
      "𝔣": 586,
      "𝔭": 587,
      "𝔮": 588,
      "𝔸": 589,
      "𝔹": 590,
      "𝔻": 591,
      "𝔼": 592,
      "𝔽": 593,
      "𝕀": 594,
      "𝕂": 595,
      "𝕄": 596,
      "𝕆": 597,
      "𝕊": 598,
      "𝕋": 599,
      "𝕌": 600,
      "𝕎": 601,
      "𝕜": 602,
      "𝕝": 603,
      "𝖣": 604,
      "𝟙": 605,
      "𝟭": 606,
      "🆕": 607,
      "🎉": 608,
      "🏁": 609,
      "🐙": 610,
      "💡": 611,
      "🔍": 612,
      "in": 613,
      "on": 614,
      "al": 615,
      "or": 616,
      "er": 617,
      "le": 618,
      "th": 619,
      "at": 620,
      "om": 621,
      "is": 622,
      "re": 623,
      "ct": 624,
      "im": 625,
      "en": 626,
      "un": 627,
      "as": 628,
      "an": 629,
      "em": 630,
      "ap": 631,
      "the": 632,
      "it": 633,
      "ig": 634,
      "ar": 635,
      "et": 636,
      "of": 637,
      "iv": 638,
      "ul": 639,
      "ro": 640,
      "ion": 641,
      "su": 642,
      "if": 643,
      "ed": 644,
      "to": 645,
      "eq": 646,
      "imp": 647,
      "ing": 648,
      "ly": 649,
      "ign": 650,
      "st": 651,
      "align": 652,
      "ce": 653,
      "ex": 654,
      "ab": 655,
      "mul": 656,
      "by": 657,
      "theor": 658,
      "eg": 659,
      "con": 660,
      "dd": 661,
      "simp": 662,
      "fun": 663,
      "com": 664,
      "theorem": 665,
      "de": 666,
      "ge": 667,
      "ic": 668,
      "po": 669,
      "co": 670,
      "iff": 671,
      "int": 672,
      "able": 673,
      "se": 674,
      "ot": 675,
      "es": 676,
      "map": 677,
      "set": 678,
      "lo": 679,
      "act": 680,
      "add": 681,
      "tr": 682,
      "Is": 683,
      "id": 684,
      "sub": 685,
      "ero": 686,
      "ent": 687,
      "us": 688,
      "In": 689,
      "pe": 690,
      "he": 691,
      "pro": 692,
      "fin": 693,
      "rw": 694,
      "orm": 695,
      "du": 696,
      "Su": 697,
      "comp": 698,
      "ith": 699,
      "ht": 700,
      "eas": 701,
      "mm": 702,
      "ory": 703,
      "lt": 704,
      "app": 705,
      "ive": 706,
      "ist": 707,
      "mem": 708,
      "op": 709,
      "zero": 710,
      "pa": 711,
      "ction": 712,
      "easu": 713,
      "Set": 714,
      "one": 715,
      "der": 716,
      "ight": 717,
      "ype": 718,
      "Com": 719,
      "ne": 720,
      "Fin": 721,
      "qu": 722,
      "ra": 723,
      "fl": 724,
      "ha": 725,
      "end": 726,
      "ono": 727,
      "up": 728,
      "ve": 729,
      "ft": 730,
      "apply": 731,
      "The": 732,
      "ib": 733,
      "pace": 734,
      "coe": 735,
      "ort": 736,
      "right": 737,
      "ect": 738,
      "Re": 739,
      "ation": 740,
      "am": 741,
      "rfl": 742,
      "Hom": 743,
      "ver": 744,
      "Sub": 745,
      "ut": 746,
      "Con": 747,
      "ine": 748,
      "ous": 749,
      "ial": 750,
      "tin": 751,
      "oc": 752,
      "let": 753,
      "tinu": 754,
      "and": 755,
      "exact": 756,
      "with": 757,
      "ri": 758,
      "ance": 759,
      "ateg": 760,
      "bra": 761,
      "gebra": 762,
      "tinuous": 763,
      "left": 764,
      "ategory": 765,
      "Fun": 766,
      "inear": 767,
      "ass": 768,
      "fi": 769,
      "ymm": 770,
      "cas": 771,
      "var": 772,
      "ch": 773,
      "Map": 774,
      "Un": 775,
      "roup": 776,
      "imit": 777,
      "for": 778,
      "smul": 779,
      "def": 780,
      "not": 781,
      "easure": 782,
      "ext": 783,
      "il": 784,
      "hf": 785,
      "ite": 786,
      "res": 787,
      "iable": 788,
      "el": 789,
      "neg": 790,
      "ject": 791,
      "rable": 792,
      "inst": 793,
      "age": 794,
      "onoid": 795,
      "mo": 796,
      "norm": 797,
      "symm": 798,
      "pt": 799,
      "Nat": 800,
      "non": 801,
      "Equ": 802,
      "ol": 803,
      "Add": 804,
      "mk": 805,
      "pow": 806,
      "Al": 807,
      "Mul": 808,
      "inv": 809,
      "log": 810,
      "wh": 811,
      "sup": 812,
      "iz": 813,
      "Equiv": 814,
      "equ": 815,
      "pos": 816,
      "Pro": 817,
      "Or": 818,
      "hx": 819,
      "val": 820,
      "Type": 821,
      "hom": 822,
      "ran": 823,
      "dule": 824,
      "ard": 825,
      "cc": 826,
      "have": 827,
      "only": 828,
      "ir": 829,
      "ity": 830,
      "Comp": 831,
      "all": 832,
      "variable": 833,
      "Space": 834,
      "prod": 835,
      "jective": 836,
      "fine": 837,
      "ath": 838,
      "comm": 839,
      "image": 840,
      "Theory": 841,
      "sum": 842,
      "Int": 843,
      "ctor": 844,
      "easurable": 845,
      "instance": 846,
      "nat": 847,
      "To": 848,
      "pr": 849,
      "ift": 850,
      "At": 851,
      "Comm": 852,
      "On": 853,
      "um": 854,
      "ere": 855,
      "Ring": 856,
      "ob": 857,
      "ad": 858,
      "Real": 859,
      "ral": 860,
      "ans": 861,
      "lter": 862,
      "With": 863,
      "Category": 864,
      "gr": 865,
      "lib": 866,
      "import": 867,
      "Of": 868,
      "athlib": 869,
      "Finset": 870,
      "trans": 871,
      "ate": 872,
      "art": 873,
      "pty": 874,
      "hs": 875,
      "und": 876,
      "ph": 877,
      "sing": 878,
      "continuous": 879,
      "Co": 880,
      "Linear": 881,
      "lemm": 882,
      "ain": 883,
      "pre": 884,
      "inter": 885,
      "Po": 886,
      "ens": 887,
      "Monoid": 888,
      "this": 889,
      "subset": 890,
      "intro": 891,
      "const": 892,
      "cl": 893,
      "per": 894,
      "ical": 895,
      "has": 896,
      "Algebra": 897,
      "div": 898,
      "Order": 899,
      "pl": 900,
      "ists": 901,
      "ree": 902,
      "empty": 903,
      "card": 904,
      "lemma": 905,
      "Measure": 906,
      "Mo": 907,
      "top": 908,
      "itive": 909,
      "Mathlib": 910,
      "that": 911,
      "ti": 912,
      "ma": 913,
      "cal": 914,
      "type": 915,
      "egral": 916,
      "ends": 917,
      "ur": 918,
      "equiv": 919,
      "Le": 920,
      "fr": 921,
      "algebra": 922,
      "ound": 923,
      "Iso": 924,
      "orph": 925,
      "lf": 926,
      "Fi": 927,
      "range": 928,
      "jo": 929,
      "Group": 930,
      "where": 931,
      "exists": 932,
      "List": 933,
      "clo": 934,
      "polog": 935,
      "omial": 936,
      "ru": 937,
      "cases": 938,
      "inf": 939,
      "self": 940,
      "get": 941,
      "congr": 942,
      "refine": 943,
      "ition": 944,
      "assoc": 945,
      "Continuous": 946,
      "theory": 947,
      "we": 948,
      "ck": 949,
      "succ": 950,
      "Sem": 951,
      "ant": 952,
      "supp": 953,
      "endsto": 954,
      "lift": 955,
      "measure": 956,
      "module": 957,
      "aliz": 958,
      "etr": 959,
      "pi": 960,
      "af": 961,
      "Has": 962,
      "duct": 963,
      "stri": 964,
      "Unit": 965,
      "group": 966,
      "Measurable": 967,
      "additive": 968,
      "from": 969,
      "nomial": 970,
      "lynomial": 971,
      "Non": 972,
      "ind": 973,
      "ff": 974,
      "imits": 975,
      "ds": 976,
      "erm": 977,
      "univ": 978,
      "open": 979,
      "lex": 980,
      "atri": 981,
      "leton": 982,
      "CategoryTheory": 983,
      "be": 984,
      "strict": 985,
      "ors": 986,
      "Sup": 987,
      "category": 988,
      "reser": 989,
      "order": 990,
      "ker": 991,
      "atrix": 992,
      "Cl": 993,
      "wo": 994,
      "ang": 995,
      "ies": 996,
      "sure": 997,
      "cast": 998,
      "finite": 999,
      "reserv": 1000,
      "sed": 1001,
      "ient": 1002,
      "ame": 1003,
      "ism": 1004,
      "ure": 1005,
      "are": 1006,
      "asis": 1007,
      "ho": 1008,
      "orphism": 1009,
      "Qu": 1010,
      "section": 1011,
      "Op": 1012,
      "then": 1013,
      "singleton": 1014,
      "ime": 1015,
      "ally": 1016,
      "ence": 1017,
      "using": 1018,
      "Ex": 1019,
      "hb": 1020,
      "deal": 1021,
      "Module": 1022,
      "mono": 1023,
      "nd": 1024,
      "hy": 1025,
      "Finite": 1026,
      "Norm": 1027,
      "ring": 1028,
      "function": 1029,
      "integral": 1030,
      "Loc": 1031,
      "joint": 1032,
      "dis": 1033,
      "ke": 1034,
      "Der": 1035,
      "injective": 1036,
      "diff": 1037,
      "ag": 1038,
      "Deriv": 1039,
      "monoid": 1040,
      "ment": 1041,
      "ull": 1042,
      "deriv": 1043,
      "do": 1044,
      "hp": 1045,
      "ue": 1046,
      "Zero": 1047,
      "ated": 1048,
      "Topolog": 1049,
      "Within": 1050,
      "Top": 1051,
      "Li": 1052,
      "exp": 1053,
      "Eq": 1054,
      "Class": 1055,
      "two": 1056,
      "indu": 1057,
      "LinearMap": 1058,
      "filter": 1059,
      "Diff": 1060,
      "au": 1061,
      "Function": 1062,
      "Filter": 1063,
      "ser": 1064,
      "linear": 1065,
      "De": 1066,
      "ounded": 1067,
      "tain": 1068,
      "eval": 1069,
      "iring": 1070,
      "inal": 1071,
      "pan": 1072,
      "hg": 1073,
      "otient": 1074,
      "hds": 1075,
      "iform": 1076,
      "Th": 1077,
      "Str": 1078,
      "EN": 1079,
      "tendsto": 1080,
      "unit": 1081,
      "⁻¹": 1082,
      "nhds": 1083,
      "bi": 1084,
      "unt": 1085,
      "wer": 1086,
      "Inf": 1087,
      "dist": 1088,
      "space": 1089,
      "obj": 1090,
      "di": 1091,
      "hi": 1092,
      "An": 1093,
      "cons": 1094,
      "egree": 1095,
      "des": 1096,
      "no": 1097,
      "gen": 1098,
      "ames": 1099,
      "mp": 1100,
      "St": 1101,
      "measurable": 1102,
      "oo": 1103,
      "Clo": 1104,
      "eld": 1105,
      "heaf": 1106,
      "lement": 1107,
      "Au": 1108,
      "Pre": 1109,
      "hn": 1110,
      "Matrix": 1111,
      "closure": 1112,
      "ding": 1113,
      "ome": 1114,
      "20": 1115,
      "vd": 1116,
      "ast": 1117,
      "bot": 1118,
      "names": 1119,
      "ack": 1120,
      "intype": 1121,
      "nonneg": 1122,
      "max": 1123,
      "nel": 1124,
      "Prop": 1125,
      "NReal": 1126,
      "Ideal": 1127,
      "comap": 1128,
      "dvd": 1129,
      "ruct": 1130,
      "Submodule": 1131,
      "some": 1132,
      "product": 1133,
      "ip": 1134,
      "namespace": 1135,
      "Left": 1136,
      "alse": 1137,
      "Polynomial": 1138,
      "ancel": 1139,
      "ator": 1140,
      "Union": 1141,
      "so": 1142,
      "local": 1143,
      "verse": 1144,
      "Ar": 1145,
      "ae": 1146,
      "file": 1147,
      "AddComm": 1148,
      "ase": 1149,
      "Mult": 1150,
      "root": 1151,
      "simpa": 1152,
      "Functor": 1153,
      "dep": 1154,
      "ta": 1155,
      "ss": 1156,
      "span": 1157,
      "Part": 1158,
      "fst": 1159,
      "obtain": 1160,
      "erent": 1161,
      "Pr": 1162,
      "ary": 1163,
      "ative": 1164,
      "desc": 1165,
      "limit": 1166,
      "Right": 1167,
      "cle": 1168,
      "ometr": 1169,
      "trib": 1170,
      "par": 1171,
      "bed": 1172,
      "sert": 1173,
      "plic": 1174,
      "ers": 1175,
      "iset": 1176,
      "num": 1177,
      "note": 1178,
      "ret": 1179,
      "forall": 1180,
      "functor": 1181,
      "min": 1182,
      "restrict": 1183,
      "part": 1184,
      "ense": 1185,
      "ise": 1186,
      "Em": 1187,
      "real": 1188,
      "Complex": 1189,
      "bedding": 1190,
      "hc": 1191,
      "SMul": 1192,
      "Semiring": 1193,
      "point": 1194,
      "false": 1195,
      "ple": 1196,
      "Homo": 1197,
      "mon": 1198,
      "que": 1199,
      "MeasureTheory": 1200,
      "cid": 1201,
      "angle": 1202,
      "struct": 1203,
      "finset": 1204,
      "abs": 1205,
      "back": 1206,
      "insert": 1207,
      "induction": 1208,
      "Open": 1209,
      "ord": 1210,
      "under": 1211,
      "Dis": 1212,
      "support": 1213,
      "snd": 1214,
      "sem": 1215,
      "Col": 1216,
      "preimage": 1217,
      "ong": 1218,
      "Limits": 1219,
      "defin": 1220,
      "egrable": 1221,
      "Prod": 1222,
      "This": 1223,
      "Basis": 1224,
      "oth": 1225,
      "lic": 1226,
      "Sum": 1227,
      "cidable": 1228,
      "ique": 1229,
      "cted": 1230,
      "ivial": 1231,
      "ible": 1232,
      "can": 1233,
      "ute": 1234,
      "cond": 1235,
      "Icc": 1236,
      "ata": 1237,
      "union": 1238,
      "WithinAt": 1239,
      "ullback": 1240,
      "arg": 1241,
      "action": 1242,
      "etric": 1243,
      "ometry": 1244,
      "row": 1245,
      "Fintype": 1246,
      "If": 1247,
      "cone": 1248,
      "sin": 1249,
      "vert": 1250,
      "orting": 1251,
      "ensor": 1252,
      "list": 1253,
      "reserves": 1254,
      "Se": 1255,
      "Normed": 1256,
      "cancel": 1257,
      "closed": 1258,
      "rjective": 1259,
      "ected": 1260,
      "mod": 1261,
      "tected": 1262,
      "che": 1263,
      "protected": 1264,
      "ular": 1265,
      "actic": 1266,
      "gener": 1267,
      "Topological": 1268,
      "ide": 1269,
      "count": 1270,
      "Cat": 1271,
      "ension": 1272,
      "ange": 1273,
      "omorphism": 1274,
      "ev": 1275,
      "Quotient": 1276,
      "rintro": 1277,
      "Ch": 1278,
      "hm": 1279,
      "pec": 1280,
      "Porting": 1281,
      "coeff": 1282,
      "refl": 1283,
      "Mon": 1284,
      "out": 1285,
      "inl": 1286,
      "logy": 1287,
      "io": 1288,
      "sq": 1289,
      "trivial": 1290,
      "Lean": 1291,
      "iso": 1292,
      "fact": 1293,
      "tice": 1294,
      "ich": 1295,
      "ie": 1296,
      "Cop": 1297,
      "old": 1298,
      "element": 1299,
      "plit": 1300,
      "true": 1301,
      "erentiable": 1302,
      "form": 1303,
      "Limit": 1304,
      "opt": 1305,
      "ization": 1306,
      "ample": 1307,
      "lean": 1308,
      "rel": 1309,
      "kernel": 1310,
      "cont": 1311,
      "We": 1312,
      "upper": 1313,
      "sho": 1314,
      "Simp": 1315,
      "Integral": 1316,
      "eta": 1317,
      "Bot": 1318,
      "ption": 1319,
      "attice": 1320,
      "nonempty": 1321,
      "vex": 1322,
      "rcases": 1323,
      "comput": 1324,
      "hr": 1325,
      "ually": 1326,
      "inr": 1327,
      "lete": 1328,
      "prime": 1329,
      "single": 1330,
      "compl": 1331,
      "class": 1332,
      "simps": 1333,
      "polynomial": 1334,
      "inj": 1335,
      "hab": 1336,
      "omain": 1337,
      "Ab": 1338,
      "example": 1339,
      "For": 1340,
      "Rel": 1341,
      "Ad": 1342,
      "ult": 1343,
      "cy": 1344,
      "option": 1345,
      "Pi": 1346,
      "structure": 1347,
      "rank": 1348,
      "rec": 1349,
      "ENNReal": 1350,
      "disjoint": 1351,
      "case": 1352,
      "onal": 1353,
      "aph": 1354,
      "uniform": 1355,
      "Cast": 1356,
      "ty": 1357,
      "algebraMap": 1358,
      "Decidable": 1359,
      "Nonempty": 1360,
      "eries": 1361,
      "Like": 1362,
      "ore": 1363,
      "star": 1364,
      "Closed": 1365,
      "Fr": 1366,
      "Id": 1367,
      "use": 1368,
      "All": 1369,
      "Compact": 1370,
      "tra": 1371,
      "mpr": 1372,
      "Finsupp": 1373,
      "Multiset": 1374,
      "calar": 1375,
      "basis": 1376,
      "ize": 1377,
      "RingHom": 1378,
      "len": 1379,
      "index": 1380,
      "alence": 1381,
      "Field": 1382,
      "topolog": 1383,
      "asic": 1384,
      "igma": 1385,
      "One": 1386,
      "TopologicalSpace": 1387,
      "subtype": 1388,
      "ian": 1389,
      "join": 1390,
      "ased": 1391,
      "atTop": 1392,
      "dsimp": 1393,
      "Inter": 1394,
      "toFun": 1395,
      "which": 1396,
      "ner": 1397,
      "Mono": 1398,
      "sion": 1399,
      "Data": 1400,
      "computable": 1401,
      "Degree": 1402,
      "Subtype": 1403,
      "ys": 1404,
      "gth": 1405,
      "entually": 1406,
      "low": 1407,
      "DerivAt": 1408,
      "bit": 1409,
      "limits": 1410,
      "Subgroup": 1411,
      "Product": 1412,
      "descr": 1413,
      "Tendsto": 1414,
      "dic": 1415,
      "equal": 1416,
      "alization": 1417,
      "reserved": 1418,
      "any": 1419,
      "Cont": 1420,
      "Topology": 1421,
      "sh": 1422,
      "describ": 1423,
      "pect": 1424,
      "gc": 1425,
      "term": 1426,
      "Ico": 1427,
      "ual": 1428,
      "str": 1429,
      "vari": 1430,
      "Uniform": 1431,
      "Copy": 1432,
      "Sh": 1433,
      "duc": 1434,
      "length": 1435,
      "Alg": 1436,
      "Bo": 1437,
      "noncomputable": 1438,
      "urn": 1439,
      "ilinear": 1440,
      "202": 1441,
      "Bounded": 1442,
      "MonoidHom": 1443,
      "LI": 1444,
      "AddCommGroup": 1445,
      "iven": 1446,
      "Action": 1447,
      "described": 1448,
      "tiplic": 1449,
      "show": 1450,
      "homo": 1451,
      "Lift": 1452,
      "degree": 1453,
      "otone": 1454,
      "ih": 1455,
      "ces": 1456,
      "thors": 1457,
      "nected": 1458,
      "ural": 1459,
      "SE": 1460,
      "fa": 1461,
      "Series": 1462,
      "Embedding": 1463,
      "rans": 1464,
      "Rele": 1465,
      "oal": 1466,
      "Authors": 1467,
      "LIC": 1468,
      "license": 1469,
      "Copyright": 1470,
      "Apa": 1471,
      "Trans": 1472,
      "ball": 1473,
      "rights": 1474,
      "ENSE": 1475,
      "Released": 1476,
      "LICENSE": 1477,
      "Apache": 1478,
      "ates": 1479,
      "ily": 1480,
      "ber": 1481,
      "infer": 1482,
      "lim": 1483,
      "onent": 1484,
      "dual": 1485,
      "natural": 1486,
      "ry": 1487,
      "Ord": 1488,
      "surjective": 1489,
      "Colimit": 1490,
      "nil": 1491,
      "ou": 1492,
      "hain": 1493,
      "Ordered": 1494,
      "its": 1495,
      "elim": 1496,
      "omorph": 1497,
      "Lie": 1498,
      "Aux": 1499,
      "split": 1500,
      "linter": 1501,
      "ax": 1502,
      "pullback": 1503,
      "IsS": 1504,
      "iUnion": 1505,
      "iter": 1506,
      "iSup": 1507,
      "abil": 1508,
      "wise": 1509,
      "over": 1510,
      "wap": 1511,
      "Div": 1512,
      "Localization": 1513,
      "CommRing": 1514,
      "Num": 1515,
      "depend": 1516,
      "bet": 1517,
      "object": 1518,
      "forget": 1519,
      "spec": 1520,
      "10": 1521,
      "ell": 1522,
      "bounded": 1523,
      "position": 1524,
      "fix": 1525,
      "pres": 1526,
      "Unital": 1527,
      "No": 1528,
      "Ioc": 1529,
      "sets": 1530,
      "Submonoid": 1531,
      "sy": 1532,
      "swap": 1533,
      "Dual": 1534,
      "rat": 1535,
      "Mod": 1536,
      "ict": 1537,
      "compact": 1538,
      "ced": 1539,
      "rpow": 1540,
      "ween": 1541,
      "ations": 1542,
      "attr": 1543,
      "imal": 1544,
      "quotient": 1545,
      "conj": 1546,
      "mult": 1547,
      "oi": 1548,
      "amily": 1549,
      "eventually": 1550,
      "Injective": 1551,
      "Option": 1552,
      "ps": 1553,
      "Strict": 1554,
      "between": 1555,
      "fold": 1556,
      "hu": 1557,
      "constru": 1558,
      "variant": 1559,
      "ful": 1560,
      "Expr": 1561,
      "alizer": 1562,
      "Prime": 1563,
      "Metric": 1564,
      "esop": 1565,
      "field": 1566,
      "matrix": 1567,
      "morphism": 1568,
      "Pa": 1569,
      "affine": 1570,
      "Tensor": 1571,
      "else": 1572,
      "definition": 1573,
      "mathlib": 1574,
      "return": 1575,
      "Di": 1576,
      "Seq": 1577,
      "ofReal": 1578,
      "bin": 1579,
      "cur": 1580,
      "tot": 1581,
      "prover": 1582,
      "leanprover": 1583,
      "Gr": 1584,
      "aux": 1585,
      "vector": 1586,
      "Ob": 1587,
      "gcd": 1588,
      "NonUnital": 1589,
      "dependent": 1590,
      "alk": 1591,
      "unique": 1592,
      "inner": 1593,
      "unop": 1594,
      "ay": 1595,
      "Integrable": 1596,
      "ability": 1597,
      "atch": 1598,
      "Free": 1599,
      "Ass": 1600,
      "Val": 1601,
      "Rat": 1602,
      "itt": 1603,
      "Sy": 1604,
      "diag": 1605,
      "Lp": 1606,
      "unity": 1607,
      "choo": 1608,
      "Ext": 1609,
      "inc": 1610,
      "Ioo": 1611,
      "Form": 1612,
      "Locally": 1613,
      "choose": 1614,
      "pure": 1615,
      "same": 1616,
      "Simple": 1617,
      "Var": 1618,
      "Partial": 1619,
      "Fact": 1620,
      "det": 1621,
      "erase": 1622,
      "equivalence": 1623,
      "cret": 1624,
      "nn": 1625,
      "hl": 1626,
      "cop": 1627,
      "Cone": 1628,
      "Coe": 1629,
      "ongly": 1630,
      "crete": 1631,
      "Tactic": 1632,
      "Mv": 1633,
      "lower": 1634,
      "reduc": 1635,
      "sSup": 1636,
      "Inst": 1637,
      "₁₂": 1638,
      "proj": 1639,
      "fle": 1640,
      "Pres": 1641,
      "preserves": 1642,
      "Assoc": 1643,
      "Af": 1644,
      "Point": 1645,
      "none": 1646,
      "mooth": 1647,
      "inorm": 1648,
      "version": 1649,
      "Ne": 1650,
      "graph": 1651,
      "rwa": 1652,
      "complex": 1653,
      "Affine": 1654,
      "adj": 1655,
      "LE": 1656,
      "ideal": 1657,
      "Closure": 1658,
      "integrable": 1659,
      "prop": 1660,
      "MeasurableSet": 1661,
      "factor": 1662,
      "proper": 1663,
      "bound": 1664,
      "differentiable": 1665,
      "Inv": 1666,
      "Lean3": 1667,
      "colimit": 1668,
      "Gen": 1669,
      "Star": 1670,
      "convert": 1671,
      "Ha": 1672,
      "such": 1673,
      "Not": 1674,
      "cos": 1675,
      "sInf": 1676,
      "community": 1677,
      "natCast": 1678,
      "uppercase": 1679,
      "multiplic": 1680,
      "Const": 1681,
      "uppercaseLean3": 1682,
      "hd": 1683,
      "Basic": 1684,
      "tho": 1685,
      "eomorph": 1686,
      "hz": 1687,
      "also": 1688,
      "goal": 1689,
      "rev": 1690,
      "Ro": 1691,
      "fderiv": 1692,
      "constructor": 1693,
      "Ioi": 1694,
      "ape": 1695,
      "convex": 1696,
      "natDegree": 1697,
      "ection": 1698,
      "dire": 1699,
      "iInf": 1700,
      "Pos": 1701,
      "ach": 1702,
      "commut": 1703,
      "functions": 1704,
      "By": 1705,
      "separ": 1706,
      "reducible": 1707,
      "char": 1708,
      "Complete": 1709,
      "Instance": 1710,
      "inverse": 1711,
      "append": 1712,
      "Preserves": 1713,
      "Domain": 1714,
      "pair": 1715,
      "Ball": 1716,
      "pus": 1717,
      "zpow": 1718,
      "Homology": 1719,
      "Char": 1720,
      "igroup": 1721,
      "NNReal": 1722,
      "aesop": 1723,
      "cent": 1724,
      "ᵒᵖ": 1725,
      "Iic": 1726,
      "ove": 1727,
      "indic": 1728,
      "DecidableEq": 1729,
      "change": 1730,
      "maps": 1731,
      "hk": 1732,
      "Count": 1733,
      "base": 1734,
      "imension": 1735,
      "Lattice": 1736,
      "Sheaf": 1737,
      "ram": 1738,
      "match": 1739,
      "lintegral": 1740,
      "xs": 1741,
      "tactic": 1742,
      "extend": 1743,
      "ior": 1744,
      "Bi": 1745,
      "Name": 1746,
      "onglyMeasurable": 1747,
      "isymm": 1748,
      "ali": 1749,
      "pose": 1750,
      "h2": 1751,
      "Subalgebra": 1752,
      "subgroup": 1753,
      "fir": 1754,
      "h1": 1755,
      "Perm": 1756,
      "ci": 1757,
      "perm": 1758,
      "first": 1759,
      "MulAction": 1760,
      "indicator": 1761,
      "bind": 1762,
      "Ker": 1763,
      "Ap": 1764,
      "ray": 1765,
      "prove": 1766,
      "poly": 1767,
      "Card": 1768,
      "bo": 1769,
      "olut": 1770,
      "AddGroup": 1771,
      "ren": 1772,
      "embedding": 1773,
      "uation": 1774,
      "Fraction": 1775,
      "monotone": 1776,
      "ep": 1777,
      "when": 1778,
      "but": 1779,
      "Bool": 1780,
      "simple": 1781,
      "connected": 1782,
      "AlgHom": 1783,
      "calc": 1784,
      "MeasurableSpace": 1785,
      "adjoin": 1786,
      "find": 1787,
      "cau": 1788,
      "proof": 1789,
      "Ici": 1790,
      "power": 1791,
      "ill": 1792,
      "hv": 1793,
      "LinearEquiv": 1794,
      "free": 1795,
      "entr": 1796,
      "finrank": 1797,
      "associ": 1798,
      "AddCommMonoid": 1799,
      "very": 1800,
      "Differentiable": 1801,
      "isker": 1802,
      "ded": 1803,
      "AE": 1804,
      "Max": 1805,
      "toReal": 1806,
      "Root": 1807,
      "size": 1808,
      "incl": 1809,
      "Divis": 1810,
      "undle": 1811,
      "urce": 1812,
      "cycle": 1813,
      "ify": 1814,
      "li": 1815,
      "submodule": 1816,
      "antisymm": 1817,
      "ward": 1818,
      "itz": 1819,
      "arget": 1820,
      "tensor": 1821,
      "result": 1822,
      "tribute": 1823,
      "isOpen": 1824,
      "MvPolynomial": 1825,
      "itial": 1826,
      "est": 1827,
      "irw": 1828,
      "ork": 1829,
      "del": 1830,
      "irwise": 1831,
      "used": 1832,
      "ector": 1833,
      "See": 1834,
      "Unique": 1835,
      "there": 1836,
      "ther": 1837,
      "sigma": 1838,
      "Ordinal": 1839,
      "ac": 1840,
      "gt": 1841,
      "semiring": 1842,
      "alias": 1843,
      "lin": 1844,
      "uld": 1845,
      "Term": 1846,
      "cf": 1847,
      "incip": 1848,
      "Up": 1849,
      "nth": 1850,
      "edSpace": 1851,
      "topological": 1852,
      "Empty": 1853,
      "uage": 1854,
      "anguage": 1855,
      "Arrow": 1856,
      "Kernel": 1857,
      "suf": 1858,
      "Convex": 1859,
      "date": 1860,
      "cated": 1861,
      "ter": 1862,
      "closedBall": 1863,
      "alized": 1864,
      "hq": 1865,
      "distrib": 1866,
      "rum": 1867,
      "pectrum": 1868,
      "rt": 1869,
      "mall": 1870,
      "seq": 1871,
      "reverse": 1872,
      "countable": 1873,
      "Cy": 1874,
      "domain": 1875,
      "given": 1876,
      "update": 1877,
      "den": 1878,
      "IsOpen": 1879,
      "pred": 1880,
      "Ant": 1881,
      "rop": 1882,
      "Algebraic": 1883,
      "isomorphism": 1884,
      "decl": 1885,
      "lie": 1886,
      "Congr": 1887,
      "Vector": 1888,
      "Cof": 1889,
      "hj": 1890,
      "Disjoint": 1891,
      "topology": 1892,
      "Quot": 1893,
      "ess": 1894,
      "prov": 1895,
      "flect": 1896,
      "ace": 1897,
      "family": 1898,
      "Pullback": 1899,
      "edist": 1900,
      "attribute": 1901,
      "source": 1902,
      "ited": 1903,
      "ents": 1904,
      "mmable": 1905,
      "since": 1906,
      "induced": 1907,
      "interval": 1908,
      "vadd": 1909,
      "Multilinear": 1910,
      "ident": 1911,
      "posite": 1912,
      "port": 1913,
      "assum": 1914,
      "imensional": 1915,
      "hout": 1916,
      "Presheaf": 1917,
      "bability": 1918,
      "ofNat": 1919,
      "composition": 1920,
      "Sigma": 1921,
      "topy": 1922,
      "elements": 1923,
      "cover": 1924,
      "WithZero": 1925,
      "Semi": 1926,
      "Meta": 1927,
      "nsmul": 1928,
      "Bin": 1929,
      "Seminorm": 1930,
      "alize": 1931,
      "ust": 1932,
      "Fn": 1933,
      "Distrib": 1934,
      "pes": 1935,
      "FunLike": 1936,
      "homology": 1937,
      "sdiff": 1938,
      "rier": 1939,
      "curry": 1940,
      "multiset": 1941,
      "uct": 1942,
      "FDerivAt": 1943,
      "fices": 1944,
      "whisker": 1945,
      "Im": 1946,
      "ak": 1947,
      "rou": 1948,
      "ensity": 1949,
      "hxy": 1950,
      "habited": 1951,
      "oangle": 1952,
      "Pair": 1953,
      "Scalar": 1954,
      "interior": 1955,
      "sqrt": 1956,
      "center": 1957,
      "tsum": 1958,
      "col": 1959,
      "Struct": 1960,
      "conv": 1961,
      "cess": 1962,
      "FDeriv": 1963,
      "suffices": 1964,
      "derivative": 1965,
      "shift": 1966,
      "Cardinal": 1967,
      "AddMonoid": 1968,
      "lock": 1969,
      "inferInstance": 1970,
      "target": 1971,
      "Array": 1972,
      "finsupp": 1973,
      "Tower": 1974,
      "contain": 1975,
      "Tr": 1976,
      "Succ": 1977,
      "haveI": 1978,
      "ting": 1979,
      "ircle": 1980,
      "cor": 1981,
      "CommSemiring": 1982,
      "edi": 1983,
      "value": 1984,
      "incipal": 1985,
      "Reg": 1986,
      "partial": 1987,
      "total": 1988,
      "otom": 1989,
      "Units": 1990,
      "Shape": 1991,
      "equence": 1992,
      "Obj": 1993,
      "ale": 1994,
      "naturality": 1995,
      "chitz": 1996,
      "Coeff": 1997,
      "quot": 1998,
      "Classical": 1999,
      "Iio": 2000,
      "itone": 2001,
      "erse": 2002,
      "Abs": 2003,
      "Given": 2004,
      "other": 2005,
      "Separ": 2006,
      "condition": 2007,
      "OD": 2008,
      "every": 2009,
      "pot": 2010,
      "into": 2011,
      "Preorder": 2012,
      "universe": 2013,
      "sign": 2014,
      "Regular": 2015,
      "complete": 2016,
      "reg": 2017,
      "series": 2018,
      "alg": 2019,
      "elian": 2020,
      "precated": 2021,
      "thog": 2022,
      "ream": 2023,
      "need": 2024,
      "Homeomorph": 2025,
      "olution": 2026,
      "thogonal": 2027,
      "Lo": 2028,
      "ContinuousLinearMap": 2029,
      "Independent": 2030,
      "Main": 2031,
      "Span": 2032,
      "head": 2033,
      "19": 2034,
      "Power": 2035,
      "MDiff": 2036,
      "aeval": 2037,
      "Note": 2038,
      "within": 2039,
      "tail": 2040,
      "chy": 2041,
      "smooth": 2042,
      "ann": 2043,
      "As": 2044,
      "Iff": 2045,
      "points": 2046,
      "ContDiff": 2047,
      "fintype": 2048,
      "Subsingleton": 2049,
      "locally": 2050,
      "units": 2051,
      "pri": 2052,
      "erw": 2053,
      "subsingleton": 2054,
      "Cocone": 2055,
      "nhdsWithin": 2056,
      "Graph": 2057,
      "deprecated": 2058,
      "Func": 2059,
      "homomorphism": 2060,
      "node": 2061,
      "Sort": 2062,
      "Anal": 2063,
      "Ge": 2064,
      "Local": 2065,
      "ZMod": 2066,
      "isClosed": 2067,
      "coped": 2068,
      "ivity": 2069,
      "repl": 2070,
      "gu": 2071,
      "tsub": 2072,
      "2024": 2073,
      "Spec": 2074,
      "Big": 2075,
      "AddMonoidHom": 2076,
      "NormedSpace": 2077,
      "name": 2078,
      "scoped": 2079,
      "iterate": 2080,
      "En": 2081,
      "epi": 2082,
      "Surjective": 2083,
      "hS": 2084,
      "sheaf": 2085,
      "Mem": 2086,
      "Path": 2087,
      "BigO": 2088,
      "arith": 2089,
      "partition": 2090,
      "equalizer": 2091,
      "arrow": 2092,
      "notation": 2093,
      "vsub": 2094,
      "Component": 2095,
      "dec": 2096,
      "Epi": 2097,
      "hI": 2098,
      "prior": 2099,
      "fig": 2100,
      "Geometry": 2101,
      "usion": 2102,
      "hP": 2103,
      "Range": 2104,
      "defined": 2105,
      "infinite": 2106,
      "Lin": 2107,
      "snorm": 2108,
      "wn": 2109,
      "Countable": 2110,
      "alent": 2111,
      "Isometry": 2112,
      "End": 2113,
      "ose": 2114,
      "reassoc": 2115,
      "rect": 2116,
      "ysis": 2117,
      "Restrict": 2118,
      "push": 2119,
      "line": 2120,
      "Arg": 2121,
      "Sch": 2122,
      "tri": 2123,
      "trace": 2124,
      "seu": 2125,
      "Adj": 2126,
      "zsmul": 2127,
      "each": 2128,
      "priority": 2129,
      "Adjoint": 2130,
      "toFinset": 2131,
      "Gener": 2132,
      "hU": 2133,
      "Indep": 2134,
      "nnnorm": 2135,
      "ror": 2136,
      "ick": 2137,
      "ieve": 2138,
      "Par": 2139,
      "requ": 2140,
      "vol": 2141,
      "invFun": 2142,
      "chain": 2143,
      "repr": 2144,
      "does": 2145,
      "number": 2146,
      "CommMonoid": 2147,
      "isUnit": 2148,
      "dup": 2149,
      "Walk": 2150,
      "basic": 2151,
      "MVar": 2152,
      "From": 2153,
      "IsLimit": 2154,
      "Above": 2155,
      "Nontrivial": 2156,
      "localization": 2157,
      "av": 2158,
      "factors": 2159,
      "Ev": 2160,
      "Sing": 2161,
      "weight": 2162,
      "constant": 2163,
      "alo": 2164,
      "ison": 2165,
      "oned": 2166,
      "Min": 2167,
      "Res": 2168,
      "App": 2169,
      "algebraic": 2170,
      "atis": 2171,
      "Cover": 2172,
      "Binary": 2173,
      "Monotone": 2174,
      "guard": 2175,
      "normal": 2176,
      "lemmas": 2177,
      "unction": 2178,
      "calarTower": 2179,
      "IsScalarTower": 2180,
      "Connected": 2181,
      "Cancel": 2182,
      "ega": 2183,
      "semigroup": 2184,
      "ucl": 2185,
      "SimpleGraph": 2186,
      "new": 2187,
      "continuousOn": 2188,
      "TensorProduct": 2189,
      "define": 2190,
      "hw": 2191,
      "idean": 2192,
      "uclidean": 2193,
      "brev": 2194,
      "continuousAt": 2195,
      "red": 2196,
      "oneda": 2197,
      "ish": 2198,
      "ault": 2199,
      "Inhabited": 2200,
      "Colimits": 2201,
      "clotom": 2202,
      "clotomic": 2203,
      "Ru": 2204,
      "eous": 2205,
      "data": 2206,
      "quare": 2207,
      "Monoidal": 2208,
      "default": 2209,
      "Bound": 2210,
      "IsIso": 2211,
      "monomial": 2212,
      "adrat": 2213,
      "adratic": 2214,
      "conver": 2215,
      "biUnion": 2216,
      "100": 2217,
      "property": 2218,
      "prox": 2219,
      "than": 2220,
      "od": 2221,
      "orthogonal": 2222,
      "oid": 2223,
      "entation": 2224,
      "letion": 2225,
      "Opens": 2226,
      "extension": 2227,
      "measurableSet": 2228,
      "cat": 2229,
      "cardinal": 2230,
      "Cau": 2231,
      "ics": 2232,
      "even": 2233,
      "Er": 2234,
      "code": 2235,
      "separable": 2236,
      "edge": 2237,
      "Structure": 2238,
      "generate": 2239,
      "these": 2240,
      "funext": 2241,
      "Equivalence": 2242,
      "17": 2243,
      "agonal": 2244,
      "MultilinearMap": 2245,
      "Density": 2246,
      "acter": 2247,
      "gh": 2248,
      "principal": 2249,
      "toList": 2250,
      "normed": 2251,
      "seudo": 2252,
      "abbrev": 2253,
      "iber": 2254,
      "me": 2255,
      "Jo": 2256,
      "irreducible": 2257,
      "see": 2258,
      "oper": 2259,
      "diagonal": 2260,
      "contr": 2261,
      "SetLike": 2262,
      "setOf": 2263,
      "∫⁻": 2264,
      "cof": 2265,
      "cod": 2266,
      "geneous": 2267,
      "Rule": 2268,
      "alois": 2269,
      "submonoid": 2270,
      "replace": 2271,
      "ating": 2272,
      "ordered": 2273,
      "spaces": 2274,
      "StronglyMeasurable": 2275,
      "Divisors": 2276,
      "Tri": 2277,
      "Image": 2278,
      "well": 2279,
      "Morphism": 2280,
      "He": 2281,
      "ume": 2282,
      "logical": 2283,
      "Inverse": 2284,
      "itivity": 2285,
      "enn": 2286,
      "IsColimit": 2287,
      "move": 2288,
      "ContinuousMap": 2289,
      "Subring": 2290,
      "volume": 2291,
      "wr": 2292,
      "IH": 2293,
      "Game": 2294,
      "Mk": 2295,
      "products": 2296,
      "bdd": 2297,
      "flip": 2298,
      "Lex": 2299,
      "sequence": 2300,
      "Extension": 2301,
      "ᵒᵈ": 2302,
      "Pow": 2303,
      "omega": 2304,
      "Dimensional": 2305,
      "fol": 2306,
      "last": 2307,
      "asi": 2308,
      "→₀": 2309,
      "ediate": 2310,
      "bundle": 2311,
      "cause": 2312,
      "raded": 2313,
      "potent": 2314,
      "continu": 2315,
      "alle": 2316,
      "Homotopy": 2317,
      "Cycle": 2318,
      "18": 2319,
      "nontrivial": 2320,
      "vertible": 2321,
      "Prim": 2322,
      "ater": 2323,
      "Fir": 2324,
      "Pus": 2325,
      "ms": 2326,
      "poid": 2327,
      "ub": 2328,
      "Discrete": 2329,
      "roupoid": 2330,
      "drop": 2331,
      "satis": 2332,
      "fixed": 2333,
      "cocone": 2334,
      "argum": 2335,
      "lattice": 2336,
      "Support": 2337,
      "First": 2338,
      "Sym": 2339,
      "dom": 2340,
      "rule": 2341,
      "ithful": 2342,
      "path": 2343,
      "initial": 2344,
      "nta": 2345,
      "ntax": 2346,
      "hfg": 2347,
      "flects": 2348,
      "Analysis": 2349,
      "tw": 2350,
      "TOD": 2351,
      "Additive": 2352,
      "commutative": 2353,
      "TODO": 2354,
      "triangle": 2355,
      "cmp": 2356,
      "expres": 2357,
      "Normal": 2358,
      "presheaf": 2359,
      "Proper": 2360,
      "valu": 2361,
      "Core": 2362,
      "LT": 2363,
      "fer": 2364,
      "contDiff": 2365,
      "State": 2366,
      "special": 2367,
      "Family": 2368,
      "hT": 2369,
      "inclusion": 2370,
      "AddSubgroup": 2371,
      "maximal": 2372,
      "dense": 2373,
      "roots": 2374,
      "elab": 2375,
      "hij": 2376,
      "rot": 2377,
      "TopCat": 2378,
      "aw": 2379,
      "bers": 2380,
      "Pred": 2381,
      "take": 2382,
      "It": 2383,
      "UniformSpace": 2384,
      "fg": 2385,
      "Opposite": 2386,
      "iterated": 2387,
      "Cond": 2388,
      "respect": 2389,
      "summable": 2390,
      "nonpos": 2391,
      "ModuleCat": 2392,
      "Factor": 2393,
      "Scalars": 2394,
      "L1": 2395,
      "Neg": 2396,
      "phere": 2397,
      "ca": 2398,
      "run": 2399,
      "vi": 2400,
      "lead": 2401,
      "decidable": 2402,
      "Ga": 2403,
      "Probability": 2404,
      "check": 2405,
      "NormedAddCommGroup": 2406,
      "config": 2407,
      "LinearOrdered": 2408,
      "was": 2409,
      "WithTop": 2410,
      "Object": 2411,
      "IsUnit": 2412,
      "eme": 2413,
      "adjoint": 2414,
      "will": 2415,
      "Dist": 2416,
      "MetricSpace": 2417,
      "cm": 2418,
      "Be": 2419,
      "deg": 2420,
      "equivalent": 2421,
      "Per": 2422,
      "assumption": 2423,
      "Language": 2424,
      "small": 2425,
      "relation": 2426,
      "resp": 2427,
      "String": 2428,
      "plicit": 2429,
      "led": 2430,
      "Grp": 2431,
      "h0": 2432,
      "lhs": 2433,
      "Proj": 2434,
      "lab": 2435,
      "Bor": 2436,
      "car": 2437,
      "equality": 2438,
      "about": 2439,
      "classical": 2440,
      "idi": 2441,
      "imitive": 2442,
      "divis": 2443,
      "regular": 2444,
      "Box": 2445,
      "Ind": 2446,
