{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PROOFSTATE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[PROOFSTEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[TACTICS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Punctuation",
        "behavior": "Isolated"
      },
      {
        "type": "Whitespace"
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[EOS]": 2,
      "[PROOFSTATE]": 3,
      "[PROOFSTEP]": 4,
      "[TACTICS]": 5,
      "[SEP]": 6,
      "!": 7,
      "\"": 8,
      "#": 9,
      "$": 10,
      "%": 11,
      "&": 12,
      "'": 13,
      "(": 14,
      ")": 15,
      "*": 16,
      "+": 17,
      ",": 18,
      "-": 19,
      ".": 20,
      "/": 21,
      "0": 22,
      "1": 23,
      "2": 24,
      "3": 25,
      "4": 26,
      "5": 27,
      "6": 28,
      "7": 29,
      "8": 30,
      "9": 31,
      ":": 32,
      ";": 33,
      "<": 34,
      "=": 35,
      ">": 36,
      "?": 37,
      "@": 38,
      "A": 39,
      "B": 40,
      "C": 41,
      "D": 42,
      "E": 43,
      "F": 44,
      "G": 45,
      "H": 46,
      "I": 47,
      "J": 48,
      "K": 49,
      "L": 50,
      "M": 51,
      "N": 52,
      "O": 53,
      "P": 54,
      "Q": 55,
      "R": 56,
      "S": 57,
      "T": 58,
      "U": 59,
      "V": 60,
      "W": 61,
      "X": 62,
      "Y": 63,
      "Z": 64,
      "[": 65,
      "\\": 66,
      "]": 67,
      "^": 68,
      "_": 69,
      "`": 70,
      "a": 71,
      "b": 72,
      "c": 73,
      "d": 74,
      "e": 75,
      "f": 76,
      "g": 77,
      "h": 78,
      "i": 79,
      "j": 80,
      "k": 81,
      "l": 82,
      "m": 83,
      "n": 84,
      "o": 85,
      "p": 86,
      "q": 87,
      "r": 88,
      "s": 89,
      "t": 90,
      "u": 91,
      "v": 92,
      "w": 93,
      "x": 94,
      "y": 95,
      "z": 96,
      "{": 97,
      "|": 98,
      "}": 99,
      "~": 100,
      "¥": 101,
      "§": 102,
      "«": 103,
      "¬": 104,
      "°": 105,
      "±": 106,
      "²": 107,
      "³": 108,
      "´": 109,
      "µ": 110,
      "·": 111,
      "¹": 112,
      "»": 113,
      "½": 114,
      "Á": 115,
      "É": 116,
      "×": 117,
      "ß": 118,
      "à": 119,
      "á": 120,
      "ä": 121,
      "æ": 122,
      "ç": 123,
      "è": 124,
      "é": 125,
      "ê": 126,
      "ë": 127,
      "ì": 128,
      "í": 129,
      "ï": 130,
      "ò": 131,
      "ó": 132,
      "ô": 133,
      "ö": 134,
      "ø": 135,
      "ü": 136,
      "ý": 137,
      "ă": 138,
      "ć": 139,
      "Č": 140,
      "č": 141,
      "ĝ": 142,
      "Ł": 143,
      "ł": 144,
      "ń": 145,
      "ō": 146,
      "ő": 147,
      "ř": 148,
      "ś": 149,
      "Š": 150,
      "š": 151,
      "Ž": 152,
      "ɢ": 153,
      "ɪ": 154,
      "ɴ": 155,
      "ʀ": 156,
      "ʏ": 157,
      "ʙ": 158,
      "ʜ": 159,
      "ʟ": 160,
      "ʰ": 161,
      "ʲ": 162,
      "ʳ": 163,
      "ʷ": 164,
      "ʸ": 165,
      "ˡ": 166,
      "ˢ": 167,
      "ˣ": 168,
      "̀": 169,
      "̂": 170,
      "Β": 171,
      "Γ": 172,
      "Δ": 173,
      "Θ": 174,
      "Ι": 175,
      "Λ": 176,
      "Π": 177,
      "Σ": 178,
      "Φ": 179,
      "Ψ": 180,
      "Ω": 181,
      "α": 182,
      "β": 183,
      "γ": 184,
      "δ": 185,
      "ε": 186,
      "ζ": 187,
      "η": 188,
      "θ": 189,
      "ι": 190,
      "κ": 191,
      "λ": 192,
      "μ": 193,
      "ν": 194,
      "ξ": 195,
      "π": 196,
      "ρ": 197,
      "σ": 198,
      "τ": 199,
      "υ": 200,
      "φ": 201,
      "χ": 202,
      "ψ": 203,
      "ω": 204,
      "ϕ": 205,
      "ϖ": 206,
      "И": 207,
      "а": 208,
      "в": 209,
      "и": 210,
      "н": 211,
      "о": 212,
      "ч": 213,
      "ᗮ": 214,
      "ᘁ": 215,
      "ᴀ": 216,
      "ᴄ": 217,
      "ᴅ": 218,
      "ᴇ": 219,
      "ᴊ": 220,
      "ᴋ": 221,
      "ᴍ": 222,
      "ᴏ": 223,
      "ᴘ": 224,
      "ᴛ": 225,
      "ᴜ": 226,
      "ᴠ": 227,
      "ᴡ": 228,
      "ᴢ": 229,
      "ᴬ": 230,
      "ᴮ": 231,
      "ᴰ": 232,
      "ᴱ": 233,
      "ᴳ": 234,
      "ᴴ": 235,
      "ᴵ": 236,
      "ᴶ": 237,
      "ᴷ": 238,
      "ᴸ": 239,
      "ᴹ": 240,
      "ᴺ": 241,
      "ᴼ": 242,
      "ᴾ": 243,
      "ᴿ": 244,
      "ᵀ": 245,
      "ᵁ": 246,
      "ᵂ": 247,
      "ᵃ": 248,
      "ᵇ": 249,
      "ᵈ": 250,
      "ᵉ": 251,
      "ᵋ": 252,
      "ᵍ": 253,
      "ᵏ": 254,
      "ᵐ": 255,
      "ᵒ": 256,
      "ᵖ": 257,
      "ᵗ": 258,
      "ᵘ": 259,
      "ᵛ": 260,
      "ᵝ": 261,
      "ᵞ": 262,
      "ᵟ": 263,
      "ᵠ": 264,
      "ᵡ": 265,
      "ᵢ": 266,
      "ᵣ": 267,
      "ᵤ": 268,
      "ᵥ": 269,
      "ᵦ": 270,
      "ᵧ": 271,
      "ᵨ": 272,
      "ᵩ": 273,
      "ᵪ": 274,
      "ᶜ": 275,
      "ᶠ": 276,
      "ᶥ": 277,
      "ᶹ": 278,
      "ᶻ": 279,
      "ᶿ": 280,
      "ầ": 281,
      "ỳ": 282,
      "​": 283,
      "‌": 284,
      "–": 285,
      "—": 286,
      "‖": 287,
      "’": 288,
      "“": 289,
      "”": 290,
      "†": 291,
      "•": 292,
      "…": 293,
      "′": 294,
      "‹": 295,
      "›": 296,
      "‼": 297,
      "⁄": 298,
      "⁅": 299,
      "⁆": 300,
      "⁰": 301,
      "ⁱ": 302,
      "⁴": 303,
      "⁵": 304,
      "⁶": 305,
      "⁷": 306,
      "⁸": 307,
      "⁹": 308,
      "⁺": 309,
      "⁻": 310,
      "⁼": 311,
      "⁽": 312,
      "⁾": 313,
      "ⁿ": 314,
      "₀": 315,
      "₁": 316,
      "₂": 317,
      "₃": 318,
      "₄": 319,
      "₅": 320,
      "₆": 321,
      "₇": 322,
      "₈": 323,
      "₉": 324,
      "₊": 325,
      "₋": 326,
      "₌": 327,
      "₍": 328,
      "₎": 329,
      "ₐ": 330,
      "ₑ": 331,
      "ₒ": 332,
      "ₓ": 333,
      "ₕ": 334,
      "ₖ": 335,
      "ₗ": 336,
      "ₘ": 337,
      "ₙ": 338,
      "ₚ": 339,
      "ₛ": 340,
      "ₜ": 341,
      "ℂ": 342,
      "ℋ": 343,
      "ℍ": 344,
      "ℐ": 345,
      "ℑ": 346,
      "ℒ": 347,
      "ℓ": 348,
      "ℕ": 349,
      "№": 350,
      "ℙ": 351,
      "ℚ": 352,
      "ℜ": 353,
      "ℝ": 354,
      "™": 355,
      "ℤ": 356,
      "ℬ": 357,
      "ℰ": 358,
      "ℱ": 359,
      "ℳ": 360,
      "ℵ": 361,
      "⅓": 362,
      "⅟": 363,
      "←": 364,
      "↑": 365,
      "→": 366,
      "↓": 367,
      "↔": 368,
      "↗": 369,
      "↘": 370,
      "↟": 371,
      "↠": 372,
      "↥": 373,
      "↦": 374,
      "↪": 375,
      "↭": 376,
      "↻": 377,
      "↾": 378,
      "↿": 379,
      "⇉": 380,
      "⇑": 381,
      "⇒": 382,
      "⇔": 383,
      "⇘": 384,
      "⇨": 385,
      "∀": 386,
      "∂": 387,
      "∃": 388,
      "∅": 389,
      "∆": 390,
      "∇": 391,
      "∈": 392,
      "∉": 393,
      "∋": 394,
      "∏": 395,
      "∐": 396,
      "∑": 397,
      "−": 398,
      "∖": 399,
      "∗": 400,
      "∘": 401,
      "∙": 402,
      "√": 403,
      "∞": 404,
      "∠": 405,
      "∡": 406,
      "∣": 407,
      "∤": 408,
      "∥": 409,
      "∧": 410,
      "∨": 411,
      "∩": 412,
      "∪": 413,
      "∫": 414,
      "∮": 415,
      "∯": 416,
      "∼": 417,
      "≃": 418,
      "≅": 419,
      "≈": 420,
      "≌": 421,
      "≟": 422,
      "≠": 423,
      "≡": 424,
      "≣": 425,
      "≤": 426,
      "≥": 427,
      "≪": 428,
      "≫": 429,
      "≰": 430,
      "≱": 431,
      "≺": 432,
      "≼": 433,
      "⊂": 434,
      "⊃": 435,
      "⊆": 436,
      "⊇": 437,
      "⊈": 438,
      "⊓": 439,
      "⊔": 440,
      "⊕": 441,
      "⊗": 442,
      "⊙": 443,
      "⊚": 444,
      "⊛": 445,
      "⊞": 446,
      "⊢": 447,
      "⊣": 448,
      "⊤": 449,
      "⊥": 450,
      "⊨": 451,
      "⊸": 452,
      "⊻": 453,
      "⊼": 454,
      "⋀": 455,
      "⋁": 456,
      "⋂": 457,
      "⋃": 458,
      "⋆": 459,
      "⋈": 460,
      "⋊": 461,
      "⋖": 462,
      "⋙": 463,
      "⋮": 464,
      "⋯": 465,
      "⌈": 466,
      "⌉": 467,
      "⌊": 468,
      "⌋": 469,
      "⌟": 470,
      "⍟": 471,
      "⏩": 472,
      "⏳": 473,
      "─": 474,
      "│": 475,
      "┌": 476,
      "├": 477,
      "□": 478,
      "△": 479,
      "▷": 480,
      "▸": 481,
      "▼": 482,
      "▽": 483,
      "◁": 484,
      "◃": 485,
      "○": 486,
      "◢": 487,
      "◥": 488,
      "◫": 489,
      "◹": 490,
      "◾": 491,
      "◿": 492,
      "♩": 493,
      "♯": 494,
      "⚠": 495,
      "⚬": 496,
      "✝": 497,
      "✶": 498,
      "❓": 499,
      "⟂": 500,
      "⟋": 501,
      "⟍": 502,
      "⟦": 503,
      "⟧": 504,
      "⟨": 505,
      "⟩": 506,
      "⟪": 507,
      "⟫": 508,
      "⟮": 509,
      "⟯": 510,
      "⟵": 511,
      "⟶": 512,
      "⟹": 513,
      "⤳": 514,
      "⥤": 515,
      "⥥": 516,
      "⦃": 517,
      "⦄": 518,
      "⧏": 519,
      "⧸": 520,
      "⨁": 521,
      "⨂": 522,
      "⨅": 523,
      "⨆": 524,
      "⨍": 525,
      "⨯": 526,
      "⨳": 527,
      "⨿": 528,
      "⩿": 529,
      "⬝": 530,
      "ⱼ": 531,
      "ⱽ": 532,
      "꙳": 533,
      "ꜰ": 534,
      "ꜱ": 535,
      "ꞯ": 536,
      "ꟴ": 537,
      "️": 538,
      "－": 539,
      "／": 540,
      "＼": 541,
      "￢": 542,
      "𐞥": 543,
      "𝐒": 544,
      "𝐓": 545,
      "𝐞": 546,
      "𝑳": 547,
      "𝑹": 548,
      "𝒄": 549,
      "𝒅": 550,
      "𝒜": 551,
      "𝒞": 552,
      "𝒟": 553,
      "𝒢": 554,
      "𝒥": 555,
      "𝒪": 556,
      "𝒫": 557,
      "𝒮": 558,
      "𝒯": 559,
      "𝒰": 560,
      "𝒱": 561,
      "𝒳": 562,
      "𝒴": 563,
      "𝒵": 564,
      "𝓐": 565,
      "𝓑": 566,
      "𝓒": 567,
      "𝓓": 568,
      "𝓕": 569,
      "𝓖": 570,
      "𝓘": 571,
      "𝓚": 572,
      "𝓜": 573,
      "𝓝": 574,
      "𝓞": 575,
      "𝓟": 576,
      "𝓡": 577,
      "𝓢": 578,
      "𝓣": 579,
      "𝓤": 580,
      "𝓥": 581,
      "𝓦": 582,
      "𝔇": 583,
      "𝔖": 584,
      "𝔗": 585,
      "𝔠": 586,
      "𝔣": 587,
      "𝔭": 588,
      "𝔮": 589,
      "𝔸": 590,
      "𝔹": 591,
      "𝔻": 592,
      "𝔼": 593,
      "𝔽": 594,
      "𝕀": 595,
      "𝕂": 596,
      "𝕄": 597,
      "𝕆": 598,
      "𝕊": 599,
      "𝕋": 600,
      "𝕌": 601,
      "𝕎": 602,
      "𝕜": 603,
      "𝕝": 604,
      "𝖣": 605,
      "𝟙": 606,
      "𝟭": 607,
      "🆕": 608,
      "🎉": 609,
      "🏁": 610,
      "🐙": 611,
      "💡": 612,
      "🔍": 613,
      "in": 614,
      "on": 615,
      "al": 616,
      "or": 617,
      "er": 618,
      "le": 619,
      "th": 620,
      "at": 621,
      "om": 622,
      "is": 623,
      "re": 624,
      "ct": 625,
      "im": 626,
      "en": 627,
      "un": 628,
      "as": 629,
      "an": 630,
      "em": 631,
      "ap": 632,
      "the": 633,
      "it": 634,
      "ig": 635,
      "ar": 636,
      "et": 637,
      "of": 638,
      "iv": 639,
      "ul": 640,
      "ro": 641,
      "ion": 642,
      "su": 643,
      "if": 644,
      "ed": 645,
      "to": 646,
      "eq": 647,
      "imp": 648,
      "ing": 649,
      "ly": 650,
      "ign": 651,
      "st": 652,
      "align": 653,
      "ce": 654,
      "ex": 655,
      "ab": 656,
      "mul": 657,
      "by": 658,
      "theor": 659,
      "eg": 660,
      "con": 661,
      "dd": 662,
      "simp": 663,
      "fun": 664,
      "com": 665,
      "theorem": 666,
      "de": 667,
      "ge": 668,
      "ic": 669,
      "po": 670,
      "co": 671,
      "iff": 672,
      "int": 673,
      "able": 674,
      "se": 675,
      "ot": 676,
      "es": 677,
      "map": 678,
      "set": 679,
      "lo": 680,
      "act": 681,
      "add": 682,
      "tr": 683,
      "Is": 684,
      "id": 685,
      "sub": 686,
      "ero": 687,
      "ent": 688,
      "us": 689,
      "In": 690,
      "pe": 691,
      "he": 692,
      "pro": 693,
      "fin": 694,
      "rw": 695,
      "orm": 696,
      "du": 697,
      "Su": 698,
      "comp": 699,
      "ith": 700,
      "ht": 701,
      "eas": 702,
      "mm": 703,
      "ory": 704,
      "lt": 705,
      "app": 706,
      "ive": 707,
      "ist": 708,
      "mem": 709,
      "op": 710,
      "zero": 711,
      "pa": 712,
      "ction": 713,
      "easu": 714,
      "Set": 715,
      "one": 716,
      "der": 717,
      "ight": 718,
      "ype": 719,
      "Com": 720,
      "ne": 721,
      "Fin": 722,
      "qu": 723,
      "ra": 724,
      "fl": 725,
      "ha": 726,
      "end": 727,
      "ono": 728,
      "up": 729,
      "ve": 730,
      "ft": 731,
      "apply": 732,
      "The": 733,
      "ib": 734,
      "pace": 735,
      "coe": 736,
      "ort": 737,
      "right": 738,
      "ect": 739,
      "Re": 740,
      "ation": 741,
      "am": 742,
      "rfl": 743,
      "Hom": 744,
      "ver": 745,
      "Sub": 746,
      "ut": 747,
      "Con": 748,
      "ine": 749,
      "ous": 750,
      "ial": 751,
      "tin": 752,
      "oc": 753,
      "let": 754,
      "tinu": 755,
      "and": 756,
      "exact": 757,
      "with": 758,
      "ri": 759,
      "ance": 760,
      "ateg": 761,
      "bra": 762,
      "gebra": 763,
      "tinuous": 764,
      "left": 765,
      "ategory": 766,
      "Fun": 767,
      "inear": 768,
      "ass": 769,
      "fi": 770,
      "ymm": 771,
      "cas": 772,
      "var": 773,
      "ch": 774,
      "Map": 775,
      "Un": 776,
      "roup": 777,
      "imit": 778,
      "for": 779,
      "smul": 780,
      "def": 781,
      "not": 782,
      "easure": 783,
      "ext": 784,
      "il": 785,
      "hf": 786,
      "ite": 787,
      "res": 788,
      "iable": 789,
      "el": 790,
      "neg": 791,
      "ject": 792,
      "rable": 793,
      "inst": 794,
      "age": 795,
      "onoid": 796,
      "mo": 797,
      "norm": 798,
      "symm": 799,
      "pt": 800,
      "Nat": 801,
      "non": 802,
      "Equ": 803,
      "ol": 804,
      "Add": 805,
      "mk": 806,
      "pow": 807,
      "Al": 808,
      "Mul": 809,
      "inv": 810,
      "log": 811,
      "wh": 812,
      "sup": 813,
      "iz": 814,
      "Equiv": 815,
      "equ": 816,
      "pos": 817,
      "Pro": 818,
      "Or": 819,
      "hx": 820,
      "val": 821,
      "Type": 822,
      "hom": 823,
      "ran": 824,
      "dule": 825,
      "ard": 826,
      "cc": 827,
      "have": 828,
      "only": 829,
      "ir": 830,
      "ity": 831,
      "Comp": 832,
      "all": 833,
      "variable": 834,
      "Space": 835,
      "prod": 836,
      "jective": 837,
      "fine": 838,
      "ath": 839,
      "comm": 840,
      "image": 841,
      "Theory": 842,
      "sum": 843,
      "Int": 844,
      "ctor": 845,
      "easurable": 846,
      "instance": 847,
      "nat": 848,
      "To": 849,
      "pr": 850,
      "ift": 851,
      "At": 852,
      "Comm": 853,
      "On": 854,
      "um": 855,
      "ere": 856,
      "Ring": 857,
      "ob": 858,
      "ad": 859,
      "Real": 860,
      "ral": 861,
      "ans": 862,
      "lter": 863,
      "With": 864,
      "Category": 865,
      "gr": 866,
      "lib": 867,
      "import": 868,
      "Of": 869,
      "athlib": 870,
      "Finset": 871,
      "trans": 872,
      "ate": 873,
      "art": 874,
      "pty": 875,
      "hs": 876,
      "und": 877,
      "ph": 878,
      "sing": 879,
      "continuous": 880,
      "Co": 881,
      "Linear": 882,
      "lemm": 883,
      "ain": 884,
      "pre": 885,
      "inter": 886,
      "Po": 887,
      "ens": 888,
      "Monoid": 889,
      "this": 890,
      "subset": 891,
      "intro": 892,
      "const": 893,
      "cl": 894,
      "per": 895,
      "ical": 896,
      "has": 897,
      "Algebra": 898,
      "div": 899,
      "Order": 900,
      "pl": 901,
      "ists": 902,
      "ree": 903,
      "empty": 904,
      "card": 905,
      "lemma": 906,
      "Measure": 907,
      "Mo": 908,
      "top": 909,
      "itive": 910,
      "Mathlib": 911,
      "that": 912,
      "ti": 913,
      "ma": 914,
      "cal": 915,
      "type": 916,
      "egral": 917,
      "ends": 918,
      "ur": 919,
      "equiv": 920,
      "Le": 921,
      "fr": 922,
      "algebra": 923,
      "ound": 924,
      "Iso": 925,
      "orph": 926,
      "lf": 927,
      "Fi": 928,
      "range": 929,
      "jo": 930,
      "Group": 931,
      "where": 932,
      "exists": 933,
      "List": 934,
      "clo": 935,
      "polog": 936,
      "omial": 937,
      "ru": 938,
      "cases": 939,
      "inf": 940,
      "self": 941,
      "get": 942,
      "congr": 943,
      "refine": 944,
      "ition": 945,
      "assoc": 946,
      "Continuous": 947,
      "theory": 948,
      "we": 949,
      "ck": 950,
      "succ": 951,
      "Sem": 952,
      "ant": 953,
      "supp": 954,
      "endsto": 955,
      "lift": 956,
      "measure": 957,
      "module": 958,
      "aliz": 959,
      "etr": 960,
      "pi": 961,
      "af": 962,
      "Has": 963,
      "duct": 964,
      "stri": 965,
      "Unit": 966,
      "group": 967,
      "Measurable": 968,
      "additive": 969,
      "from": 970,
      "nomial": 971,
      "lynomial": 972,
      "Non": 973,
      "ind": 974,
      "ff": 975,
      "imits": 976,
      "ds": 977,
      "erm": 978,
      "univ": 979,
      "open": 980,
      "lex": 981,
      "atri": 982,
      "leton": 983,
      "CategoryTheory": 984,
      "be": 985,
      "strict": 986,
      "ors": 987,
      "Sup": 988,
      "category": 989,
      "reser": 990,
      "order": 991,
      "ker": 992,
      "atrix": 993,
      "Cl": 994,
      "wo": 995,
      "ang": 996,
      "ies": 997,
      "sure": 998,
      "cast": 999,
      "finite": 1000,
      "reserv": 1001,
      "sed": 1002,
      "ient": 1003,
      "ame": 1004,
      "ism": 1005,
      "ure": 1006,
      "are": 1007,
      "asis": 1008,
      "ho": 1009,
      "orphism": 1010,
      "Qu": 1011,
      "section": 1012,
      "Op": 1013,
      "then": 1014,
      "singleton": 1015,
      "ime": 1016,
      "ally": 1017,
      "ence": 1018,
      "using": 1019,
      "Ex": 1020,
      "hb": 1021,
      "deal": 1022,
      "Module": 1023,
      "mono": 1024,
      "nd": 1025,
      "hy": 1026,
      "Finite": 1027,
      "Norm": 1028,
      "ring": 1029,
      "function": 1030,
      "integral": 1031,
      "Loc": 1032,
      "joint": 1033,
      "dis": 1034,
      "ke": 1035,
      "Der": 1036,
      "injective": 1037,
      "diff": 1038,
      "ag": 1039,
      "Deriv": 1040,
      "monoid": 1041,
      "ment": 1042,
      "ull": 1043,
      "deriv": 1044,
      "do": 1045,
      "hp": 1046,
      "ue": 1047,
      "Zero": 1048,
      "ated": 1049,
      "Topolog": 1050,
      "Within": 1051,
      "Top": 1052,
      "Li": 1053,
      "exp": 1054,
      "Eq": 1055,
      "Class": 1056,
      "two": 1057,
      "indu": 1058,
      "LinearMap": 1059,
      "filter": 1060,
      "Diff": 1061,
      "au": 1062,
      "Function": 1063,
      "Filter": 1064,
      "ser": 1065,
      "linear": 1066,
      "De": 1067,
      "ounded": 1068,
      "tain": 1069,
      "eval": 1070,
      "iring": 1071,
      "inal": 1072,
      "pan": 1073,
      "hg": 1074,
      "otient": 1075,
      "hds": 1076,
      "iform": 1077,
      "Th": 1078,
      "Str": 1079,
      "EN": 1080,
      "tendsto": 1081,
      "unit": 1082,
      "⁻¹": 1083,
      "nhds": 1084,
      "bi": 1085,
      "unt": 1086,
      "wer": 1087,
      "Inf": 1088,
      "dist": 1089,
      "space": 1090,
      "obj": 1091,
      "di": 1092,
      "hi": 1093,
      "An": 1094,
      "cons": 1095,
      "egree": 1096,
      "des": 1097,
      "no": 1098,
      "gen": 1099,
      "ames": 1100,
      "mp": 1101,
      "St": 1102,
      "measurable": 1103,
      "oo": 1104,
      "Clo": 1105,
      "eld": 1106,
      "heaf": 1107,
      "lement": 1108,
      "Au": 1109,
      "Pre": 1110,
      "hn": 1111,
      "Matrix": 1112,
      "closure": 1113,
      "ding": 1114,
      "ome": 1115,
      "20": 1116,
      "vd": 1117,
      "ast": 1118,
      "bot": 1119,
      "names": 1120,
      "ack": 1121,
      "intype": 1122,
      "nonneg": 1123,
      "max": 1124,
      "nel": 1125,
      "Prop": 1126,
      "NReal": 1127,
      "Ideal": 1128,
      "comap": 1129,
      "dvd": 1130,
      "ruct": 1131,
      "Submodule": 1132,
      "some": 1133,
      "product": 1134,
      "ip": 1135,
      "namespace": 1136,
      "Left": 1137,
      "alse": 1138,
      "Polynomial": 1139,
      "ancel": 1140,
      "ator": 1141,
      "Union": 1142,
      "so": 1143,
      "local": 1144,
      "verse": 1145,
      "Ar": 1146,
      "ae": 1147,
      "file": 1148,
      "AddComm": 1149,
      "ase": 1150,
      "Mult": 1151,
      "root": 1152,
      "simpa": 1153,
      "Functor": 1154,
      "dep": 1155,
      "ta": 1156,
      "ss": 1157,
      "span": 1158,
      "Part": 1159,
      "fst": 1160,
      "obtain": 1161,
      "erent": 1162,
      "Pr": 1163,
      "ary": 1164,
      "ative": 1165,
      "desc": 1166,
      "limit": 1167,
      "Right": 1168,
      "cle": 1169,
      "ometr": 1170,
      "trib": 1171,
      "par": 1172,
      "bed": 1173,
      "sert": 1174,
      "plic": 1175,
      "ers": 1176,
      "iset": 1177,
      "num": 1178,
      "note": 1179,
      "ret": 1180,
      "forall": 1181,
      "functor": 1182,
      "min": 1183,
      "restrict": 1184,
      "part": 1185,
      "ense": 1186,
      "ise": 1187,
      "Em": 1188,
      "real": 1189,
      "Complex": 1190,
      "bedding": 1191,
      "hc": 1192,
      "SMul": 1193,
      "Semiring": 1194,
      "point": 1195,
      "false": 1196,
      "ple": 1197,
      "Homo": 1198,
      "mon": 1199,
      "que": 1200,
      "MeasureTheory": 1201,
      "cid": 1202,
      "angle": 1203,
      "struct": 1204,
      "finset": 1205,
      "abs": 1206,
      "back": 1207,
      "insert": 1208,
      "induction": 1209,
      "Open": 1210,
      "ord": 1211,
      "under": 1212,
      "Dis": 1213,
      "support": 1214,
      "snd": 1215,
      "sem": 1216,
      "Col": 1217,
      "preimage": 1218,
      "ong": 1219,
      "Limits": 1220,
      "defin": 1221,
      "egrable": 1222,
      "Prod": 1223,
      "This": 1224,
      "Basis": 1225,
      "oth": 1226,
      "lic": 1227,
      "Sum": 1228,
      "cidable": 1229,
      "ique": 1230,
      "cted": 1231,
      "ivial": 1232,
      "ible": 1233,
      "can": 1234,
      "ute": 1235,
      "cond": 1236,
      "Icc": 1237,
      "ata": 1238,
      "union": 1239,
      "WithinAt": 1240,
      "ullback": 1241,
      "arg": 1242,
      "action": 1243,
      "etric": 1244,
      "ometry": 1245,
      "row": 1246,
      "Fintype": 1247,
      "If": 1248,
      "cone": 1249,
      "sin": 1250,
      "vert": 1251,
      "orting": 1252,
      "ensor": 1253,
      "list": 1254,
      "reserves": 1255,
      "Se": 1256,
      "Normed": 1257,
      "cancel": 1258,
      "closed": 1259,
      "rjective": 1260,
      "ected": 1261,
      "mod": 1262,
      "tected": 1263,
      "che": 1264,
      "protected": 1265,
      "ular": 1266,
      "actic": 1267,
      "gener": 1268,
      "Topological": 1269,
      "ide": 1270,
      "count": 1271,
      "Cat": 1272,
      "ension": 1273,
      "ange": 1274,
      "omorphism": 1275,
      "ev": 1276,
      "Quotient": 1277,
      "rintro": 1278,
      "Ch": 1279,
      "hm": 1280,
      "pec": 1281,
      "Porting": 1282,
      "coeff": 1283,
      "refl": 1284,
      "Mon": 1285,
      "out": 1286,
      "inl": 1287,
      "logy": 1288,
      "io": 1289,
      "sq": 1290,
      "trivial": 1291,
      "Lean": 1292,
      "iso": 1293,
      "fact": 1294,
      "tice": 1295,
      "ich": 1296,
      "ie": 1297,
      "Cop": 1298,
      "old": 1299,
      "element": 1300,
      "plit": 1301,
      "true": 1302,
      "erentiable": 1303,
      "form": 1304,
      "Limit": 1305,
      "opt": 1306,
      "ization": 1307,
      "ample": 1308,
      "lean": 1309,
      "rel": 1310,
      "kernel": 1311,
      "cont": 1312,
      "We": 1313,
      "upper": 1314,
      "sho": 1315,
      "Simp": 1316,
      "Integral": 1317,
      "eta": 1318,
      "Bot": 1319,
      "ption": 1320,
      "attice": 1321,
      "nonempty": 1322,
      "vex": 1323,
      "rcases": 1324,
      "comput": 1325,
      "hr": 1326,
      "ually": 1327,
      "inr": 1328,
      "lete": 1329,
      "prime": 1330,
      "single": 1331,
      "compl": 1332,
      "class": 1333,
      "simps": 1334,
      "polynomial": 1335,
      "inj": 1336,
      "hab": 1337,
      "omain": 1338,
      "Ab": 1339,
      "example": 1340,
      "For": 1341,
      "Rel": 1342,
      "Ad": 1343,
      "ult": 1344,
      "cy": 1345,
      "option": 1346,
      "Pi": 1347,
      "structure": 1348,
      "rank": 1349,
      "rec": 1350,
      "ENNReal": 1351,
      "disjoint": 1352,
      "case": 1353,
      "onal": 1354,
      "aph": 1355,
      "uniform": 1356,
      "Cast": 1357,
      "ty": 1358,
      "algebraMap": 1359,
      "Decidable": 1360,
      "Nonempty": 1361,
      "eries": 1362,
      "Like": 1363,
      "ore": 1364,
      "star": 1365,
      "Closed": 1366,
      "Fr": 1367,
      "Id": 1368,
      "use": 1369,
      "All": 1370,
      "Compact": 1371,
      "tra": 1372,
      "mpr": 1373,
      "Finsupp": 1374,
      "Multiset": 1375,
      "calar": 1376,
      "basis": 1377,
      "ize": 1378,
      "RingHom": 1379,
      "len": 1380,
      "index": 1381,
      "alence": 1382,
      "Field": 1383,
      "topolog": 1384,
      "asic": 1385,
      "igma": 1386,
      "One": 1387,
      "TopologicalSpace": 1388,
      "subtype": 1389,
      "ian": 1390,
      "join": 1391,
      "ased": 1392,
      "atTop": 1393,
      "dsimp": 1394,
      "Inter": 1395,
      "toFun": 1396,
      "which": 1397,
      "ner": 1398,
      "Mono": 1399,
      "sion": 1400,
      "Data": 1401,
      "computable": 1402,
      "Degree": 1403,
      "Subtype": 1404,
      "ys": 1405,
      "gth": 1406,
      "entually": 1407,
      "low": 1408,
      "DerivAt": 1409,
      "bit": 1410,
      "limits": 1411,
      "Subgroup": 1412,
      "Product": 1413,
      "descr": 1414,
      "Tendsto": 1415,
      "dic": 1416,
      "equal": 1417,
      "alization": 1418,
      "reserved": 1419,
      "any": 1420,
      "Cont": 1421,
      "Topology": 1422,
      "sh": 1423,
      "describ": 1424,
      "pect": 1425,
      "gc": 1426,
      "term": 1427,
      "Ico": 1428,
      "ual": 1429,
      "str": 1430,
      "vari": 1431,
      "Uniform": 1432,
      "Copy": 1433,
      "Sh": 1434,
      "duc": 1435,
      "length": 1436,
      "Alg": 1437,
      "Bo": 1438,
      "noncomputable": 1439,
      "urn": 1440,
      "ilinear": 1441,
      "202": 1442,
      "Bounded": 1443,
      "MonoidHom": 1444,
      "LI": 1445,
      "AddCommGroup": 1446,
      "iven": 1447,
      "Action": 1448,
      "described": 1449,
      "tiplic": 1450,
      "show": 1451,
      "homo": 1452,
      "Lift": 1453,
      "degree": 1454,
      "otone": 1455,
      "ih": 1456,
      "ces": 1457,
      "thors": 1458,
      "nected": 1459,
      "ural": 1460,
      "SE": 1461,
      "fa": 1462,
      "Series": 1463,
      "Embedding": 1464,
      "rans": 1465,
      "Rele": 1466,
      "oal": 1467,
      "Authors": 1468,
      "LIC": 1469,
      "license": 1470,
      "Copyright": 1471,
      "Apa": 1472,
      "Trans": 1473,
      "ball": 1474,
      "rights": 1475,
      "ENSE": 1476,
      "Released": 1477,
      "LICENSE": 1478,
      "Apache": 1479,
      "ates": 1480,
      "ily": 1481,
      "ber": 1482,
      "infer": 1483,
      "lim": 1484,
      "onent": 1485,
      "dual": 1486,
      "natural": 1487,
      "ry": 1488,
      "Ord": 1489,
      "surjective": 1490,
      "Colimit": 1491,
      "nil": 1492,
      "ou": 1493,
      "hain": 1494,
      "Ordered": 1495,
      "its": 1496,
      "elim": 1497,
      "omorph": 1498,
      "Lie": 1499,
      "Aux": 1500,
      "split": 1501,
      "linter": 1502,
      "ax": 1503,
      "pullback": 1504,
      "IsS": 1505,
      "iUnion": 1506,
      "iter": 1507,
      "iSup": 1508,
      "abil": 1509,
      "wise": 1510,
      "over": 1511,
      "wap": 1512,
      "Div": 1513,
      "Localization": 1514,
      "CommRing": 1515,
      "Num": 1516,
      "depend": 1517,
      "bet": 1518,
      "object": 1519,
      "forget": 1520,
      "spec": 1521,
      "10": 1522,
      "ell": 1523,
      "bounded": 1524,
      "position": 1525,
      "fix": 1526,
      "pres": 1527,
      "Unital": 1528,
      "No": 1529,
      "Ioc": 1530,
      "sets": 1531,
      "Submonoid": 1532,
      "sy": 1533,
      "swap": 1534,
      "Dual": 1535,
      "rat": 1536,
      "Mod": 1537,
      "ict": 1538,
      "compact": 1539,
      "ced": 1540,
      "rpow": 1541,
      "ween": 1542,
      "ations": 1543,
      "attr": 1544,
      "imal": 1545,
      "quotient": 1546,
      "conj": 1547,
      "mult": 1548,
      "oi": 1549,
      "amily": 1550,
      "eventually": 1551,
      "Injective": 1552,
      "Option": 1553,
      "ps": 1554,
      "Strict": 1555,
      "between": 1556,
      "fold": 1557,
      "hu": 1558,
      "constru": 1559,
      "variant": 1560,
      "ful": 1561,
      "Expr": 1562,
      "alizer": 1563,
      "Prime": 1564,
      "Metric": 1565,
      "esop": 1566,
      "field": 1567,
      "matrix": 1568,
      "morphism": 1569,
      "Pa": 1570,
      "affine": 1571,
      "Tensor": 1572,
      "else": 1573,
      "definition": 1574,
      "mathlib": 1575,
      "return": 1576,
      "Di": 1577,
      "Seq": 1578,
      "ofReal": 1579,
      "bin": 1580,
      "cur": 1581,
      "tot": 1582,
      "prover": 1583,
      "leanprover": 1584,
      "Gr": 1585,
      "aux": 1586,
      "vector": 1587,
      "Ob": 1588,
      "gcd": 1589,
      "NonUnital": 1590,
      "dependent": 1591,
      "alk": 1592,
      "unique": 1593,
      "inner": 1594,
      "unop": 1595,
      "ay": 1596,
      "Integrable": 1597,
      "ability": 1598,
      "atch": 1599,
      "Free": 1600,
      "Ass": 1601,
      "Val": 1602,
      "Rat": 1603,
      "itt": 1604,
      "Sy": 1605,
      "diag": 1606,
      "Lp": 1607,
      "unity": 1608,
      "choo": 1609,
      "Ext": 1610,
      "inc": 1611,
      "Ioo": 1612,
      "Form": 1613,
      "Locally": 1614,
      "choose": 1615,
      "pure": 1616,
      "same": 1617,
      "Simple": 1618,
      "Var": 1619,
      "Partial": 1620,
      "Fact": 1621,
      "det": 1622,
      "erase": 1623,
      "equivalence": 1624,
      "cret": 1625,
      "nn": 1626,
      "hl": 1627,
      "cop": 1628,
      "Cone": 1629,
      "Coe": 1630,
      "ongly": 1631,
      "crete": 1632,
      "Tactic": 1633,
      "Mv": 1634,
      "lower": 1635,
      "reduc": 1636,
      "sSup": 1637,
      "Inst": 1638,
      "₁₂": 1639,
      "proj": 1640,
      "fle": 1641,
      "Pres": 1642,
      "preserves": 1643,
      "Assoc": 1644,
      "Af": 1645,
      "Point": 1646,
      "none": 1647,
      "mooth": 1648,
      "inorm": 1649,
      "version": 1650,
      "Ne": 1651,
      "graph": 1652,
      "rwa": 1653,
      "complex": 1654,
      "Affine": 1655,
      "adj": 1656,
      "LE": 1657,
      "ideal": 1658,
      "Closure": 1659,
      "integrable": 1660,
      "prop": 1661,
      "MeasurableSet": 1662,
      "factor": 1663,
      "proper": 1664,
      "bound": 1665,
      "differentiable": 1666,
      "Inv": 1667,
      "Lean3": 1668,
      "colimit": 1669,
      "Gen": 1670,
      "Star": 1671,
      "convert": 1672,
      "Ha": 1673,
      "such": 1674,
      "Not": 1675,
      "cos": 1676,
      "sInf": 1677,
      "community": 1678,
      "natCast": 1679,
      "uppercase": 1680,
      "multiplic": 1681,
      "Const": 1682,
      "uppercaseLean3": 1683,
      "hd": 1684,
      "Basic": 1685,
      "tho": 1686,
      "eomorph": 1687,
      "hz": 1688,
      "also": 1689,
      "goal": 1690,
      "rev": 1691,
      "Ro": 1692,
      "fderiv": 1693,
      "constructor": 1694,
      "Ioi": 1695,
      "ape": 1696,
      "convex": 1697,
      "natDegree": 1698,
      "ection": 1699,
      "dire": 1700,
      "iInf": 1701,
      "Pos": 1702,
      "ach": 1703,
      "commut": 1704,
      "functions": 1705,
      "By": 1706,
      "separ": 1707,
      "reducible": 1708,
      "char": 1709,
      "Complete": 1710,
      "Instance": 1711,
      "inverse": 1712,
      "append": 1713,
      "Preserves": 1714,
      "Domain": 1715,
      "pair": 1716,
      "Ball": 1717,
      "pus": 1718,
      "zpow": 1719,
      "Homology": 1720,
      "Char": 1721,
      "igroup": 1722,
      "NNReal": 1723,
      "aesop": 1724,
      "cent": 1725,
      "ᵒᵖ": 1726,
      "Iic": 1727,
      "ove": 1728,
      "indic": 1729,
      "DecidableEq": 1730,
      "change": 1731,
      "maps": 1732,
      "hk": 1733,
      "Count": 1734,
      "base": 1735,
      "imension": 1736,
      "Lattice": 1737,
      "Sheaf": 1738,
      "ram": 1739,
      "match": 1740,
      "lintegral": 1741,
      "xs": 1742,
      "tactic": 1743,
      "extend": 1744,
      "ior": 1745,
      "Bi": 1746,
      "Name": 1747,
      "onglyMeasurable": 1748,
      "isymm": 1749,
      "ali": 1750,
      "pose": 1751,
      "h2": 1752,
      "Subalgebra": 1753,
      "subgroup": 1754,
      "fir": 1755,
      "h1": 1756,
      "Perm": 1757,
      "ci": 1758,
      "perm": 1759,
      "first": 1760,
      "MulAction": 1761,
      "indicator": 1762,
      "bind": 1763,
      "Ker": 1764,
      "Ap": 1765,
      "ray": 1766,
      "prove": 1767,
      "poly": 1768,
      "Card": 1769,
      "bo": 1770,
      "olut": 1771,
      "AddGroup": 1772,
      "ren": 1773,
      "embedding": 1774,
      "uation": 1775,
      "Fraction": 1776,
      "monotone": 1777,
      "ep": 1778,
      "when": 1779,
      "but": 1780,
      "Bool": 1781,
      "simple": 1782,
      "connected": 1783,
      "AlgHom": 1784,
      "calc": 1785,
      "MeasurableSpace": 1786,
      "adjoin": 1787,
      "find": 1788,
      "cau": 1789,
      "proof": 1790,
      "Ici": 1791,
      "power": 1792,
      "ill": 1793,
      "hv": 1794,
      "LinearEquiv": 1795,
      "free": 1796,
      "entr": 1797,
      "finrank": 1798,
      "associ": 1799,
      "AddCommMonoid": 1800,
      "very": 1801,
      "Differentiable": 1802,
      "isker": 1803,
      "ded": 1804,
      "AE": 1805,
      "Max": 1806,
      "toReal": 1807,
      "Root": 1808,
      "size": 1809,
      "incl": 1810,
      "Divis": 1811,
      "undle": 1812,
      "urce": 1813,
      "cycle": 1814,
      "ify": 1815,
      "li": 1816,
      "submodule": 1817,
      "antisymm": 1818,
      "ward": 1819,
      "itz": 1820,
      "arget": 1821,
      "tensor": 1822,
      "result": 1823,
      "tribute": 1824,
      "isOpen": 1825,
      "MvPolynomial": 1826,
      "itial": 1827,
      "est": 1828,
      "irw": 1829,
      "ork": 1830,
      "del": 1831,
      "irwise": 1832,
      "used": 1833,
      "ector": 1834,
      "See": 1835,
      "Unique": 1836,
      "there": 1837,
      "ther": 1838,
      "sigma": 1839,
      "Ordinal": 1840,
      "ac": 1841,
      "gt": 1842,
      "semiring": 1843,
      "alias": 1844,
      "lin": 1845,
      "uld": 1846,
      "Term": 1847,
      "cf": 1848,
      "incip": 1849,
      "Up": 1850,
      "nth": 1851,
      "edSpace": 1852,
      "topological": 1853,
      "Empty": 1854,
      "uage": 1855,
      "anguage": 1856,
      "Arrow": 1857,
      "Kernel": 1858,
      "suf": 1859,
      "Convex": 1860,
      "date": 1861,
      "cated": 1862,
      "ter": 1863,
      "closedBall": 1864,
      "alized": 1865,
      "hq": 1866,
      "distrib": 1867,
      "rum": 1868,
      "pectrum": 1869,
      "rt": 1870,
      "mall": 1871,
      "seq": 1872,
      "reverse": 1873,
      "countable": 1874,
      "Cy": 1875,
      "domain": 1876,
      "given": 1877,
      "update": 1878,
      "den": 1879,
      "IsOpen": 1880,
      "pred": 1881,
      "Ant": 1882,
      "rop": 1883,
      "Algebraic": 1884,
      "isomorphism": 1885,
      "decl": 1886,
      "lie": 1887,
      "Congr": 1888,
      "Vector": 1889,
      "Cof": 1890,
      "hj": 1891,
      "Disjoint": 1892,
      "topology": 1893,
      "Quot": 1894,
      "ess": 1895,
      "prov": 1896,
      "flect": 1897,
      "ace": 1898,
      "family": 1899,
      "Pullback": 1900,
      "edist": 1901,
      "attribute": 1902,
      "source": 1903,
      "ited": 1904,
      "ents": 1905,
      "mmable": 1906,
      "since": 1907,
      "induced": 1908,
      "interval": 1909,
      "vadd": 1910,
      "Multilinear": 1911,
      "ident": 1912,
      "posite": 1913,
      "port": 1914,
      "assum": 1915,
      "imensional": 1916,
      "hout": 1917,
      "Presheaf": 1918,
      "bability": 1919,
      "ofNat": 1920,
      "composition": 1921,
      "Sigma": 1922,
      "topy": 1923,
      "elements": 1924,
      "cover": 1925,
      "WithZero": 1926,
      "Semi": 1927,
      "Meta": 1928,
      "nsmul": 1929,
      "Bin": 1930,
      "Seminorm": 1931,
      "alize": 1932,
      "ust": 1933,
      "Fn": 1934,
      "Distrib": 1935,
      "pes": 1936,
      "FunLike": 1937,
      "homology": 1938,
      "sdiff": 1939,
      "rier": 1940,
      "curry": 1941,
      "multiset": 1942,
      "uct": 1943,
      "FDerivAt": 1944,
      "fices": 1945,
      "whisker": 1946,
      "Im": 1947,
      "ak": 1948,
      "rou": 1949,
      "ensity": 1950,
      "hxy": 1951,
      "habited": 1952,
      "oangle": 1953,
      "Pair": 1954,
      "Scalar": 1955,
      "interior": 1956,
      "sqrt": 1957,
      "center": 1958,
      "tsum": 1959,
      "col": 1960,
      "Struct": 1961,
      "conv": 1962,
      "cess": 1963,
      "FDeriv": 1964,
      "suffices": 1965,
      "derivative": 1966,
      "shift": 1967,
      "Cardinal": 1968,
      "AddMonoid": 1969,
      "lock": 1970,
      "inferInstance": 1971,
      "target": 1972,
      "Array": 1973,
      "finsupp": 1974,
      "Tower": 1975,
      "contain": 1976,
      "Tr": 1977,
      "Succ": 1978,
      "haveI": 1979,
      "ting": 1980,
      "ircle": 1981,
      "cor": 1982,
      "CommSemiring": 1983,
      "edi": 1984,
      "value": 1985,
      "incipal": 1986,
      "Reg": 1987,
      "partial": 1988,
      "total": 1989,
      "otom": 1990,
      "Units": 1991,
      "Shape": 1992,
      "equence": 1993,
      "Obj": 1994,
      "ale": 1995,
      "naturality": 1996,
      "chitz": 1997,
      "Coeff": 1998,
      "quot": 1999,
      "Classical": 2000,
      "Iio": 2001,
      "itone": 2002,
      "erse": 2003,
      "Abs": 2004,
      "Given": 2005,
      "other": 2006,
      "Separ": 2007,
      "condition": 2008,
      "OD": 2009,
      "every": 2010,
      "pot": 2011,
      "into": 2012,
      "Preorder": 2013,
      "universe": 2014,
      "sign": 2015,
      "Regular": 2016,
      "complete": 2017,
      "reg": 2018,
      "series": 2019,
      "alg": 2020,
      "elian": 2021,
      "precated": 2022,
      "thog": 2023,
      "ream": 2024,
      "need": 2025,
      "Homeomorph": 2026,
      "olution": 2027,
      "thogonal": 2028,
      "Lo": 2029,
      "ContinuousLinearMap": 2030,
      "Independent": 2031,
      "Main": 2032,
      "Span": 2033,
      "head": 2034,
      "19": 2035,
      "Power": 2036,
      "MDiff": 2037,
      "aeval": 2038,
      "Note": 2039,
      "within": 2040,
      "tail": 2041,
      "chy": 2042,
      "smooth": 2043,
      "ann": 2044,
      "As": 2045,
      "Iff": 2046,
      "points": 2047,
      "ContDiff": 2048,
      "fintype": 2049,
      "Subsingleton": 2050,
      "locally": 2051,
      "units": 2052,
      "pri": 2053,
      "erw": 2054,
      "subsingleton": 2055,
      "Cocone": 2056,
      "nhdsWithin": 2057,
      "Graph": 2058,
      "deprecated": 2059,
      "Func": 2060,
      "homomorphism": 2061,
      "node": 2062,
      "Sort": 2063,
      "Anal": 2064,
      "Ge": 2065,
      "Local": 2066,
      "ZMod": 2067,
      "isClosed": 2068,
      "coped": 2069,
      "ivity": 2070,
      "repl": 2071,
      "gu": 2072,
      "tsub": 2073,
      "2024": 2074,
      "Spec": 2075,
      "Big": 2076,
      "AddMonoidHom": 2077,
      "NormedSpace": 2078,
      "name": 2079,
      "scoped": 2080,
      "iterate": 2081,
      "En": 2082,
      "epi": 2083,
      "Surjective": 2084,
      "hS": 2085,
      "sheaf": 2086,
      "Mem": 2087,
      "Path": 2088,
      "BigO": 2089,
      "arith": 2090,
      "partition": 2091,
      "equalizer": 2092,
      "arrow": 2093,
      "notation": 2094,
      "vsub": 2095,
      "Component": 2096,
      "dec": 2097,
      "Epi": 2098,
      "hI": 2099,
      "prior": 2100,
      "fig": 2101,
      "Geometry": 2102,
      "usion": 2103,
      "hP": 2104,
      "Range": 2105,
      "defined": 2106,
      "infinite": 2107,
      "Lin": 2108,
      "snorm": 2109,
      "wn": 2110,
      "Countable": 2111,
      "alent": 2112,
      "Isometry": 2113,
      "End": 2114,
      "ose": 2115,
      "reassoc": 2116,
      "rect": 2117,
      "ysis": 2118,
      "Restrict": 2119,
      "push": 2120,
      "line": 2121,
      "Arg": 2122,
      "Sch": 2123,
      "tri": 2124,
      "trace": 2125,
      "seu": 2126,
      "Adj": 2127,
      "zsmul": 2128,
      "each": 2129,
      "priority": 2130,
      "Adjoint": 2131,
      "toFinset": 2132,
      "Gener": 2133,
      "hU": 2134,
      "Indep": 2135,
      "nnnorm": 2136,
      "ror": 2137,
      "ick": 2138,
      "ieve": 2139,
      "Par": 2140,
      "requ": 2141,
      "vol": 2142,
      "invFun": 2143,
      "chain": 2144,
      "repr": 2145,
      "does": 2146,
      "number": 2147,
      "CommMonoid": 2148,
      "isUnit": 2149,
      "dup": 2150,
      "Walk": 2151,
      "basic": 2152,
      "MVar": 2153,
      "From": 2154,
      "IsLimit": 2155,
      "Above": 2156,
      "Nontrivial": 2157,
      "localization": 2158,
      "av": 2159,
      "factors": 2160,
      "Ev": 2161,
      "Sing": 2162,
      "weight": 2163,
      "constant": 2164,
      "alo": 2165,
      "ison": 2166,
      "oned": 2167,
      "Min": 2168,
      "Res": 2169,
      "App": 2170,
      "algebraic": 2171,
      "atis": 2172,
      "Cover": 2173,
      "Binary": 2174,
      "Monotone": 2175,
      "guard": 2176,
      "normal": 2177,
      "lemmas": 2178,
      "unction": 2179,
      "calarTower": 2180,
      "IsScalarTower": 2181,
      "Connected": 2182,
      "Cancel": 2183,
      "ega": 2184,
      "semigroup": 2185,
      "ucl": 2186,
      "SimpleGraph": 2187,
      "new": 2188,
      "continuousOn": 2189,
      "TensorProduct": 2190,
      "define": 2191,
      "hw": 2192,
      "idean": 2193,
      "uclidean": 2194,
      "brev": 2195,
      "continuousAt": 2196,
      "red": 2197,
      "oneda": 2198,
      "ish": 2199,
      "ault": 2200,
      "Inhabited": 2201,
      "Colimits": 2202,
      "clotom": 2203,
      "clotomic": 2204,
      "Ru": 2205,
      "eous": 2206,
      "data": 2207,
      "quare": 2208,
      "Monoidal": 2209,
      "default": 2210,
      "Bound": 2211,
      "IsIso": 2212,
      "monomial": 2213,
      "adrat": 2214,
      "adratic": 2215,
      "conver": 2216,
      "biUnion": 2217,
      "100": 2218,
      "property": 2219,
      "prox": 2220,
      "than": 2221,
      "od": 2222,
      "orthogonal": 2223,
      "oid": 2224,
      "entation": 2225,
      "letion": 2226,
      "Opens": 2227,
      "extension": 2228,
      "measurableSet": 2229,
      "cat": 2230,
      "cardinal": 2231,
      "Cau": 2232,
      "ics": 2233,
      "even": 2234,
      "Er": 2235,
      "code": 2236,
      "separable": 2237,
      "edge": 2238,
      "Structure": 2239,
      "generate": 2240,
      "these": 2241,
      "funext": 2242,
      "Equivalence": 2243,
      "17": 2244,
      "agonal": 2245,
      "MultilinearMap": 2246,
      "Density": 2247,
      "acter": 2248,
      "gh": 2249,
      "principal": 2250,
      "toList": 2251,
      "normed": 2252,
      "seudo": 2253,
      "abbrev": 2254,
      "iber": 2255,
      "me": 2256,
      "Jo": 2257,
      "irreducible": 2258,
      "see": 2259,
      "oper": 2260,
      "diagonal": 2261,
      "contr": 2262,
      "SetLike": 2263,
      "setOf": 2264,
      "∫⁻": 2265,
      "cof": 2266,
      "cod": 2267,
      "geneous": 2268,
      "Rule": 2269,
      "alois": 2270,
      "submonoid": 2271,
      "replace": 2272,
      "ating": 2273,
      "ordered": 2274,
      "spaces": 2275,
      "StronglyMeasurable": 2276,
      "Divisors": 2277,
      "Tri": 2278,
      "Image": 2279,
      "well": 2280,
      "Morphism": 2281,
      "He": 2282,
      "ume": 2283,
      "logical": 2284,
      "Inverse": 2285,
      "itivity": 2286,
      "enn": 2287,
      "IsColimit": 2288,
      "move": 2289,
      "ContinuousMap": 2290,
      "Subring": 2291,
      "volume": 2292,
      "wr": 2293,
      "IH": 2294,
      "Game": 2295,
      "Mk": 2296,
      "products": 2297,
      "bdd": 2298,
      "flip": 2299,
      "Lex": 2300,
      "sequence": 2301,
      "Extension": 2302,
      "ᵒᵈ": 2303,
      "Pow": 2304,
      "omega": 2305,
      "Dimensional": 2306,
      "fol": 2307,
      "last": 2308,
      "asi": 2309,
      "→₀": 2310,
      "ediate": 2311,
      "bundle": 2312,
      "cause": 2313,
      "raded": 2314,
      "potent": 2315,
      "continu": 2316,
      "alle": 2317,
      "Homotopy": 2318,
      "Cycle": 2319,
      "18": 2320,
      "nontrivial": 2321,
      "vertible": 2322,
      "Prim": 2323,
      "ater": 2324,
      "Fir": 2325,
      "Pus": 2326,
      "ms": 2327,
      "poid": 2328,
      "ub": 2329,
      "Discrete": 2330,
      "roupoid": 2331,
      "drop": 2332,
      "satis": 2333,
      "fixed": 2334,
      "cocone": 2335,
      "argum": 2336,
      "lattice": 2337,
      "Support": 2338,
      "First": 2339,
      "Sym": 2340,
      "dom": 2341,
      "rule": 2342,
      "ithful": 2343,
      "path": 2344,
      "initial": 2345,
      "nta": 2346,
      "ntax": 2347,
      "hfg": 2348,
      "flects": 2349,
      "Analysis": 2350,
      "tw": 2351,
      "TOD": 2352,
      "Additive": 2353,
      "commutative": 2354,
      "TODO": 2355,
      "triangle": 2356,
      "cmp": 2357,
      "expres": 2358,
      "Normal": 2359,
      "presheaf": 2360,
      "Proper": 2361,
      "valu": 2362,
      "Core": 2363,
      "LT": 2364,
      "fer": 2365,
      "contDiff": 2366,
      "State": 2367,
      "special": 2368,
      "Family": 2369,
      "hT": 2370,
      "inclusion": 2371,
      "AddSubgroup": 2372,
      "maximal": 2373,
      "dense": 2374,
      "roots": 2375,
      "elab": 2376,
      "hij": 2377,
      "rot": 2378,
      "TopCat": 2379,
      "aw": 2380,
      "bers": 2381,
      "Pred": 2382,
      "take": 2383,
      "It": 2384,
      "UniformSpace": 2385,
      "fg": 2386,
      "Opposite": 2387,
      "iterated": 2388,
      "Cond": 2389,
      "respect": 2390,
      "summable": 2391,
      "nonpos": 2392,
      "ModuleCat": 2393,
      "Factor": 2394,
      "Scalars": 2395,
      "L1": 2396,
      "Neg": 2397,
      "phere": 2398,
      "ca": 2399,
      "run": 2400,
      "vi": 2401,
      "lead": 2402,
      "decidable": 2403,
      "Ga": 2404,
      "Probability": 2405,
      "check": 2406,
      "NormedAddCommGroup": 2407,
      "config": 2408,
      "LinearOrdered": 2409,
      "was": 2410,
      "WithTop": 2411,
      "Object": 2412,
      "IsUnit": 2413,
      "eme": 2414,
      "adjoint": 2415,
      "will": 2416,
      "Dist": 2417,
      "MetricSpace": 2418,
      "cm": 2419,
      "Be": 2420,
      "deg": 2421,
      "equivalent": 2422,
      "Per": 2423,
      "assumption": 2424,
      "Language": 2425,
      "small": 2426,
      "relation": 2427,
      "resp": 2428,
      "String": 2429,
      "plicit": 2430,
      "led": 2431,
      "Grp": 2432,
      "h0": 2433,
      "lhs": 2434,
      "Proj": 2435,
      "lab": 2436,
      "Bor": 2437,
      "car": 2438,
