{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PROOFSTATE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[PROOFSTEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[TACTICS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "[STATESEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "[SUC]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "[INC]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10,
      "content": "[INV]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[EOS]": 2,
      "[PROOFSTATE]": 3,
      "[PROOFSTEP]": 4,
      "[TACTICS]": 5,
      "[SEP]": 6,
      "[STATESEP]": 7,
      "[SUC]": 8,
      "[INC]": 9,
      "[INV]": 10,
      "!": 11,
      "\"": 12,
      "#": 13,
      "$": 14,
      "%": 15,
      "&": 16,
      "'": 17,
      "(": 18,
      ")": 19,
      "*": 20,
      "+": 21,
      ",": 22,
      "-": 23,
      ".": 24,
      "/": 25,
      "0": 26,
      "1": 27,
      "2": 28,
      "3": 29,
      "4": 30,
      "5": 31,
      "6": 32,
      "7": 33,
      "8": 34,
      "9": 35,
      ":": 36,
      ";": 37,
      "<": 38,
      "=": 39,
      ">": 40,
      "?": 41,
      "@": 42,
      "A": 43,
      "B": 44,
      "C": 45,
      "D": 46,
      "E": 47,
      "F": 48,
      "G": 49,
      "H": 50,
      "I": 51,
      "J": 52,
      "K": 53,
      "L": 54,
      "M": 55,
      "N": 56,
      "O": 57,
      "P": 58,
      "Q": 59,
      "R": 60,
      "S": 61,
      "T": 62,
      "U": 63,
      "V": 64,
      "W": 65,
      "X": 66,
      "Y": 67,
      "Z": 68,
      "[": 69,
      "\\": 70,
      "]": 71,
      "^": 72,
      "_": 73,
      "a": 74,
      "b": 75,
      "c": 76,
      "d": 77,
      "e": 78,
      "f": 79,
      "g": 80,
      "h": 81,
      "i": 82,
      "j": 83,
      "k": 84,
      "l": 85,
      "m": 86,
      "n": 87,
      "o": 88,
      "p": 89,
      "q": 90,
      "r": 91,
      "s": 92,
      "t": 93,
      "u": 94,
      "v": 95,
      "w": 96,
      "x": 97,
      "y": 98,
      "z": 99,
      "{": 100,
      "|": 101,
      "}": 102,
      "~": 103,
      "«": 104,
      "¬": 105,
      "²": 106,
      "³": 107,
      "¹": 108,
      "»": 109,
      "×": 110,
      "ʷ": 111,
      "ʸ": 112,
      "ˢ": 113,
      "ˣ": 114,
      "̂": 115,
      "Γ": 116,
      "Δ": 117,
      "Θ": 118,
      "Ι": 119,
      "Λ": 120,
      "Π": 121,
      "Σ": 122,
      "Φ": 123,
      "Ψ": 124,
      "Ω": 125,
      "α": 126,
      "β": 127,
      "γ": 128,
      "δ": 129,
      "ε": 130,
      "ζ": 131,
      "η": 132,
      "θ": 133,
      "ι": 134,
      "κ": 135,
      "λ": 136,
      "μ": 137,
      "ν": 138,
      "ξ": 139,
      "π": 140,
      "ρ": 141,
      "σ": 142,
      "τ": 143,
      "υ": 144,
      "φ": 145,
      "χ": 146,
      "ψ": 147,
      "ω": 148,
      "ϕ": 149,
      "ϖ": 150,
      "ᗮ": 151,
      "ᘁ": 152,
      "ᴬ": 153,
      "ᴴ": 154,
      "ᴸ": 155,
      "ᵀ": 156,
      "ᵁ": 157,
      "ᵃ": 158,
      "ᵇ": 159,
      "ᵈ": 160,
      "ᵍ": 161,
      "ᵐ": 162,
      "ᵒ": 163,
      "ᵖ": 164,
      "ᵛ": 165,
      "ᵢ": 166,
      "ᵣ": 167,
      "ᵤ": 168,
      "ᵥ": 169,
      "ᶜ": 170,
      "ᶠ": 171,
      "‖": 172,
      "†": 173,
      "•": 174,
      "′": 175,
      "‹": 176,
      "›": 177,
      "‼": 178,
      "⁄": 179,
      "⁅": 180,
      "⁆": 181,
      "⁰": 182,
      "ⁱ": 183,
      "⁴": 184,
      "⁵": 185,
      "⁶": 186,
      "⁷": 187,
      "⁸": 188,
      "⁹": 189,
      "⁺": 190,
      "⁻": 191,
      "₀": 192,
      "₁": 193,
      "₂": 194,
      "₃": 195,
      "₄": 196,
      "₅": 197,
      "₆": 198,
      "₇": 199,
      "₈": 200,
      "₊": 201,
      "ₐ": 202,
      "ₑ": 203,
      "ₒ": 204,
      "ₕ": 205,
      "ₖ": 206,
      "ₗ": 207,
      "ₘ": 208,
      "ₙ": 209,
      "ₚ": 210,
      "ₛ": 211,
      "ₜ": 212,
      "ℂ": 213,
      "ℍ": 214,
      "ℐ": 215,
      "ℑ": 216,
      "ℒ": 217,
      "ℓ": 218,
      "ℕ": 219,
      "ℙ": 220,
      "ℚ": 221,
      "ℜ": 222,
      "ℝ": 223,
      "ℤ": 224,
      "ℬ": 225,
      "ℰ": 226,
      "ℱ": 227,
      "ℳ": 228,
      "ℵ": 229,
      "⅟": 230,
      "←": 231,
      "↑": 232,
      "→": 233,
      "↓": 234,
      "↔": 235,
      "↗": 236,
      "↥": 237,
      "↦": 238,
      "↪": 239,
      "↾": 240,
      "↿": 241,
      "⇑": 242,
      "⇒": 243,
      "⇔": 244,
      "⇨": 245,
      "∀": 246,
      "∂": 247,
      "∃": 248,
      "∅": 249,
      "∆": 250,
      "∇": 251,
      "∈": 252,
      "∉": 253,
      "∏": 254,
      "∐": 255,
      "∑": 256,
      "∗": 257,
      "∘": 258,
      "∙": 259,
      "√": 260,
      "∞": 261,
      "∠": 262,
      "∡": 263,
      "∣": 264,
      "∥": 265,
      "∧": 266,
      "∨": 267,
      "∩": 268,
      "∪": 269,
      "∫": 270,
      "∮": 271,
      "∯": 272,
      "∼": 273,
      "≃": 274,
      "≅": 275,
      "≈": 276,
      "≌": 277,
      "≠": 278,
      "≡": 279,
      "≤": 280,
      "≥": 281,
      "≪": 282,
      "≫": 283,
      "≺": 284,
      "≼": 285,
      "⊂": 286,
      "⊆": 287,
      "⊇": 288,
      "⊓": 289,
      "⊔": 290,
      "⊕": 291,
      "⊗": 292,
      "⊙": 293,
      "⊚": 294,
      "⊞": 295,
      "⊢": 296,
      "⊣": 297,
      "⊤": 298,
      "⊥": 299,
      "⊨": 300,
      "⊻": 301,
      "⊼": 302,
      "⋀": 303,
      "⋂": 304,
      "⋃": 305,
      "⋆": 306,
      "⋈": 307,
      "⋊": 308,
      "⋖": 309,
      "⋙": 310,
      "⋯": 311,
      "⌈": 312,
      "⌉": 313,
      "⌊": 314,
      "⌋": 315,
      "⍟": 316,
      "□": 317,
      "▷": 318,
      "▸": 319,
      "◁": 320,
      "◃": 321,
      "○": 322,
      "◫": 323,
      "♯": 324,
      "✝": 325,
      "✶": 326,
      "⟂": 327,
      "⟦": 328,
      "⟧": 329,
      "⟨": 330,
      "⟩": 331,
      "⟪": 332,
      "⟫": 333,
      "⟮": 334,
      "⟯": 335,
      "⟶": 336,
      "⟹": 337,
      "⤳": 338,
      "⥤": 339,
      "⦃": 340,
      "⦄": 341,
      "⧏": 342,
      "⧸": 343,
      "⨁": 344,
      "⨂": 345,
      "⨅": 346,
      "⨆": 347,
      "⨍": 348,
      "⨯": 349,
      "⨳": 350,
      "⨿": 351,
      "⩿": 352,
      "⬝": 353,
      "￢": 354,
      "𝐞": 355,
      "𝒄": 356,
      "𝒜": 357,
      "𝒞": 358,
      "𝒟": 359,
      "𝒢": 360,
      "𝒫": 361,
      "𝒮": 362,
      "𝒯": 363,
      "𝒰": 364,
      "𝒳": 365,
      "𝒴": 366,
      "𝓒": 367,
      "𝓓": 368,
      "𝓕": 369,
      "𝓘": 370,
      "𝓚": 371,
      "𝓜": 372,
      "𝓝": 373,
      "𝓞": 374,
      "𝓟": 375,
      "𝓢": 376,
      "𝓤": 377,
      "𝔖": 378,
      "𝔠": 379,
      "𝔸": 380,
      "𝔹": 381,
      "𝔻": 382,
      "𝕀": 383,
      "𝕂": 384,
      "𝕊": 385,
      "𝕌": 386,
      "𝕎": 387,
      "𝕜": 388,
      "𝕝": 389,
      "𝖣": 390,
      "𝟙": 391,
      "𝟭": 392,
      "in": 393,
      "pe": 394,
      "ype": 395,
      "st": 396,
      "Type": 397,
      "inst": 398,
      "inst✝": 399,
      "u_": 400,
      "on": 401,
      "le": 402,
      "er": 403,
      "om": 404,
      "or": 405,
      "al": 406,
      "as": 407,
      "u_1": 408,
      "et": 409,
      "ro": 410,
      "at": 411,
      "ac": 412,
      "im": 413,
      "re": 414,
      "ing": 415,
      "un": 416,
      "Com": 417,
      "inst✝¹": 418,
      "ap": 419,
      "u_2": 420,
      "it": 421,
      "dd": 422,
      "ar": 423,
      "ul": 424,
      "ra": 425,
      "up": 426,
      "Comm": 427,
      "ed": 428,
      ").": 429,
      "rw": 430,
      "em": 431,
      "imp": 432,
      "id": 433,
      "pac": 434,
      "if": 435,
      "Set": 436,
      "ic": 437,
      "iv": 438,
      "ase": 439,
      "eg": 440,
      "pace": 441,
      "Fin": 442,
      "Space": 443,
      "ble": 444,
      "case": 445,
      "eq": 446,
      "simp": 447,
      "po": 448,
      "orm": 449,
      "ly": 450,
      "inst✝²": 451,
      "is": 452,
      "ge": 453,
      "u_3": 454,
      "su": 455,
      "Is": 456,
      "ex": 457,
      "ct": 458,
      "f_": 459,
      "lo": 460,
      "en": 461,
      "fun": 462,
      "el": 463,
      "roup": 464,
      "Add": 465,
      "ion": 466,
      "=>": 467,
      "mul": 468,
      "du": 469,
      "ero": 470,
      "Group": 471,
      "e_": 472,
      "an": 473,
      "to": 474,
      "t_": 475,
      "co": 476,
      "Ring": 477,
      "eas": 478,
      "easu": 479,
      "eq_": 480,
      "act": 481,
      "map": 482,
      "AddComm": 483,
      "Measu": 484,
      "ono": 485,
      "der": 486,
      "In": 487,
      "ist": 488,
      "int": 489,
      "To": 490,
      "Or": 491,
      "log": 492,
      "Sem": 493,
      "set": 494,
      "inst✝³": 495,
      "ha": 496,
      "ir": 497,
      "u_4": 498,
      "con": 499,
      "ormed": 500,
      "com": 501,
      "Su": 502,
      "able": 503,
      "Mono": 504,
      ".{": 505,
      "))": 506,
      "ine": 507,
      "),": 508,
      "zero": 509,
      "AddCommGroup": 510,
      "Mo": 511,
      "Normed": 512,
      "dule": 513,
      "ec": 514,
      "Pro": 515,
      "mul_": 516,
      "rable": 517,
      "Eq": 518,
      "Monoid": 519,
      "ith": 520,
      ":=": 521,
      "us": 522,
      "th": 523,
      "Cat": 524,
      "il": 525,
      "ig": 526,
      "iring": 527,
      "ran": 528,
      "_n": 529,
      "(f": 530,
      "add": 531,
      "Semiring": 532,
      "ory": 533,
      "eal": 534,
      "Order": 535,
      "cc": 536,
      "ical": 537,
      "of_": 538,
      "_eq_": 539,
      "s.": 540,
      "ort": 541,
      "egory": 542,
      "Nat": 543,
      "Mul": 544,
      "1)": 545,
      "Category": 546,
      "Finset": 547,
      "se": 548,
      "Module": 549,
      "[←": 550,
      "_if": 551,
      "Measurable": 552,
      "app": 553,
      "sub": 554,
      "Sub": 555,
      "hx": 556,
      "ecid": 557,
      "polog": 558,
      "(n": 559,
      "exact": 560,
      "(fun": 561,
      "Topolog": 562,
      "hf": 563,
      "ard": 564,
      ".s": 565,
      "ef": 566,
      "ecidable": 567,
      "Decidable": 568,
      "inst✝⁴": 569,
      "tr": 570,
      "Co": 571,
      "intro": 572,
      "ial": 573,
      "fl": 574,
      "x✝": 575,
      "bra": 576,
      "ter": 577,
      "gebra": 578,
      "only": 579,
      "Category.{": 580,
      "(a": 581,
      "ht": 582,
      "u_5": 583,
      "Topological": 584,
      "type": 585,
      "Un": 586,
      "mem": 587,
      "CommRing": 588,
      "oc": 589,
      "Real": 590,
      "apply": 591,
      "TopologicalSpace": 592,
      "(x": 593,
      "ot": 594,
      "Hom": 595,
      "List": 596,
      "Sort": 597,
      "Nat.": 598,
      "le_": 599,
      "x)": 600,
      "rfl": 601,
      "card": 602,
      "Con": 603,
      "ect": 604,
      "mm": 605,
      "succ": 606,
      "rim": 607,
      "pow": 608,
      "Non": 609,
      "↑(": 610,
      "Al": 611,
      "pt": 612,
      "Zero": 613,
      "inear": 614,
      "p.": 615,
      "iel": 616,
      "ass": 617,
      "val": 618,
      "x_": 619,
      "ast": 620,
      "DecidableEq": 621,
      "Fun": 622,
      "Comp": 623,
      "mk": 624,
      "_s": 625,
      "ield": 626,
      "⁻¹": 627,
      "comp": 628,
      "MeasurableSpace": 629,
      "pro": 630,
      "inv": 631,
      "hs": 632,
      "i)": 633,
      "ction": 634,
      "ive": 635,
      "hp": 636,
      "Prop": 637,
      "Algebra": 638,
      "of": 639,
      "Linear": 640,
      "Has": 641,
      "(i": 642,
      "a✝": 643,
      "ite": 644,
      "Pre": 645,
      "cases": 646,
      "ext": 647,
      "NormedAddCommGroup": 648,
      "one": 649,
      "neg": 650,
      ".map": 651,
      "On": 652,
      "ve": 653,
      "Field": 654,
      "let": 655,
      "ent": 656,
      "Category.{v": 657,
      "Measure": 658,
      "Fintype": 659,
      "''": 660,
      "pos": 661,
      "ight": 662,
      "≥0": 663,
      "((": 664,
      "ob": 665,
      "with": 666,
      "ilter": 667,
      "ℝ≥0": 668,
      "inst✝⁵": 669,
      "range": 670,
      "fine": 671,
      "_of_": 672,
      "Li": 673,
      "n)": 674,
      "age": 675,
      ".to": 676,
      "s,": 677,
      "rime": 678,
      "a)": 679,
      "pty": 680,
      "ymm": 681,
      "um": 682,
      "ric": 683,
      "Map": 684,
      "With": 685,
      "add_": 686,
      "d_": 687,
      "hb": 688,
      "hn": 689,
      "_iff": 690,
      "lef": 691,
      "ation": 692,
      "s_": 693,
      "?_": 694,
      "mem_": 695,
      "empty": 696,
      "ject": 697,
      "h.": 698,
      "comm": 699,
      "ot_": 700,
      "iz": 701,
      "iff": 702,
      "lt_": 703,
      "u}": 704,
      "(↑": 705,
      "Po": 706,
      "(s": 707,
      "uiv": 708,
      "u_6": 709,
      "ver": 710,
      "using": 711,
      "(b": 712,
      "ri": 713,
      "Finite": 714,
      "div": 715,
      ".f": 716,
      "LinearOrder": 717,
      "ad": 718,
      "b)": 719,
      ".n": 720,
      "cast": 721,
      "x_1": 722,
      "mo": 723,
      "ta": 724,
      "tin": 725,
      "art": 726,
      "ous": 727,
      "image": 728,
      "ift": 729,
      "_iff_": 730,
      "tinu": 731,
      "f)": 732,
      "ree": 733,
      "tis": 734,
      "pen": 735,
      "X]": 736,
      "ch": 737,
      "inal": 738,
      "tinuous": 739,
      "this": 740,
      "lass": 741,
      "refine": 742,
      "[X]": 743,
      "x.": 744,
      "fin": 745,
      "left": 746,
      "ol": 747,
      "Int": 748,
      "de": 749,
      "ma": 750,
      "upp": 751,
      "CommSemiring": 752,
      "coe_": 753,
      "2)": 754,
      "s)": 755,
      "actor": 756,
      "α)": 757,
      "one_": 758,
      "inst✝⁶": 759,
      "end": 760,
      "right": 761,
      "Filter": 762,
      "all": 763,
      "univ": 764,
      "Prime": 765,
      "NormedSpace": 766,
      "u₁": 767,
      "simpa": 768,
      "(-": 769,
      "Unit": 770,
      "tiset": 771,
      "↑n": 772,
      "hom": 773,
      "prod": 774,
      "Class": 775,
      "mp": 776,
      "Multiset": 777,
      "Of": 778,
      "Set.": 779,
      "y)": 780,
      "by": 781,
      "Equiv": 782,
      "he": 783,
      "n✝": 784,
      "Bo": 785,
      "AddCommMonoid": 786,
      ".in": 787,
      "inal.{": 788,
      "op": 789,
      "jective": 790,
      "ner": 791,
      "ut": 792,
      "ℝ≥0∞": 793,
      "s✝": 794,
      "have": 795,
      ".re": 796,
      "Id": 797,
      "sum": 798,
      "etric": 799,
      ".d": 800,
      "pow_": 801,
      "Simp": 802,
      "f✝": 803,
      "jo": 804,
      "p)": 805,
      "Mat": 806,
      "R[X]": 807,
      "x,": 808,
      "ab": 809,
      "ate": 810,
      "ng": 811,
      "Top": 812,
      "order": 813,
      "f.": 814,
      "pl": 815,
      "Ord": 816,
      "iff_": 817,
      "Comple": 818,
      "am": 819,
      "Iso": 820,
      "omial": 821,
      "rans": 822,
      "norm": 823,
      "(p": 824,
      "lt": 825,
      "sto": 826,
      "endsto": 827,
      "rap": 828,
      "duct": 829,
      "eff": 830,
      "Simple": 831,
      "Category.{v,": 832,
      "Lie": 833,
      "_neg": 834,
      "raph": 835,
      "ke": 836,
      "Metric": 837,
      "Ab": 838,
      "anc": 839,
      "u_1}": 840,
      "Continuous": 841,
      "ι)": 842,
      "ue": 843,
      "eval": 844,
      "egree": 845,
      "hy": 846,
      "CommMonoid": 847,
      "Open": 848,
      "pre": 849,
      "hd": 850,
      "At": 851,
      "i,": 852,
      "leton": 853,
      "_apply": 854,
      "ingleton": 855,
      "Part": 856,
      "Nonempty": 857,
      "dist": 858,
      "mul,": 859,
      "ph": 860,
      "clo": 861,
      "u_7": 862,
      "es": 863,
      "0)": 864,
      "::": 865,
      "ctor": 866,
      "iform": 867,
      "Ideal": 868,
      "const": 869,
      "aliz": 870,
      "(m": 871,
      "u₂": 872,
      "Sup": 873,
      "get": 874,
      "asis": 875,
      "ern": 876,
      "Qu": 877,
      "pi": 878,
      "leng": 879,
      "length": 880,
      "LinearOrdered": 881,
      "_eq": 882,
      "duction": 883,
      "s₂": 884,
      ";>": 885,
      "<;>": 886,
      ").s": 887,
      "obj": 888,
      "h₁": 889,
      ".Is": 890,
      "sub_": 891,
      "MetricSpace": 892,
      "NN": 893,
      "α✝": 894,
      "ancel": 895,
      ".b": 896,
      "s₁": 897,
      "Str": 898,
      "ι'": 899,
      "mono": 900,
      "a,": 901,
      "Graph": 902,
      "inst✝⁷": 903,
      "simp_": 904,
      "α),": 905,
      "exp": 906,
      "ivial": 907,
      "Real.": 908,
      "Rel": 909,
      "a.": 910,
      "zero,": 911,
      "SimpleGraph": 912,
      "Ordinal.{": 913,
      "Product": 914,
      "zero_": 915,
      "gr": 916,
      "nd": 917,
      "map_": 918,
      "',": 919,
      "assoc": 920,
      "def": 921,
      "ser": 922,
      "ull": 923,
      "rcases": 924,
      "hg": 925,
      "Homo": 926,
      "trans": 927,
      "trivial": 928,
      "hc": 929,
      "per": 930,
      ".2": 931,
      "Div": 932,
      "cle": 933,
      "eri": 934,
      "St": 935,
      "module": 936,
      "Like": 937,
      "₁,": 938,
      "a₂": 939,
      "coe": 940,
      "nat": 941,
      "Matri": 942,
      "max": 943,
      "hi": 944,
      ".mk": 945,
      "sure": 946,
      "ang": 947,
      "simp_rw": 948,
      ".card": 949,
      "Loc": 950,
      "Complex": 951,
      "top": 952,
      "not_": 953,
      "nomial": 954,
      "lynomial": 955,
      "Ch": 956,
      "G.": 957,
      "pan": 958,
      "then": 959,
      "gc": 960,
      "Fact": 961,
      "else": 962,
      "h₂": 963,
      "coeff": 964,
      "Uniform": 965,
      ".1": 966,
      "imit": 967,
      "lift": 968,
      "M'": 969,
      "upport": 970,
      "(1": 971,
      "a₁": 972,
      "tic": 973,
      "l₂": 974,
      "Preorder": 975,
      "Submodule": 976,
      "Complet": 977,
      "und": 978,
      "wo": 979,
      "f'": 980,
      "l.": 981,
      "l₁": 982,
      "Function": 983,
      "ity": 984,
      "ient": 985,
      "vert": 986,
      "induction": 987,
      "algebra": 988,
      "exist": 989,
      "(Nat.": 990,
      "hm": 991,
      "h,": 992,
      ".symm": 993,
      "G'": 994,
      "do": 995,
      "(g": 996,
      "Quot": 997,
      "ernel": 998,
      "subset": 999,
      "Dom": 1000,
      "zero]": 1001,
      "tain": 1002,
      "stric": 1003,
      "a'": 1004,
      "SMul": 1005,
      "hr": 1006,
      "Basis": 1007,
      ".intro": 1008,
      "congr": 1009,
      "n.": 1010,
      "Nontrivial": 1011,
      "Polynomial": 1012,
      "h]": 1013,
      "h_": 1014,
      "ian": 1015,
      "obtain": 1016,
      "ally": 1017,
      "ack": 1018,
      "ind": 1019,
      "Semin": 1020,
      "erm": 1021,
      "(α": 1022,
      "ci": 1023,
      "n,": 1024,
      "Clo": 1025,
      "Mod": 1026,
      "(2": 1027,
      "sed": 1028,
      "Inner": 1029,
      "rintro": 1030,
      "V'": 1031,
      "(I": 1032,
      "(k": 1033,
      "sup": 1034,
      "(map": 1035,
      "Lef": 1036,
      "wer": 1037,
      "inr": 1038,
      ").to": 1039,
      "rfl⟩": 1040,
      "Complete": 1041,
      "oo": 1042,
      "One": 1043,
      "b✝": 1044,
      "au": 1045,
      "g)": 1046,
      "Matrix": 1047,
      "InnerProduct": 1048,
      "two": 1049,
      "orph": 1050,
      "M₂": 1051,
      "u_8": 1052,
      "ens": 1053,
      "InnerProductSpace": 1054,
      "attic": 1055,
      "_iff,": 1056,
      "isjo": 1057,
      "comap": 1058,
      "attice": 1059,
      "(c": 1060,
      "Finset.": 1061,
      "ss": 1062,
      "Der": 1063,
      "Tendsto": 1064,
      "Homolog": 1065,
      "unt": 1066,
      "inl": 1067,
      "itive": 1068,
      "e'": 1069,
      "ure": 1070,
      "Subg": 1071,
      "rank": 1072,
      "Left": 1073,
      "Deriv": 1074,
      "ors": 1075,
      "seu": 1076,
      "seudo": 1077,
      "_pos": 1078,
      ".comp": 1079,
      "⁻¹'": 1080,
      "Char": 1081,
      "alse": 1082,
      "(h": 1083,
      "Seminormed": 1084,
      "Pseudo": 1085,
      "f₁": 1086,
      "non": 1087,
      "elf": 1088,
      "gcd": 1089,
      "Ordered": 1090,
      "ain": 1091,
      "IsS": 1092,
      "Divis": 1093,
      "od": 1094,
      "WithZero": 1095,
      "(X": 1096,
      "atTop": 1097,
      "inst✝⁸": 1098,
      "inser": 1099,
      "div_": 1100,
      "+*": 1101,
      "inv_": 1102,
      "_iff]": 1103,
      "prime": 1104,
      "cos": 1105,
      "Num": 1106,
      "ne_": 1107,
      "_1": 1108,
      "ral": 1109,
      "Degree": 1110,
      "dv": 1111,
      "↑x": 1112,
      "comm]": 1113,
      "b,": 1114,
      "Domain": 1115,
      "↑a": 1116,
      "Norm": 1117,
      "c)": 1118,
      "icat": 1119,
      "b₂": 1120,
      "sin": 1121,
      "Int.": 1122,
      "Integ": 1123,
      "u₁}": 1124,
      "closure": 1125,
      "ism": 1126,
      "orphism": 1127,
      "→+*": 1128,
      "S.": 1129,
      "ag": 1130,
      "min": 1131,
      "ih": 1132,
      "Ass": 1133,
      "Partial": 1134,
      "hain": 1135,
      "F.": 1136,
      "ycle": 1137,
      "_ne_": 1138,
      "strict": 1139,
      "Assoc": 1140,
      "Prod": 1141,
      "[]": 1142,
      "_le": 1143,
      "b₁": 1144,
      "Right": 1145,
      "M.": 1146,
      "mul]": 1147,
      "Bot": 1148,
      "(𝓝": 1149,
      "ition": 1150,
      "ffine": 1151,
      "Em": 1152,
      "Icc": 1153,
      "β)": 1154,
      "Ico": 1155,
      "[s": 1156,
      "inter": 1157,
      "s'": 1158,
      "h'": 1159,
      "t)": 1160,
      "deriv": 1161,
      "_)": 1162,
      "_comp": 1163,
      ".nat": 1164,
      "ti": 1165,
      "x_1)": 1166,
      "comm,": 1167,
      "back": 1168,
      "ullback": 1169,
      "filter": 1170,
      "Category.{v₁,": 1171,
      "1))": 1172,
      "cancel": 1173,
      "one,": 1174,
      "mpr": 1175,
      "₂,": 1176,
      "Sy": 1177,
      "Subgroup": 1178,
      "cast_": 1179,
      "L.": 1180,
      "neg_": 1181,
      "<|": 1182,
      "Morphism": 1183,
      "hab": 1184,
      "one]": 1185,
      "orall": 1186,
      "MeasurableSet": 1187,
      "Card": 1188,
      "singleton": 1189,
      "Within": 1190,
      ").symm": 1191,
      "Union": 1192,
      "p✝": 1193,
      "Ex": 1194,
      "Seq": 1195,
      "Homology": 1196,
      "{x": 1197,
      "e.": 1198,
      "unded": 1199,
      "Inf": 1200,
      "or_": 1201,
      "uct": 1202,
      "exists_": 1203,
      "iag": 1204,
      "factor": 1205,
      "ofReal": 1206,
      "algebraMap": 1207,
      "n'": 1208,
      "row": 1209,
      "ℝ)": 1210,
      "convert": 1211,
      "old": 1212,
      "Quotient": 1213,
      "u_9": 1214,
      "_nat": 1215,
      "M₁": 1216,
      "ome": 1217,
      "pact": 1218,
      "(Nat.Prime": 1219,
      "Succ": 1220,
      "by_": 1221,
      "R)": 1222,
      "HasZero": 1223,
      "hift": 1224,
      "prod_": 1225,
      "_non": 1226,
      "assoc,": 1227,
      "x‖": 1228,
      "ingle": 1229,
      "insert": 1230,
      "Cast": 1231,
      "Ne": 1232,
      "Injective": 1233,
      "tail": 1234,
      "m)": 1235,
      "_apply,": 1236,
      "supp": 1237,
      "n).": 1238,
      "qu": 1239,
      "cons": 1240,
      "s).": 1241,
      "monoid": 1242,
      "ption": 1243,
      "hea": 1244,
      "Ad": 1245,
      "smul_": 1246,
      "h)": 1247,
      "iff,": 1248,
      "[R": 1249,
      "f₂": 1250,
      "var": 1251,
      "Functor": 1252,
      "rwa": 1253,
      "ange": 1254,
      "W.": 1255,
      "k)": 1256,
      "isjoint": 1257,
      "R✝": 1258,
      "p₁": 1259,
      "ce": 1260,
      "ur": 1261,
      "Submonoid": 1262,
      "rom": 1263,
      "Function.": 1264,
      "ho": 1265,
      "p₂": 1266,
      "image_": 1267,
      "true": 1268,
      "Lattice": 1269,
      "X)": 1270,
      "add,": 1271,
      "Gen": 1272,
      ").hom": 1273,
      "Closed": 1274,
      "plit": 1275,
      "ame": 1276,
      "[n": 1277,
      "be": 1278,
      "r)": 1279,
      "h.e'": 1280,
      "b'": 1281,
      "UniformSpace": 1282,
      "ℕ),": 1283,
      "RingHom": 1284,
      "Pred": 1285,
      "g'": 1286,
      "i.": 1287,
      "PartialOrder": 1288,
      "hz": 1289,
      "ep": 1290,
      "ign": 1291,
      "ι),": 1292,
      "dding": 1293,
      "bedding": 1294,
      "angle": 1295,
      ".map_": 1296,
      "Action": 1297,
      ".app": 1298,
      "0,": 1299,
      "abs": 1300,
      "ucture": 1301,
      "verse": 1302,
      "False": 1303,
      "star": 1304,
      "j)": 1305,
      "inst✝⁹": 1306,
      "tendsto": 1307,
      "(y": 1308,
      "Abs": 1309,
      "Prim": 1310,
      "ev": 1311,
      "↑s": 1312,
      "Seri": 1313,
      "Perm": 1314,
      "cal": 1315,
      "Sum": 1316,
      "Factor": 1317,
      "hq": 1318,
      "Compact": 1319,
      "Rat": 1320,
      "(⇑": 1321,
      "S₁": 1322,
      "R'": 1323,
      "ZMod": 1324,
      "_mul_": 1325,
      "integ": 1326,
      "_le_": 1327,
      "def,": 1328,
      "iUnion": 1329,
      "h.e'_": 1330,
      "1,": 1331,
      "_ro": 1332,
      "ht_": 1333,
      "dsimp": 1334,
      "onal": 1335,
      "NNReal.": 1336,
      "bit": 1337,
      "iff]": 1338,
      "Affine": 1339,
      "[R]": 1340,
      "NormedField": 1341,
      "NNReal": 1342,
      "u₂}": 1343,
      "P.": 1344,
      "erase": 1345,
      "inj": 1346,
      "Ar": 1347,
      "Mv": 1348,
      "hu": 1349,
      "and": 1350,
      "ated": 1351,
      ".factor": 1352,
      "ight_": 1353,
      "Topology": 1354,
      "Ioc": 1355,
      "Subtype": 1356,
      "Sym": 1357,
      "LinearMap": 1358,
      "(Fin": 1359,
      "limit": 1360,
      "Star": 1361,
      "igma": 1362,
      "LieRing": 1363,
      "Option": 1364,
      "MulAction": 1365,
      "Morphisms": 1366,
      "induction'": 1367,
      "⟨fun": 1368,
      "additive": 1369,
      "Category.{v₂,": 1370,
      "measu": 1371,
      "↑m": 1372,
      "cl": 1373,
      "IsUnit": 1374,
      "SeminormedAddCommGroup": 1375,
      "t,": 1376,
      "heaf": 1377,
      "ord": 1378,
      "iq": 1379,
      "y,": 1380,
      "hk": 1381,
      "∂μ": 1382,
      "ict": 1383,
      "(by": 1384,
      "by_cases": 1385,
      "_root_": 1386,
      "EMetricSpace": 1387,
      "forall": 1388,
      "finite": 1389,
      "Division": 1390,
      "Disjoint": 1391,
      "Bool": 1392,
      "union": 1393,
      "f).": 1394,
      "x))": 1395,
      "ree_": 1396,
      "t₁": 1397,
      "ber": 1398,
      "nect": 1399,
      ".support": 1400,
      "Preadditive": 1401,
      "G₀": 1402,
      "Ro": 1403,
      "choo": 1404,
      "HasZeroMorphisms": 1405,
      "chain": 1406,
      "wap": 1407,
      "u'": 1408,
      "})": 1409,
      "X✝": 1410,
      "left_": 1411,
      "LE": 1412,
      "arg": 1413,
      "AddGroup": 1414,
      "and_": 1415,
      "Inter": 1416,
      "continuous": 1417,
      "ector": 1418,
      ".fst": 1419,
      "untable": 1420,
      "AddMonoid": 1421,
      "M₀": 1422,
      "Diff": 1423,
      "Limit": 1424,
      "join": 1425,
      "dvd": 1426,
      "[mul_": 1427,
      "ant": 1428,
      "R₂": 1429,
      "(r": 1430,
      "Embedding": 1431,
      "(∀": 1432,
      "++": 1433,
      "_left": 1434,
      "t₂": 1435,
      "ique": 1436,
      "DecidablePred": 1437,
      "hI": 1438,
      "sq": 1439,
      "Locally": 1440,
      "nected": 1441,
      "Coprime": 1442,
      "Val": 1443,
      "Fintype.card": 1444,
      "right_": 1445,
      "Cancel": 1446,
      "head": 1447,
      "rex": 1448,
      "Unital": 1449,
      "rexp": 1450,
      "ular": 1451,
      ")).": 1452,
      "(l": 1453,
      "CLike": 1454,
      "IsOpen": 1455,
      "β✝": 1456,
      "Ob": 1457,
      "ale": 1458,
      "root": 1459,
      "intro.intro": 1460,
      "ization": 1461,
      "ker": 1462,
      "inf": 1463,
      "?_⟩": 1464,
      "RCLike": 1465,
      "NonUnital": 1466,
      "adic": 1467,
      "→ₗ": 1468,
      "IsDomain": 1469,
      "LinearOrderedField": 1470,
      "a1": 1471,
      "_singleton": 1472,
      "unit": 1473,
      "fold": 1474,
      "Strict": 1475,
      "egree_": 1476,
      "Finsupp": 1477,
      "fine_": 1478,
      "t✝": 1479,
      "calar": 1480,
      "S₂": 1481,
      "z)": 1482,
      "x✝¹": 1483,
      "part": 1484,
      "Inde": 1485,
      "str": 1486,
      "eff_": 1487,
      "Series": 1488,
      "Form": 1489,
      "constr": 1490,
      "p,": 1491,
      "u.": 1492,
      "Cardinal.{": 1493,
      "(d": 1494,
      "→₀": 1495,
      "roid": 1496,
      "plic": 1497,
      "(π": 1498,
      "m0": 1499,
      "₁₂": 1500,
      "sum_": 1501,
      "Module.": 1502,
      "ual": 1503,
      "(t": 1504,
      "a).": 1505,
      "m.": 1506,
      "oid": 1507,
      "(0": 1508,
      "Integrable": 1509,
      "-1": 1510,
      "_right": 1511,
      "y✝": 1512,
      "fst": 1513,
      "ract": 1514,
      "rjective": 1515,
      "(Set": 1516,
      "PseudoMetricSpace": 1517,
      "uctor": 1518,
      "ℕ+": 1519,
      "constructor": 1520,
      "↑b": 1521,
      "_,": 1522,
      "NonAssoc": 1523,
      "x).": 1524,
      "(z": 1525,
      "(𝟙": 1526,
      "hl": 1527,
      "inf_": 1528,
      "fi": 1529,
      ".val": 1530,
      "List.": 1531,
      "ring": 1532,
      "_self": 1533,
      "ean": 1534,
      "⇑f": 1535,
      "G''": 1536,
      "unop": 1537,
      "_ne": 1538,
      "MvPolynomial": 1539,
      "']": 1540,
      "u_10": 1541,
      "pend": 1542,
      "F'": 1543,
      "integral": 1544,
      "Dist": 1545,
      "inst✝¹⁰": 1546,
      "iagonal": 1547,
      "air": 1548,
      "acob": 1549,
      "(range": 1550,
      "CompleteSpace": 1551,
      "‖x‖": 1552,
      "{a": 1553,
      "Structure": 1554,
      "(of": 1555,
      "?_,": 1556,
      "Ordinal.{u}": 1557,
      "Countable": 1558,
      "(to": 1559,
      "vex": 1560,
      "u_2,": 1561,
      "Pos": 1562,
      "(algebraMap": 1563,
      "ᵒᵖ": 1564,
      "Root": 1565,
      "refine_": 1566,
      "cycle": 1567,
      "×ˢ": 1568,
      "μ.": 1569,
      "_eq_zero": 1570,
      "Au": 1571,
      "equiv": 1572,
      "ne": 1573,
      "cod": 1574,
      "xs": 1575,
      "t.": 1576,
      "ENNReal.": 1577,
      "(C": 1578,
      "degree": 1579,
      "v}": 1580,
      "hxy": 1581,
      "Bounded": 1582,
      "Free": 1583,
      "oi": 1584,
      "hv": 1585,
      "Cochain": 1586,
      "elf_": 1587,
      "norm_": 1588,
      "l'": 1589,
      "succ,": 1590,
      "Matroid": 1591,
      "alization": 1592,
      "subtype": 1593,
      "icator": 1594,
      "No": 1595,
      "coe,": 1596,
      "bo": 1597,
      "int_": 1598,
      "card_": 1599,
      "_neg,": 1600,
      "iable": 1601,
      "_root_.": 1602,
      ".coe_": 1603,
      "_nonneg": 1604,
      "cont": 1605,
      "inar": 1606,
      "PseudoEMetricSpace": 1607,
      "_ne_zero": 1608,
      "h2": 1609,
      "Coeff": 1610,
      "Category.{u_2,": 1611,
      "(mk": 1612,
      "imal": 1613,
      "[mem_": 1614,
      "i).": 1615,
      "CommMonoidWithZero": 1616,
      "odup": 1617,
      "igit": 1618,
      "span": 1619,
      "lyNormedField": 1620,
      "NontriviallyNormedField": 1621,
      "x₁": 1622,
      "Lift": 1623,
      ".im": 1624,
      "hds": 1625,
      "iant": 1626,
      "x₂": 1627,
      "mod": 1628,
      "f,": 1629,
      "F.map": 1630,
      "},": 1631,
      "⟨x,": 1632,
      "_eq,": 1633,
      "Tors": 1634,
      "c.": 1635,
      "subset_": 1636,
      "(P": 1637,
      "has": 1638,
      "eta": 1639,
      "o.": 1640,
      ".inr": 1641,
      "edist": 1642,
      "choose": 1643,
      "An": 1644,
      "CommGroup": 1645,
      "natDegree": 1646,
      "Mon": 1647,
      "Ordinal.{u_1}": 1648,
      "Tower": 1649,
      "FunLike": 1650,
      "(S": 1651,
      "(∃": 1652,
      "rop": 1653,
      "Abo": 1654,
      "A)": 1655,
      "ofNat": 1656,
      "_lt_": 1657,
      "Set.range": 1658,
      ").inv": 1659,
      "IsScalar": 1660,
      "IsScalarTower": 1661,
      "Ir": 1662,
      "↑p": 1663,
      "pr": 1664,
      "c,": 1665,
      "[Nat.": 1666,
      "m'": 1667,
      "⟨a,": 1668,
      "le_of_": 1669,
      "alk": 1670,
      "Trans": 1671,
      "v)": 1672,
      "ize": 1673,
      "Gener": 1674,
      "R₁": 1675,
      "power": 1676,
      "are": 1677,
      "L₂": 1678,
      "iSup": 1679,
      "hape": 1680,
      "(fin": 1681,
      "eq,": 1682,
      "Iic": 1683,
      "se_": 1684,
      "onomial": 1685,
      "DecidableRel": 1686,
      ".hom": 1687,
      "Vector": 1688,
      "LieAlgebra": 1689,
      "Localization": 1690,
      "ℵ₀": 1691,
      "↑k": 1692,
      "redu": 1693,
      "h0": 1694,
      "sub_eq_": 1695,
      "Pres": 1696,
      "u,": 1697,
      "Shape": 1698,
      "//": 1699,
      "_).": 1700,
      "h1": 1701,
      "y‖": 1702,
      "Dual": 1703,
      "sc": 1704,
      "adj": 1705,
      "mmable": 1706,
      ".inl": 1707,
      "den": 1708,
      "tendsto_": 1709,
      "i✝": 1710,
      "i))": 1711,
      "Inv": 1712,
      "variant": 1713,
      "unc": 1714,
      ".of": 1715,
      "I)": 1716,
      "S)": 1717,
      "io": 1718,
      "ell": 1719,
      "amm": 1720,
      "Fract": 1721,
      "ret": 1722,
      "iter": 1723,
      "diff_": 1724,
      "⟫_": 1725,
      "(_": 1726,
      ".snd": 1727,
      "[a": 1728,
      "ry": 1729,
      "L.Structure": 1730,
      "Kernel": 1731,
      "alized": 1732,
      "v,": 1733,
      "rad": 1734,
      "ves": 1735,
      "l)": 1736,
      "Torsor": 1737,
      "(j": 1738,
      "AddTorsor": 1739,
      "Opens": 1740,
      ".trans": 1741,
      "L'": 1742,
      "bot": 1743,
      "g✝": 1744,
      "ircle": 1745,
      "IH": 1746,
      "coeff_": 1747,
      "igits": 1748,
      "h⟩": 1749,
      ".succ": 1750,
      "(kernel": 1751,
      "c'": 1752,
      "V₂": 1753,
      "nil": 1754,
      "pred": 1755,
      "Adj": 1756,
      "ire": 1757,
      "l,": 1758,
      "Cycle": 1759,
      "closed": 1760,
      "Subsingleton": 1761,
      "s.card": 1762,
      "cases'": 1763,
      "DivisionRing": 1764,
      "∫⁻": 1765,
      "apply,": 1766,
      "Sq": 1767,
      "V''": 1768,
      "m✝": 1769,
      "amma": 1770,
      "pullback": 1771,
      "_eq]": 1772,
      "codable": 1773,
      "loor": 1774,
      "map,": 1775,
      "Aux": 1776,
      "Ev": 1777,
      "some": 1778,
      "ise": 1779,
      "Ioi": 1780,
      "Complex.": 1781,
      "c₂": 1782,
      "ute": 1783,
      "ip": 1784,
      "tisymm": 1785,
      "ie": 1786,
      "At_": 1787,
      "K)": 1788,
      "padic": 1789,
      "rib": 1790,
      "inter_": 1791,
      "Y✝": 1792,
      "⋯)": 1793,
      "erent": 1794,
      "NonAssocSemiring": 1795,
      "X.": 1796,
      "(rfl": 1797,
      "OneClass": 1798,
      "tal": 1799,
      "⋯⟩": 1800,
      "(s.": 1801,
      "IsIso": 1802,
      "Dat": 1803,
      "1).": 1804,
      "def]": 1805,
      "preimage": 1806,
      "ne_zero": 1807,
      "v'": 1808,
      "dvd_": 1809,
      "cen": 1810,
      "Pow": 1811,
      "Closure": 1812,
      "p'": 1813,
      "→*": 1814,
      "eqTo": 1815,
      "auto": 1816,
      ".mpr": 1817,
      "AE": 1818,
      "loc": 1819,
      "Ball": 1820,
      "pec": 1821,
      "_num": 1822,
      "M)": 1823,
      "Fraction": 1824,
      "k,": 1825,
      "dual": 1826,
      "Object": 1827,
      "count": 1828,
      "Ioo": 1829,
      "_apply]": 1830,
      "α'": 1831,
      "pect": 1832,
      "Infinite": 1833,
      "b).": 1834,
      "rot": 1835,
      "n.succ": 1836,
      "(β": 1837,
      "Semil": 1838,
      "g₂": 1839,
      "itz": 1840,
      "ong": 1841,
      "PG": 1842,
      "Ici": 1843,
      "Walk": 1844,
      "antisymm": 1845,
      "ension": 1846,
      "(G": 1847,
      "ℕ)": 1848,
      "refl": 1849,
      "hS": 1850,
      "assoc]": 1851,
      "ift_": 1852,
      "E'": 1853,
      "L₁": 1854,
      "g₁": 1855,
      "l).": 1856,
      "↑π": 1857,
      "u_11": 1858,
      "ading": 1859,
      "edSpace": 1860,
      "(p.": 1861,
      "By": 1862,
      "erentiable": 1863,
      "split": 1864,
      "leading": 1865,
      ".restrict": 1866,
      "add]": 1867,
      "sSup": 1868,
      "Surjective": 1869,
      "‖f": 1870,
      "uage": 1871,
      "anguage": 1872,
      "MO": 1873,
      "[add_": 1874,
      "MOD": 1875,
      ".is": 1876,
      "class": 1877,
      "kernel": 1878,
      "a))": 1879,
      "lt_of_": 1880,
      "'.": 1881,
      "ball": 1882,
      "norm_num": 1883,
      ")]": 1884,
      "m,": 1885,
      "Sym2": 1886,
      "(v": 1887,
      "IsClosed": 1888,
      "eqToHom": 1889,
      "Zeta": 1890,
      "castSucc": 1891,
      "Above": 1892,
      ".den": 1893,
      "(A": 1894,
      "Subalgebra": 1895,
      "epar": 1896,
      "conj": 1897,
      "classical": 1898,
      ".id": 1899,
      "Pat": 1900,
      "Divisors": 1901,
      "WithinAt": 1902,
      "tent": 1903,
      "c₁": 1904,
      "self": 1905,
      "Y'": 1906,
      "elim": 1907,
      "_natCast": 1908,
      "p]": 1909,
      "real": 1910,
      "isjoint_": 1911,
      "subst": 1912,
      "range_": 1913,
      "nonneg": 1914,
      "Of_": 1915,
      "x'": 1916,
      "Pullback": 1917,
      "ComplexShape": 1918,
      "Language": 1919,
      "ate_": 1920,
      "u_2}": 1921,
      "Monic": 1922,
      "hP": 1923,
      "↑(f": 1924,
      "Y)": 1925,
      "hf.": 1926,
      "[h]": 1927,
      "(M": 1928,
      "n))": 1929,
      "pow,": 1930,
      "Data": 1931,
      "decid": 1932,
      "↑↑": 1933,
      "tiplic": 1934,
      "Even": 1935,
      "tiplicity": 1936,
      "chem": 1937,
      "Monoidal": 1938,
      "∀ᶠ": 1939,
      "gener": 1940,
      "End": 1941,
      "Circle": 1942,
      "Primcodable": 1943,
      "(↑(": 1944,
      "ofReal_": 1945,
      "Shift": 1946,
      "2))": 1947,
      "_add_": 1948,
      "congr_": 1949,
      "β'": 1950,
      "plicat": 1951,
      "l.length": 1952,
      "Indep": 1953,
      "q)": 1954,
      "r₂": 1955,
      "move": 1956,
      "NeZero": 1957,
      "n₁": 1958,
      "Semilattice": 1959,
      "Iio": 1960,
      "onent": 1961,
      "ensity": 1962,
      "eq_or": 1963,
      ".l": 1964,
      "ite_": 1965,
      "↑(n": 1966,
      "↑n)": 1967,
      "1]": 1968,
      "[d": 1969,
      "eight": 1970,
      "Par": 1971,
      "Gamma": 1972,
      "i'": 1973,
      "mem_s": 1974,
      "pert": 1975,
      "CompleteLattice": 1976,
      "c✝": 1977,
      "reverse": 1978,
      "Associ": 1979,
      "uation": 1980,
      "ℂ)": 1981,
      "unfold": 1982,
      "DerivAt": 1983,
      "PGame": 1984,
      "cret": 1985,
      "(↑n": 1986,
      "div_eq_": 1987,
      "Integral": 1988,
      "Ind": 1989,
      ".h": 1990,
      "variantClass": 1991,
      ".mem_": 1992,
      "false": 1993,
      "upd": 1994,
      "Connected": 1995,
      "injective": 1996,
      "closedBall": 1997,
      "n₂": 1998,
      "snd": 1999,
      "self_": 2000,
      "Number": 2001,
      ".mp": 2002,
      "mod_": 2003,
      "F.obj": 2004,
      "desc": 2005,
      ".obj": 2006,
      "h✝": 2007,
      "V₁": 2008,
      "r₁": 2009,
      "Nat.cast_": 2010,
      "two_": 2011,
      "eq]": 2012,
      "mul_inv": 2013,
      "measure": 2014,
      "u_12": 2015,
      "exists": 2016,
      "quare": 2017,
      "X'": 2018,
      "p).": 2019,
      "Colimit": 2020,
      "_neg]": 2021,
      "ensor": 2022,
      "decide": 2023,
      "inst✝¹¹": 2024,
      "Schem": 2025,
      "↑y": 2026,
      "β),": 2027,
      "↥(kernel": 2028,
      "→ₗ[R]": 2029,
      "cible": 2030,
      "ax": 2031,
      "ually": 2032,
      "(-1)": 2033,
      "Cl": 2034,
      "Epi": 2035,
      "rat": 2036,
      "Inf_": 2037,
      "comp_": 2038,
      "eq_or_ne": 2039,
      "(if": 2040,
      "reducible": 2041,
      "M₃": 2042,
      "d)": 2043,
      "Density": 2044,
      "restrict": 2045,
      "((fun": 2046,
      "Equiv.": 2047,
      "eval₂": 2048,
      "Distrib": 2049,
      "rpow": 2050,
      ".natAbs": 2051,
      "compl": 2052,
      "Fn": 2053,
      "[l": 2054,
      "(finrank": 2055,
      "Nodup": 2056,
      "Strong": 2057,
      "gen": 2058,
      "_to": 2059,
      "monomial": 2060,
      "Box": 2061,
      "Sh": 2062,
      "X₂": 2063,
      "rpow_": 2064,
      "product": 2065,
      "jOn": 2066,
      ").obj": 2067,
      "Point": 2068,
      "Ap": 2069,
      "↑f": 2070,
      "Unique": 2071,
      "lift.{": 2072,
      "ff": 2073,
      "?_)": 2074,
      "change": 2075,
      "x.1": 2076,
      "refine_1": 2077,
      "MulOneClass": 2078,
      "Presheaf": 2079,
      "bs": 2080,
      "(e": 2081,
      "arrow": 2082,
      "oangle": 2083,
      "rum": 2084,
      "pectrum": 2085,
      "Odd": 2086,
      "edge": 2087,
      "measurable": 2088,
      "LocallyFinite": 2089,
      "Vec": 2090,
      "hj": 2091,
      "tone": 2092,
      "Summable": 2093,
      ".length": 2094,
      "s.Nonempty": 2095,
      "(a,": 2096,
      "plicative": 2097,
      "prim": 2098,
      ".toReal": 2099,
      "CovariantClass": 2100,
      "ort_": 2101,
      "ext_": 2102,
      "F)": 2103,
      "encard": 2104,
      "alizer": 2105,
      "?u": 2106,
      "[n]": 2107,
      "rt": 2108,
      "duc": 2109,
      "Floor": 2110,
      "code": 2111,
      "cy": 2112,
      "x₀": 2113,
      "tan": 2114,
      "Setoid": 2115,
      "Ang": 2116,
      "M✝": 2117,
      "Angle": 2118,
      "finrank": 2119,
      "num": 2120,
      "∑'": 2121,
      "↑t": 2122,
      "⟩,": 2123,
      "ace": 2124,
      "TopCat": 2125,
      "Convex": 2126,
      "MonoidHom": 2127,
      "hpq": 2128,
      "odic": 2129,
      "mα": 2130,
      "IsCompact": 2131,
      "ator": 2132,
      "Min": 2133,
      "egular": 2134,
      "entually": 2135,
      "eval_": 2136,
      "inner": 2137,
      "Arrow": 2138,
      "{a}": 2139,
      "cexp": 2140,
      "{x}": 2141,
      "l✝": 2142,
      "interi": 2143,
      "Path": 2144,
      "ega": 2145,
      ".eq_": 2146,
      "a_1": 2147,
      "X₁": 2148,
      "CancelCommMonoidWithZero": 2149,
      "Regular": 2150,
      "bi": 2151,
      "p₃": 2152,
      "ai": 2153,
      "Normal": 2154,
      "MonoidalCategory": 2155,
      "✝¹": 2156,
      "⦄,": 2157,
      "crete": 2158,
      "Bi": 2159,
      "Bdd": 2160,
      "t).": 2161,
      "sub,": 2162,
      ".num": 2163,
      "abs_": 2164,
      "uniform": 2165,
      ").map": 2166,
      "ay": 2167,
      "out": 2168,
      "ent_": 2169,
      "Ref": 2170,
      "det": 2171,
      "v₁": 2172,
      "cond": 2173,
      "I.": 2174,
      "ole": 2175,
      "sep": 2176,
      "ι✝": 2177,
      "omic": 2178,
      "_symm": 2179,
      "(φ": 2180,
      "Le": 2181,
      "a✝¹": 2182,
      ".prod": 2183,
      "a⁻¹": 2184,
      "none": 2185,
      "vol": 2186,
      "(μ": 2187,
      "pi_": 2188,
      "aleph": 2189,
      "leadingCoeff": 2190,
      "0]": 2191,
      "Re": 2192,
      "index": 2193,
      "x.2": 2194,
      "Function.Injective": 2195,
      "Degree_": 2196,
      "Mem": 2197,
      "potent": 2198,
      "Cond": 2199,
      "=ᶠ": 2200,
      "Boole": 2201,
      "Boolean": 2202,
      "↑q": 2203,
      "from": 2204,
      "✝,": 2205,
      "append": 2206,
      "map]": 2207,
      "NoZero": 2208,
      "EReal": 2209,
      "lock": 2210,
      "(n✝": 2211,
      "ientation": 2212,
      "Bor": 2213,
      "(E": 2214,
      "succ_": 2215,
      "Dim": 2216,
      "u₃": 2217,
      "upper": 2218,
      "K[X]": 2219,
      "L[": 2220,
      "ative": 2221,
      "Chain": 2222,
      "bot_": 2223,
      "g.": 2224,
      "j,": 2225,
      "HomologyData": 2226,
      "pure": 2227,
      "rotate": 2228,
      "le_iff_": 2229,
      "hx,": 2230,
      "forall_": 2231,
      "pal": 2232,
      "inci": 2233,
      "u_3,": 2234,
      "incipal": 2235,
      "bind": 2236,
      "no": 2237,
      "tomic": 2238,
      "clotomic": 2239,
      "airw": 2240,
      "lim": 2241,
      "uter": 2242,
      "Short": 2243,
      "Im": 2244,
      "Category.{u_3,": 2245,
      "Peri": 2246,
      "Scheme": 2247,
      "ick": 2248,
      ")))": 2249,
      "Empty": 2250,
      "ensional": 2251,
      "Dimensional": 2252,
      "↑I": 2253,
      ".norm": 2254,
      "Sigma": 2255,
      "[pow_": 2256,
      "list": 2257,
      "𝕜]": 2258,
      "LieModule": 2259,
      "S✝": 2260,
      "coe]": 2261,
      "Pi": 2262,
      ".r": 2263,
      "Cau": 2264,
      "Range": 2265,
      "inary": 2266,
      "LieRingModule": 2267,
      ".ι": 2268,
      "Separ": 2269,
      "SetLike": 2270,
      "Up": 2271,
      "sInf": 2272,
      "lower": 2273,
      "position": 2274,
      "Nil": 2275,
      "Subtype.val": 2276,
      "(re": 2277,
      "_ifs": 2278,
      "split_ifs": 2279,
      "odd": 2280,
      "pair": 2281,
      "ream": 2282,
      "contr": 2283,
      "p.to": 2284,
      "FiniteDimensional": 2285,
      "even": 2286,
      "Alg": 2287,
      "Lo": 2288,
      "S,": 2289,
      "Span": 2290,
      "s]": 2291,
      "FiniteMeasure": 2292,
      "Commute": 2293,
      ".inv": 2294,
      "Dis": 2295,
      "hU": 2296,
      "ible": 2297,
      "₂)": 2298,
      "le,": 2299,
      "idiagonal": 2300,
      "LocallyFiniteOrder": 2301,
      "h).": 2302,
      "[is": 2303,
      "cons,": 2304,
      "rier": 2305,
      "strict_": 2306,
      "Param": 2307,
      "Nat.Prime": 2308,
      "r,": 2309,
      "¬p": 2310,
      "Rec": 2311,
      "z.im": 2312,
      "Image": 2313,
      "ℤ)": 2314,
      "orget": 2315,
      "Nat.card": 2316,
      "Classical": 2317,
      "_smul_": 2318,
      "ofD": 2319,
      "withDensity": 2320,
      "Homological": 2321,
      "jacob": 2322,
      "arct": 2323,
      "arctan": 2324,
      "(coeff": 2325,
      "Cᵒᵖ": 2326,
      "haveI": 2327,
      "μ)": 2328,
      "inst✝¹²": 2329,
      "⟫_𝕜": 2330,
      "tran": 2331,
      "poly": 2332,
      "elian": 2333,
      "CochainComplex": 2334,
      "Invert": 2335,
      "Den": 2336,
      "Cont": 2337,
      "Max": 2338,
      "Monotone": 2339,
      "hiftFunctor": 2340,
      "Γ₀": 2341,
      "ive_": 2342,
      ".span": 2343,
      "empty_": 2344,
      ".natDegree": 2345,
      "sub_eq_add": 2346,
      "[to": 2347,
      "⟨_,": 2348,
      "icon": 2349,
      "_eq_of_": 2350,
      "Abelian": 2351,
      "h₀": 2352,
      "trunc": 2353,
      "_id": 2354,
      "preimage_": 2355,
      "ι₂": 2356,
      "logy": 2357,
      "_nhds": 2358,
      "connected": 2359,
      "LinearMap.": 2360,
      "Differentiable": 2361,
      "s.re": 2362,
      "olut": 2363,
      "univ,": 2364,
      "A'": 2365,
      "Set.mem_": 2366,
      ".refl": 2367,
      "G.Adj": 2368,
      "update": 2369,
      "Well": 2370,
      "⟪x,": 2371,
      "Quot.mk": 2372,
      "f₀": 2373,
      "le_antisymm": 2374,
      "indicator": 2375,
      "n]": 2376,
      "orderOf": 2377,
      "Jacob": 2378,
      ").comp": 2379,
      "x]": 2380,
      "y))": 2381,
      "v.": 2382,
      "Preser": 2383,
      "eventually": 2384,
      "prime_": 2385,
      "z✝": 2386,
      "conv": 2387,
      "C)": 2388,
      "G✝": 2389,
      "[eq_": 2390,
      "AffineSpace": 2391,
      "interior": 2392,
      "volum": 2393,
      "uterMeasure": 2394,
      "On_": 2395,
      "utation": 2396,
      "j'": 2397,
      "oull": 2398,
      "z,": 2399,
      "ernoull": 2400,
      "integral_": 2401,
      "Fac": 2402,
      "itt": 2403,
      "u)": 2404,
      "The": 2405,
      "basis": 2406,
      "p.natDegree": 2407,
      "Polynomial.": 2408,
      "left,": 2409,
