{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PROOFSTATE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[PROOFSTEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[TACTICS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "[STATESEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "[SUC]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "[INC]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10,
      "content": "[INV]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[EOS]": 2,
      "[PROOFSTATE]": 3,
      "[PROOFSTEP]": 4,
      "[TACTICS]": 5,
      "[SEP]": 6,
      "[STATESEP]": 7,
      "[SUC]": 8,
      "[INC]": 9,
      "[INV]": 10,
      "!": 11,
      "#": 12,
      "$": 13,
      "%": 14,
      "'": 15,
      "(": 16,
      ")": 17,
      "*": 18,
      "+": 19,
      ",": 20,
      "-": 21,
      ".": 22,
      "/": 23,
      "0": 24,
      "1": 25,
      "2": 26,
      "3": 27,
      "4": 28,
      "5": 29,
      "6": 30,
      "7": 31,
      "8": 32,
      "9": 33,
      ":": 34,
      ";": 35,
      "<": 36,
      "=": 37,
      ">": 38,
      "?": 39,
      "@": 40,
      "A": 41,
      "B": 42,
      "C": 43,
      "D": 44,
      "E": 45,
      "F": 46,
      "G": 47,
      "H": 48,
      "I": 49,
      "J": 50,
      "K": 51,
      "L": 52,
      "M": 53,
      "N": 54,
      "O": 55,
      "P": 56,
      "Q": 57,
      "R": 58,
      "S": 59,
      "T": 60,
      "U": 61,
      "V": 62,
      "W": 63,
      "X": 64,
      "Y": 65,
      "Z": 66,
      "[": 67,
      "\\": 68,
      "]": 69,
      "^": 70,
      "_": 71,
      "a": 72,
      "b": 73,
      "c": 74,
      "d": 75,
      "e": 76,
      "f": 77,
      "g": 78,
      "h": 79,
      "i": 80,
      "j": 81,
      "k": 82,
      "l": 83,
      "m": 84,
      "n": 85,
      "o": 86,
      "p": 87,
      "q": 88,
      "r": 89,
      "s": 90,
      "t": 91,
      "u": 92,
      "v": 93,
      "w": 94,
      "x": 95,
      "y": 96,
      "z": 97,
      "{": 98,
      "|": 99,
      "}": 100,
      "~": 101,
      "«": 102,
      "¬": 103,
      "²": 104,
      "³": 105,
      "¹": 106,
      "»": 107,
      "×": 108,
      "ʷ": 109,
      "ʸ": 110,
      "ˢ": 111,
      "ˣ": 112,
      "Γ": 113,
      "Θ": 114,
      "Ι": 115,
      "Λ": 116,
      "Π": 117,
      "Σ": 118,
      "Φ": 119,
      "Ψ": 120,
      "Ω": 121,
      "α": 122,
      "β": 123,
      "γ": 124,
      "δ": 125,
      "ε": 126,
      "ζ": 127,
      "η": 128,
      "θ": 129,
      "ι": 130,
      "κ": 131,
      "λ": 132,
      "μ": 133,
      "ν": 134,
      "ξ": 135,
      "π": 136,
      "ρ": 137,
      "σ": 138,
      "τ": 139,
      "φ": 140,
      "χ": 141,
      "ψ": 142,
      "ω": 143,
      "ϕ": 144,
      "ᗮ": 145,
      "ᘁ": 146,
      "ᴴ": 147,
      "ᴸ": 148,
      "ᵀ": 149,
      "ᵁ": 150,
      "ᵃ": 151,
      "ᵇ": 152,
      "ᵈ": 153,
      "ᵐ": 154,
      "ᵒ": 155,
      "ᵖ": 156,
      "ᵛ": 157,
      "ᵢ": 158,
      "ᵤ": 159,
      "ᵥ": 160,
      "ᶜ": 161,
      "ᶠ": 162,
      "‖": 163,
      "•": 164,
      "‹": 165,
      "›": 166,
      "⁄": 167,
      "⁅": 168,
      "⁆": 169,
      "⁰": 170,
      "ⁱ": 171,
      "⁴": 172,
      "⁵": 173,
      "⁶": 174,
      "⁷": 175,
      "⁸": 176,
      "⁹": 177,
      "⁺": 178,
      "⁻": 179,
      "₀": 180,
      "₁": 181,
      "₂": 182,
      "₃": 183,
      "₄": 184,
      "₅": 185,
      "₆": 186,
      "₊": 187,
      "ₐ": 188,
      "ₒ": 189,
      "ₕ": 190,
      "ₖ": 191,
      "ₗ": 192,
      "ₘ": 193,
      "ₙ": 194,
      "ₚ": 195,
      "ₛ": 196,
      "ₜ": 197,
      "ℂ": 198,
      "ℍ": 199,
      "ℐ": 200,
      "ℒ": 201,
      "ℓ": 202,
      "ℕ": 203,
      "ℙ": 204,
      "ℚ": 205,
      "ℝ": 206,
      "ℤ": 207,
      "ℬ": 208,
      "ℱ": 209,
      "ℵ": 210,
      "⅟": 211,
      "←": 212,
      "↑": 213,
      "→": 214,
      "↓": 215,
      "↔": 216,
      "↗": 217,
      "↥": 218,
      "↦": 219,
      "↪": 220,
      "↾": 221,
      "⇑": 222,
      "⇒": 223,
      "∀": 224,
      "∂": 225,
      "∃": 226,
      "∅": 227,
      "∆": 228,
      "∈": 229,
      "∉": 230,
      "∏": 231,
      "∐": 232,
      "∑": 233,
      "∗": 234,
      "∘": 235,
      "∙": 236,
      "√": 237,
      "∞": 238,
      "∠": 239,
      "∡": 240,
      "∣": 241,
      "∧": 242,
      "∨": 243,
      "∩": 244,
      "∪": 245,
      "∫": 246,
      "∮": 247,
      "≃": 248,
      "≅": 249,
      "≈": 250,
      "≌": 251,
      "≠": 252,
      "≡": 253,
      "≤": 254,
      "≥": 255,
      "≪": 256,
      "≫": 257,
      "⊂": 258,
      "⊆": 259,
      "⊇": 260,
      "⊓": 261,
      "⊔": 262,
      "⊕": 263,
      "⊗": 264,
      "⊢": 265,
      "⊣": 266,
      "⊤": 267,
      "⊥": 268,
      "⊨": 269,
      "⊻": 270,
      "⊼": 271,
      "⋀": 272,
      "⋂": 273,
      "⋃": 274,
      "⋆": 275,
      "⋖": 276,
      "⋙": 277,
      "⋯": 278,
      "⌈": 279,
      "⌉": 280,
      "⌊": 281,
      "⌋": 282,
      "▷": 283,
      "▸": 284,
      "◁": 285,
      "◃": 286,
      "○": 287,
      "◫": 288,
      "✝": 289,
      "✶": 290,
      "⟂": 291,
      "⟦": 292,
      "⟧": 293,
      "⟨": 294,
      "⟩": 295,
      "⟪": 296,
      "⟫": 297,
      "⟮": 298,
      "⟯": 299,
      "⟶": 300,
      "⟹": 301,
      "⥤": 302,
      "⦃": 303,
      "⦄": 304,
      "⧏": 305,
      "⧸": 306,
      "⨁": 307,
      "⨂": 308,
      "⨅": 309,
      "⨆": 310,
      "⨍": 311,
      "⨯": 312,
      "⬝": 313,
      "￢": 314,
      "𝐞": 315,
      "𝒜": 316,
      "𝒞": 317,
      "𝒟": 318,
      "𝒢": 319,
      "𝒮": 320,
      "𝒰": 321,
      "𝒳": 322,
      "𝒴": 323,
      "𝓕": 324,
      "𝓘": 325,
      "𝓝": 326,
      "𝓞": 327,
      "𝓟": 328,
      "𝓢": 329,
      "𝓤": 330,
      "𝔖": 331,
      "𝔠": 332,
      "𝔸": 333,
      "𝕂": 334,
      "𝕊": 335,
      "𝕎": 336,
      "𝕜": 337,
      "𝕝": 338,
      "𝖣": 339,
      "𝟙": 340,
      "𝟭": 341,
      "in": 342,
      "st": 343,
      "inst": 344,
      "pe": 345,
      "ype": 346,
      "Type": 347,
      "u_": 348,
      "le": 349,
      "al": 350,
      "or": 351,
      "on": 352,
      "ro": 353,
      "om": 354,
      "as": 355,
      "ac": 356,
      "ed": 357,
      "er": 358,
      "re": 359,
      "at": 360,
      "et": 361,
      "un": 362,
      "pac": 363,
      "ra": 364,
      "Com": 365,
      "pace": 366,
      "Space": 367,
      "orm": 368,
      "int": 369,
      ").": 370,
      "Is": 371,
      "✝¹": 372,
      "it": 373,
      "ap": 374,
      "up": 375,
      "eas": 376,
      ":=": 377,
      "u_1": 378,
      "ble": 379,
      "easu": 380,
      "ar": 381,
      "ic": 382,
      "Comm": 383,
      "im": 384,
      "Measu": 385,
      "ing": 386,
      "),": 387,
      "Norm": 388,
      "dd": 389,
      "Set": 390,
      "el": 391,
      "Normed": 392,
      "))": 393,
      "en": 394,
      "ase": 395,
      "=>": 396,
      "Add": 397,
      "fun": 398,
      "is": 399,
      "intro": 400,
      "po": 401,
      "case": 402,
      "od": 403,
      "roup": 404,
      "lo": 405,
      "u_2": 406,
      "eg": 407,
      "em": 408,
      "Group": 409,
      "rable": 410,
      "✝²": 411,
      "To": 412,
      "ge": 413,
      "ly": 414,
      "Fin": 415,
      "ul": 416,
      "th": 417,
      "AddComm": 418,
      "ct": 419,
      "In": 420,
      "((": 421,
      "id": 422,
      "eal": 423,
      "AddCommGroup": 424,
      "ub": 425,
      "an": 426,
      "ion": 427,
      "iv": 428,
      "if": 429,
      "Ring": 430,
      "Measurable": 431,
      "ha": 432,
      "act": 433,
      "ine": 434,
      "✝³": 435,
      "to": 436,
      "eq": 437,
      "ule": 438,
      "odule": 439,
      "con": 440,
      "map": 441,
      "Measure": 442,
      "hf": 443,
      "Li": 444,
      "u_3": 445,
      "NormedAddCommGroup": 446,
      "of": 447,
      "ht": 448,
      "ex": 449,
      "hx": 450,
      "rw": 451,
      "Sub": 452,
      "ig": 453,
      "✝⁴": 454,
      "ite": 455,
      "log": 456,
      "_n": 457,
      "bra": 458,
      "gebra": 459,
      "NormedSpace": 460,
      "_m": 461,
      "ith": 462,
      "_s": 463,
      "cc": 464,
      "Int": 465,
      "co": 466,
      "polog": 467,
      "Topolog": 468,
      "iz": 469,
      "Real": 470,
      "pos": 471,
      "↑(": 472,
      "ical": 473,
      "Finite": 474,
      "ero": 475,
      "um": 476,
      "Module": 477,
      "ono": 478,
      "this": 479,
      "MeasurableSpace": 480,
      "_1": 481,
      "able": 482,
      "ric": 483,
      "ve": 484,
      "imp": 485,
      "mk": 486,
      "ec": 487,
      "ir": 488,
      "ran": 489,
      "Con": 490,
      "iel": 491,
      "ent": 492,
      "Topological": 493,
      "set": 494,
      "let": 495,
      "Eq": 496,
      "Id": 497,
      "Co": 498,
      "Ideal": 499,
      "iff": 500,
      "ern": 501,
      "hc": 502,
      "il": 503,
      "ft": 504,
      "us": 505,
      "fine": 506,
      "✝⁵": 507,
      "ernel": 508,
      "_eq": 509,
      "onoid": 510,
      "simp": 511,
      "TopologicalSpace": 512,
      "Comp": 513,
      "Mul": 514,
      "ield": 515,
      "hp": 516,
      "aliz": 517,
      "ight": 518,
      "inear": 519,
      "u_4": 520,
      "rict": 521,
      "Pro": 522,
      "Field": 523,
      ".{": 524,
      "intype": 525,
      "Al": 526,
      "Map": 527,
      "com": 528,
      "by": 529,
      "Fintype": 530,
      "Non": 531,
      "los": 532,
      "tr": 533,
      "strict": 534,
      "zero": 535,
      "Algebra": 536,
      "Lie": 537,
      "ob": 538,
      "ial": 539,
      "e_": 540,
      "der": 541,
      "art": 542,
      "es": 543,
      "Sem": 544,
      "✝⁶": 545,
      "have": 546,
      "refine": 547,
      "Or": 548,
      "Subm": 549,
      "Cat": 550,
      "hs": 551,
      "neg": 552,
      "Monoid": 553,
      "CommRing": 554,
      "restrict": 555,
      "pen": 556,
      "uo": 557,
      "On": 558,
      "Icc": 559,
      "ory": 560,
      "oc": 561,
      "Top": 562,
      "app": 563,
      "Fun": 564,
      "ma": 565,
      "⁻¹": 566,
      "Finset": 567,
      "uct": 568,
      "atTop": 569,
      "tin": 570,
      "ect": 571,
      "rim": 572,
      "norm": 573,
      "left": 574,
      "hm": 575,
      "pt": 576,
      "Dec": 577,
      "egory": 578,
      "hg": 579,
      "hn": 580,
      "Category": 581,
      "_of": 582,
      "mul": 583,
      "Hom": 584,
      "''": 585,
      "exact": 586,
      "idable": 587,
      "Decidable": 588,
      "List": 589,
      "mm": 590,
      "se": 591,
      "ation": 592,
      "At": 593,
      "Submodule": 594,
      "Of": 595,
      "Ten": 596,
      "with": 597,
      "Integ": 598,
      "With": 599,
      "DecidableEq": 600,
      "(↑": 601,
      "Sup": 602,
      "✝⁷": 603,
      "hom": 604,
      "_iff": 605,
      "mem": 606,
      "Part": 607,
      "mp": 608,
      "wap": 609,
      "kernel": 610,
      "ymm": 611,
      "obj": 612,
      "lete": 613,
      "u_5": 614,
      "Complete": 615,
      "ort": 616,
      "₁,": 617,
      "oo": 618,
      "Linear": 619,
      "lt": 620,
      "swap": 621,
      "ist": 622,
      "am": 623,
      "unt": 624,
      "Nat": 625,
      "Order": 626,
      "right": 627,
      "pty": 628,
      "ain": 629,
      "algebra": 630,
      "iring": 631,
      "↥(": 632,
      "Semiring": 633,
      "ind": 634,
      "uous": 635,
      "tinuous": 636,
      "ors": 637,
      "ng": 638,
      "pan": 639,
      "ard": 640,
      "losed": 641,
      "Po": 642,
      "ive": 643,
      "Sc": 644,
      "empty": 645,
      "und": 646,
      "Mult": 647,
      "Fact": 648,
      "ur": 649,
      "lim": 650,
      "symm": 651,
      "comp": 652,
      "apply": 653,
      "Sum": 654,
      "range": 655,
      "ract": 656,
      "ast": 657,
      "ure": 658,
      "ound": 659,
      "att": 660,
      "hb": 661,
      "inr": 662,
      "_zero": 663,
      "sto": 664,
      "rime": 665,
      "x_1": 666,
      "pro": 667,
      "fl": 668,
      "leng": 669,
      "length": 670,
      "ift": 671,
      "inv": 672,
      "Has": 673,
      "ert": 674,
      "de": 675,
      "yc": 676,
      "₁.": 677,
      "_mem": 678,
      "dsto": 679,
      "ucc": 680,
      "hy": 681,
      ")).": 682,
      "ci": 683,
      "row": 684,
      "✝⁸": 685,
      "max": 686,
      "Pa": 687,
      "ass": 688,
      "fst": 689,
      "add": 690,
      "_pos": 691,
      "hr": 692,
      "Le": 693,
      "ut": 694,
      "ode": 695,
      "jo": 696,
      "ri": 697,
      "cons": 698,
      "_mul": 699,
      "val": 700,
      "NN": 701,
      "only": 702,
      "all": 703,
      "Continuous": 704,
      "Un": 705,
      "sub": 706,
      "Dom": 707,
      "sup": 708,
      "Loc": 709,
      "₁)": 710,
      "ice": 711,
      "Fract": 712,
      "algebraMap": 713,
      "ux": 714,
      "mem_": 715,
      "h_": 716,
      "s_": 717,
      "NNReal": 718,
      "Ar": 719,
      "ph": 720,
      "red": 721,
      "IsP": 722,
      "u_6": 723,
      "eri": 724,
      "(-": 725,
      "Kernel": 726,
      "alar": 727,
      "attice": 728,
      "Aux": 729,
      "Scalar": 730,
      "₂.": 731,
      "Prod": 732,
      "MeasurableSet": 733,
      "Poly": 734,
      "alized": 735,
      "∫⁻": 736,
      "Prop": 737,
      "erm": 738,
      "Open": 739,
      "rfl": 740,
      "port": 741,
      "ially": 742,
      "[←": 743,
      "Nonempty": 744,
      "card": 745,
      "ctor": 746,
      "ner": 747,
      "_le": 748,
      "type": 749,
      "hd": 750,
      "ction": 751,
      "ch": 752,
      "a1": 753,
      "he": 754,
      "pend": 755,
      "✝⁹": 756,
      "sSup": 757,
      "rank": 758,
      "ot": 759,
      "univ": 760,
      "fin": 761,
      "'.": 762,
      "losure": 763,
      "ENNReal": 764,
      "sor": 765,
      "ts": 766,
      "ally": 767,
      "Integrable": 768,
      "nd": 769,
      "inl": 770,
      "ath": 771,
      "Tendsto": 772,
      "cases": 773,
      "₂,": 774,
      "ree": 775,
      "Compac": 776,
      "nom": 777,
      "Polynom": 778,
      "ins": 779,
      "Iso": 780,
      "ofReal": 781,
      "CompleteSpace": 782,
      "Lattice": 783,
      "Sig": 784,
      "one": 785,
      "b1": 786,
      "Zero": 787,
      "₂)": 788,
      "ycle": 789,
      "},": 790,
      "triv": 791,
      "_non": 792,
      "anc": 793,
      "_eq_": 794,
      "succ": 795,
      "h1": 796,
      "span": 797,
      "pow": 798,
      "ab": 799,
      "})": 800,
      "Pre": 801,
      "IsFinite": 802,
      "ue": 803,
      "Atom": 804,
      "Nontriv": 805,
      "IsAtom": 806,
      "Right": 807,
      "untable": 808,
      "cond": 809,
      "Left": 810,
      "',": 811,
      "joint": 812,
      "')": 813,
      "a2": 814,
      "hI": 815,
      "St": 816,
      "ext": 817,
      "prod": 818,
      "_to": 819,
      "b2": 820,
      "ae": 821,
      "Str": 822,
      "ad": 823,
      "h2": 824,
      "ilt": 825,
      "//": 826,
      "Closed": 827,
      "imal": 828,
      "pl": 829,
      "Perm": 830,
      "✝¹⁰": 831,
      "op": 832,
      "↑↑": 833,
      "Pair": 834,
      "insert": 835,
      "icat": 836,
      "Domain": 837,
      "m0": 838,
      "isjoint": 839,
      "min": 840,
      "ilter": 841,
      "ep": 842,
      "cast": 843,
      "orel": 844,
      "Diff": 845,
      "age": 846,
      "ff": 847,
      "bound": 848,
      "IH": 849,
      "closure": 850,
      "cd": 851,
      "NormedField": 852,
      "exp": 853,
      "egree": 854,
      "dist": 855,
      "hu": 856,
      "cl": 857,
      "pre": 858,
      "get": 859,
      "iso": 860,
      "Compact": 861,
      "IsOpen": 862,
      "div": 863,
      "Tensor": 864,
      "gs": 865,
      "ject": 866,
      "_2": 867,
      "Borel": 868,
      "_lt": 869,
      "BorelSpace": 870,
      "Arrow": 871,
      "per": 872,
      "Disjoint": 873,
      "image": 874,
      "tain": 875,
      "gcd": 876,
      "iallyNormedField": 877,
      "NontriviallyNormedField": 878,
      "Factors": 879,
      "fs": 880,
      "⁻¹'": 881,
      "IsLoc": 882,
      "‖₊": 883,
      "coe": 884,
      "LieRing": 885,
      "ome": 886,
      "uiv": 887,
      "_nonneg": 888,
      "mpr": 889,
      "ener": 890,
      "obtain": 891,
      "alizedFactors": 892,
      "Mod": 893,
      "(↑(": 894,
      "Rat": 895,
      "limit": 896,
      "ix": 897,
      "some": 898,
      "ol": 899,
      "RingHom": 900,
      "ens": 901,
      "uot": 902,
      "support": 903,
      "AddCommMonoid": 904,
      "ding": 905,
      "Quot": 906,
      "Node": 907,
      "(⇑": 908,
      "(∀": 909,
      "LinearOrder": 910,
      "closed": 911,
      "hi": 912,
      "ient": 913,
      "our": 914,
      "u_7": 915,
      "Ball": 916,
      ")))": 917,
      "Lp": 918,
      "di": 919,
      "✝¹¹": 920,
      "lb": 921,
      "gr": 922,
      "Integr": 923,
      "⋯)": 924,
      "eries": 925,
      "Product": 926,
      "ker": 927,
      "Scalars": 928,
      "ag": 929,
      "etric": 930,
      "CommSemiring": 931,
      "CompleteLattice": 932,
      "Series": 933,
      "orph": 934,
      "ian": 935,
      "Vect": 936,
      "Vector": 937,
      "mul_": 938,
      "LinearMap": 939,
      "_sub": 940,
      "congr": 941,
      "bed": 942,
      "map_": 943,
      "bedding": 944,
      "hab": 945,
      "Inner": 946,
      "closedBall": 947,
      "toReal": 948,
      "alizer": 949,
      "ack": 950,
      "ih": 951,
      "then": 952,
      "Polynomial": 953,
      "step": 954,
      "ten": 955,
      "Metric": 956,
      "ce": 957,
      "ilinear": 958,
      "FractPair": 959,
      "IntFractPair": 960,
      "fix": 961,
      "iat": 962,
      "wer": 963,
      "functor": 964,
      "Bim": 965,
      "Bimod": 966,
      "nat": 967,
      "alization": 968,
      "ition": 969,
      "snd": 970,
      "ie": 971,
      "AE": 972,
      "No": 973,
      "::": 974,
      "ize": 975,
      "Ch": 976,
      "Sign": 977,
      "hk": 978,
      "edMeasure": 979,
      "SignedMeasure": 980,
      "eR": 981,
      "Multilinear": 982,
      "subtype": 983,
      "Fraction": 984,
      "tf": 985,
      "else": 986,
      "ke": 987,
      "ifp": 988,
      "Equiv": 989,
      "node": 990,
      "RB": 991,
      "comm": 992,
      "redu": 993,
      "mer": 994,
      "Inde": 995,
      "incl": 996,
      "restrictScalars": 997,
      "Seq": 998,
      "_in": 999,
      "Boo": 1000,
      "Cl": 1001,
      "Val": 1002,
      "den": 1003,
      "_ne_": 1004,
      "rows": 1005,
      "nth": 1006,
      "normalizedFactors": 1007,
      "ffine": 1008,
      "const": 1009,
      "mα": 1010,
      "Prime": 1011,
      "hift": 1012,
      "Class": 1013,
      "mat": 1014,
      "Topology": 1015,
      "abs": 1016,
      "Form": 1017,
      "append": 1018,
      "ream": 1019,
      "match": 1020,
      "rans": 1021,
      "cycle": 1022,
      "ck": 1023,
      "As": 1024,
      "↑‖": 1025,
      "jective": 1026,
      "Countable": 1027,
      "lex": 1028,
      "SMul": 1029,
      "IsDomain": 1030,
      "uE": 1031,
      "tal": 1032,
      "order": 1033,
      "refine_1": 1034,
      "Gener": 1035,
      "IsC": 1036,
      "One": 1037,
      "IsIntegr": 1038,
      "ancel": 1039,
      "Inv": 1040,
      "⊗[": 1041,
      "Function": 1042,
      "Bool": 1043,
      "_right": 1044,
      "→+": 1045,
      "pendent": 1046,
      "filter": 1047,
      "measu": 1048,
      "He": 1049,
      "prime": 1050,
      "cont": 1051,
      "h3": 1052,
      "Col": 1053,
      "Ex": 1054,
      "refine_2": 1055,
      "LieAlgebra": 1056,
      "merge": 1057,
      "mβ": 1058,
      "Lift": 1059,
      "uF": 1060,
      "path": 1061,
      "hρ": 1062,
      "Quotient": 1063,
      "ver": 1064,
      "→+*": 1065,
      "leton": 1066,
      "ProductSpace": 1067,
      "InnerProductSpace": 1068,
      "iset": 1069,
      "Submonoid": 1070,
      "cible": 1071,
      "reducible": 1072,
      "count": 1073,
      "finrank": 1074,
      "Affine": 1075,
      "ated": 1076,
      "_apply": 1077,
      "hq": 1078,
      "ounded": 1079,
      "Multiset": 1080,
      "Io": 1081,
      "Ioi": 1082,
      "Vec": 1083,
      "GT": 1084,
      "rankGT": 1085,
      "_of_": 1086,
      "Sort": 1087,
      "hz": 1088,
      "habit": 1089,
      "Em": 1090,
      "Tower": 1091,
      "ScalarTower": 1092,
      "bound_": 1093,
      "ingleton": 1094,
      "Independent": 1095,
      "Struct": 1096,
      "tinu": 1097,
      "assoc": 1098,
      "habited": 1099,
      "IsFiniteMeasure": 1100,
      "Heap": 1101,
      "hT": 1102,
      "LieIdeal": 1103,
      "toFun": 1104,
      "MetricSpace": 1105,
      "inorm": 1106,
      "Seminorm": 1107,
      "ension": 1108,
      "using": 1109,
      "ers": 1110,
      "cycleOf": 1111,
      "ay": 1112,
      "✝¹²": 1113,
      "group": 1114,
      "TypeVec": 1115,
      "integ": 1116,
      "uG": 1117,
      "RBNode": 1118,
      "Mon": 1119,
      "Fin2": 1120,
      "onent": 1121,
      "ry": 1122,
      "Dim": 1123,
      "ensional": 1124,
      "Dimensional": 1125,
      "ae_": 1126,
      "FiniteDimensional": 1127,
      "equ": 1128,
      "Action": 1129,
      "utation": 1130,
      "Red": 1131,
      "linear": 1132,
      "⋯⟩": 1133,
      "onal": 1134,
      "Cont": 1135,
      "Within": 1136,
      "maximal": 1137,
      "ular": 1138,
      "stream": 1139,
      "Functor": 1140,
      "Pres": 1141,
      "IsFiniteKernel": 1142,
      "equalizer": 1143,
      "MonoidWith": 1144,
      "ple": 1145,
      "IsScalarTower": 1146,
      "finite": 1147,
      "soc": 1148,
      "Assoc": 1149,
      "alse": 1150,
      "_ne_zero": 1151,
      "dec": 1152,
      "pal": 1153,
      "rin": 1154,
      "cipal": 1155,
      "rincipal": 1156,
      "Subgroup": 1157,
      "WithC": 1158,
      "isors": 1159,
      "rect": 1160,
      "↑((": 1161,
      "condexp": 1162,
      "Lim": 1163,
      ")}": 1164,
      "heri": 1165,
      "etheri": 1166,
      "etherian": 1167,
      "elf": 1168,
      "Noetherian": 1169,
      "Embedding": 1170,
      "_left": 1171,
      "exist": 1172,
      "itt": 1173,
      "h4": 1174,
      "ong": 1175,
      "ise": 1176,
      "ieve": 1177,
      "h0": 1178,
      "ity": 1179,
      "L1": 1180,
      "ruct": 1181,
      "lock": 1182,
      "comap": 1183,
      "Ab": 1184,
      "fr": 1185,
      "plicat": 1186,
      "rcases": 1187,
      "Unit": 1188,
      "urry": 1189,
      "cyc": 1190,
      "rected": 1191,
      "lin": 1192,
      "Subtype": 1193,
      "WF": 1194,
      "Partial": 1195,
      "non": 1196,
      "IsPrincipal": 1197,
      "Bₘ": 1198,
      "ullb": 1199,
      "ullback": 1200,
      "nil": 1201,
      "LinearOrdered": 1202,
      "le_": 1203,
      "lyMeasurable": 1204,
      "onglyMeasurable": 1205,
      "orner": 1206,
      "Like": 1207,
      "maximalIdeal": 1208,
      "ource": 1209,
      "Structure": 1210,
      "Limit": 1211,
      "irw": 1212,
      "curry": 1213,
      "Total": 1214,
      "rintro": 1215,
      "degree": 1216,
      "icator": 1217,
      "irwise": 1218,
      "VectorMeasure": 1219,
      "WithCorner": 1220,
      "WithCorners": 1221,
      "_eq_zero": 1222,
      "Pairwise": 1223,
      "_neg": 1224,
      "indicator": 1225,
      "Degree": 1226,
      "perm": 1227,
      "Multi": 1228,
      "tfae_": 1229,
      "pi": 1230,
      "utations": 1231,
      "ate": 1232,
      "conv": 1233,
      "Tri": 1234,
      "size": 1235,
      "Rel": 1236,
      "✝¹³": 1237,
      "imple": 1238,
      "ow": 1239,
      "permutations": 1240,
      "edSpace": 1241,
      "ell": 1242,
      "Bl": 1243,
      "ang": 1244,
      "Sigma": 1245,
      "Star": 1246,
      "eval": 1247,
      "').": 1248,
      "Ioo": 1249,
      "Seminormed": 1250,
      "IsCycle": 1251,
      "}.": 1252,
      "itive": 1253,
      "for": 1254,
      "ace": 1255,
      "Sq": 1256,
      "CD": 1257,
      "block": 1258,
      "trans": 1259,
      "tom": 1260,
      "lotom": 1261,
      "lotomic": 1262,
      "join": 1263,
      "StronglyMeasurable": 1264,
      "Iic": 1265,
      "Sm": 1266,
      "cyclotomic": 1267,
      "alMultilinear": 1268,
      "_to_": 1269,
      "FormalMultilinear": 1270,
      "FormalMultilinearSeries": 1271,
      "Ordering": 1272,
      "SetIndependent": 1273,
      "'✝": 1274,
      "(∫⁻": 1275,
      "eL": 1276,
      "ean": 1277,
      "countable": 1278,
      "and": 1279,
      "xp": 1280,
      "rexp": 1281,
      "lyGener": 1282,
      "lyGenerated": 1283,
      "Grows": 1284,
      "Polynomially": 1285,
      "GrowsPolynomially": 1286,
      "Mv": 1287,
      "Collinear": 1288,
      "₃,": 1289,
      "Subalgebra": 1290,
      "ank": 1291,
      "mem_s": 1292,
      "FractionRing": 1293,
      "enc": 1294,
      "htt": 1295,
      "<|": 1296,
      "Aₘ": 1297,
      "hem": 1298,
      "Schem": 1299,
      "Scheme": 1300,
      "Partition": 1301,
      "source": 1302,
      "irreducible": 1303,
      "Component": 1304,
      "sig": 1305,
      "Mat": 1306,
      "simpa": 1307,
      "hJ": 1308,
      "toList": 1309,
      "sum": 1310,
      "ContDiff": 1311,
      "Cone": 1312,
      "tent": 1313,
      "potent": 1314,
      "hS": 1315,
      "ListBl": 1316,
      "countablePartition": 1317,
      "ListBlank": 1318,
      "SeminormedAddCommGroup": 1319,
      "Complex": 1320,
      "c1": 1321,
      "ta": 1322,
      "hB": 1323,
      "Nil": 1324,
      "Chart": 1325,
      "ves": 1326,
      ")]": 1327,
      "hι": 1328,
      "poly": 1329,
      "ifp_n": 1330,
      "₃)": 1331,
      "Nilpotent": 1332,
      "mable": 1333,
      "✝)": 1334,
      "allyClosed": 1335,
      "omorph": 1336,
      "lTensor": 1337,
      "IsPrime": 1338,
      "End": 1339,
      "False": 1340,
      "tendsto": 1341,
      "Meas": 1342,
      "def": 1343,
      "irreducibleComponent": 1344,
      "Ici": 1345,
      "actLeft": 1346,
      "Cast": 1347,
      "LieModule": 1348,
      "TotalSpace": 1349,
      "uction": 1350,
      "one_": 1351,
      "alize": 1352,
      "IsIntegrallyClosed": 1353,
      "Num": 1354,
      "₁}": 1355,
      "vd": 1356,
      "ants": 1357,
      "_meas": 1358,
      "Associat": 1359,
      "asis": 1360,
      "Inhabited": 1361,
      "esOf": 1362,
      "nthLe": 1363,
      "Path": 1364,
      "tj": 1365,
      "ieltj": 1366,
      "cut": 1367,
      "Coprime": 1368,
      "stieltj": 1369,
      "MeasurableRat": 1370,
      "esOfMeasurableRat": 1371,
      "stieltjesOfMeasurableRat": 1372,
      "Rₚ": 1373,
      "Mₚ": 1374,
      "tinuants": 1375,
      "_of_mem": 1376,
      "_self": 1377,
      "₁'": 1378,
      "irreducibleComponents": 1379,
      "_one": 1380,
      "arith": 1381,
      "linarith": 1382,
      "induction": 1383,
      "iq": 1384,
      "Shift": 1385,
      "SigmaFinite": 1386,
      "ral": 1387,
      "₂}": 1388,
      "rix": 1389,
      "unop": 1390,
      "plicative": 1391,
      "toSignedMeasure": 1392,
      "Re": 1393,
      "Multiplicative": 1394,
      "natDegree": 1395,
      "Cancel": 1396,
      "⋯,": 1397,
      "WithinAt": 1398,
      "sign": 1399,
      "Gam": 1400,
      "smul": 1401,
      "c2": 1402,
      "Nth": 1403,
      "Factor": 1404,
      "insertNth": 1405,
      "IsMultiplicative": 1406,
      "minpoly": 1407,
      "₁₂": 1408,
      "Support": 1409,
      "₁✝": 1410,
      "Matrix": 1411,
      "_inv": 1412,
      "old": 1413,
      "arian": 1414,
      "ariant": 1415,
      "₂).": 1416,
      "Tors": 1417,
      "continuants": 1418,
      "coeff": 1419,
      "continuantsAux": 1420,
      "inf": 1421,
      "AddTors": 1422,
      "AddTorsor": 1423,
      "Der": 1424,
      "object": 1425,
      "Deriv": 1426,
      "Subobject": 1427,
      "α_": 1428,
      "hf_": 1429,
      "hδ": 1430,
      "tail": 1431,
      "del": 1432,
      "hl": 1433,
      "⟩,": 1434,
      "hj": 1435,
      "CLike": 1436,
      "RCLike": 1437,
      "ique": 1438,
      "IsNilpotent": 1439,
      "by_": 1440,
      "CountableTopology": 1441,
      "_add": 1442,
      "ot_": 1443,
      "LieRingModule": 1444,
      "MulAction": 1445,
      "snorm": 1446,
      "₅,": 1447,
      "f_": 1448,
      "CompactSupport": 1449,
      "↥↑": 1450,
      "Div": 1451,
      "heq": 1452,
      "_succ": 1453,
      "trim": 1454,
      "proj": 1455,
      "agonal": 1456,
      "i_1": 1457,
      "alanc": 1458,
      "Ha": 1459,
      "coequalizer": 1460,
      "Invariant": 1461,
      "dg": 1462,
      "ism": 1463,
      "iform": 1464,
      "_subset": 1465,
      "witt": 1466,
      "IsLocalization": 1467,
      "lp": 1468,
      "IsD": 1469,
      "AEMeasurable": 1470,
      "orphism": 1471,
      "lift": 1472,
      "Bounded": 1473,
      "Min": 1474,
      "actRight": 1475,
      "top": 1476,
      "IsCompact": 1477,
      "_iff_": 1478,
      "hxy": 1479,
      "HasCompactSupport": 1480,
      "hlt": 1481,
      "∑'": 1482,
      "ax": 1483,
      "ev": 1484,
      "countablePartitionSet": 1485,
      "Basis": 1486,
      "Monic": 1487,
      "Ord": 1488,
      "kx": 1489,
      "supp": 1490,
      "ChartedSpace": 1491,
      "__s": 1492,
      "ooth": 1493,
      "IsFractionRing": 1494,
      "last": 1495,
      "d2": 1496,
      "tensor": 1497,
      "Haar": 1498,
      "measurable": 1499,
      "normalize": 1500,
      ")⁻¹": 1501,
      "dvd": 1502,
      "ach": 1503,
      "AddGroup": 1504,
      "erse": 1505,
      "Morphism": 1506,
      "d1": 1507,
      "eq_": 1508,
      "orderOf": 1509,
      "ek": 1510,
      "edek": 1511,
      "toFinset": 1512,
      "indDomain": 1513,
      "edekindDomain": 1514,
      "wo": 1515,
      "LinearOrderedField": 1516,
      "(((": 1517,
      "four": 1518,
      "₄}": 1519,
      "IsDedekindDomain": 1520,
      "expan": 1521,
      "expand": 1522,
      "rom": 1523,
      "fract": 1524,
      "_sum": 1525,
      "attach": 1526,
      "Unique": 1527,
      "u_8": 1528,
      "Triple": 1529,
      "Mono": 1530,
      "IdealRing": 1531,
      "IsPrincipalIdealRing": 1532,
      "hρ_zero": 1533,
      "kernelSubobject": 1534,
      "ha2": 1535,
      "‖)": 1536,
      "inj": 1537,
      "ere": 1538,
      "preimage": 1539,
      "wittStructure": 1540,
      "inverse": 1541,
      "Union": 1542,
      "✝¹⁴": 1543,
      "Classical": 1544,
      "}),": 1545,
      "Uniform": 1546,
      "HaarMeasure": 1547,
      "Tr": 1548,
      "ZMod": 1549,
      "Sam": 1550,
      "TensorBimod": 1551,
      "lpMeas": 1552,
      "LE": 1553,
      "Infinite": 1554,
      "a_1": 1555,
      "Cond": 1556,
      "vol": 1557,
      "ky": 1558,
      "IsNoetherian": 1559,
      "alk": 1560,
      "IsAdd": 1561,
      "lope": 1562,
      "construct": 1563,
      "constructor": 1564,
      "castRingHom": 1565,
      "Ico": 1566,
      "₂))": 1567,
      "uation": 1568,
      "CDF": 1569,
      "slope": 1570,
      "Preser": 1571,
      "Restrict": 1572,
      "Filter": 1573,
      "Well": 1574,
      "Di": 1575,
      "IsAddHaarMeasure": 1576,
      "by_cases": 1577,
      "({": 1578,
      "→.": 1579,
      "Abs": 1580,
      "exists_": 1581,
      "ant": 1582,
      "PF": 1583,
      "QPF": 1584,
      "ily": 1585,
      "oose": 1586,
      "amily": 1587,
      "integral": 1588,
      "base": 1589,
      "Exact": 1590,
      "¬(": 1591,
      "colimit": 1592,
      "eRay": 1593,
      "_rw": 1594,
      "_num": 1595,
      "L2": 1596,
      "₂✝": 1597,
      "Sieve": 1598,
      "IsRat": 1599,
      "volum": 1600,
      "Eu": 1601,
      "coe_": 1602,
      "divisors": 1603,
      "The": 1604,
      "eomorph": 1605,
      "ward": 1606,
      "decEq": 1607,
      "Theory": 1608,
      "dest": 1609,
      "Py": 1610,
      "orean": 1611,
      "thag": 1612,
      "Summable": 1613,
      "Pythag": 1614,
      "oreanTriple": 1615,
      "PythagoreanTriple": 1616,
      "Span": 1617,
      "Associates": 1618,
      "pullback": 1619,
      "MonoidWithZero": 1620,
      "Closure": 1621,
      "KernelCDF": 1622,
      "condKernel": 1623,
      "CondKernelCDF": 1624,
      "dsimp": 1625,
      "num": 1626,
      "Smooth": 1627,
      "Normal": 1628,
      "choose": 1629,
      "'⟩": 1630,
      "ier": 1631,
      "ren": 1632,
      "IsRatCondKernelCDF": 1633,
      "bind": 1634,
      "ne": 1635,
      "volume": 1636,
      "₂'": 1637,
      "CommMonoidWithZero": 1638,
      "ContDiffOn": 1639,
      "SameRay": 1640,
      "irst": 1641,
      "measure": 1642,
      "norm_num": 1643,
      "IsMul": 1644,
      "deriv": 1645,
      "IH1": 1646,
      "blocks": 1647,
      "blocksFun": 1648,
      "IsL": 1649,
      "𝒟ᵒ": 1650,
      "_comp": 1651,
      "IsG": 1652,
      "fourier": 1653,
      "hN": 1654,
      "Family": 1655,
      "refl": 1656,
      "idi": 1657,
      "ange": 1658,
      "simp_rw": 1659,
      "posPart": 1660,
      "'))": 1661,
      "hain": 1662,
      "plit": 1663,
      "his": 1664,
      "_i": 1665,
      "Compacts": 1666,
      "cmp": 1667,
      "hea": 1668,
      "Directed": 1669,
      "sa": 1670,
      "bl": 1671,
      "idiagonal": 1672,
      "Up": 1673,
      "_le_": 1674,
      "hv": 1675,
      "ually": 1676,
      "Homo": 1677,
      "Homeomorph": 1678,
      "_up": 1679,
      "radi": 1680,
      "radius": 1681,
      "det": 1682,
      "entually": 1683,
      "IsLocally": 1684,
      "OnCompacts": 1685,
      "IsFiniteMeasureOnCompacts": 1686,
      "CancelCommMonoidWithZero": 1687,
      "Gamma": 1688,
      "usion": 1689,
      "phere": 1690,
      "alanced": 1691,
      "AddMonoid": 1692,
      "bound_fs": 1693,
      "heaf": 1694,
      "bound_gs": 1695,
      "shift": 1696,
      "inclusion": 1697,
      "Ne": 1698,
      "Args": 1699,
      "HeapNode": 1700,
      "(∑": 1701,
      "inter": 1702,
      "Walk": 1703,
      "ersion": 1704,
      "Colimit": 1705,
      "An": 1706,
      "ization": 1707,
      "filter_up": 1708,
      "wards": 1709,
      "filter_upwards": 1710,
      "ute": 1711,
      "Ant": 1712,
      "pread": 1713,
      "__spread": 1714,
      "hZ": 1715,
      "diff": 1716,
      ";>": 1717,
      "<;>": 1718,
      "hds": 1719,
      "wittStructureInt": 1720,
      "hle": 1721,
      "hx_nonneg": 1722,
      "MultilinearMap": 1723,
      "embedding": 1724,
      "condexpL2": 1725,
      "(↥": 1726,
      "tendsto_": 1727,
      "Pi": 1728,
      "Value": 1729,
      "NormedAddTorsor": 1730,
      "SL": 1731,
      "ull": 1732,
      "Locally": 1733,
      "_c": 1734,
      "position": 1735,
      "elian": 1736,
      "assert": 1737,
      "shiftFunctor": 1738,
      "natAbs": 1739,
      "loor": 1740,
      "u_9": 1741,
      "Antidiagonal": 1742,
      "embeddingReal": 1743,
      "continuous": 1744,
      "Sup_s": 1745,
      "Man": 1746,
      "ifold": 1747,
      "SmoothMan": 1748,
      "ifoldWithCorners": 1749,
      "SmoothManifoldWithCorners": 1750,
      "_smul": 1751,
      "hK": 1752,
      "Valuation": 1753,
      "eric": 1754,
      "convert": 1755,
      "eventually": 1756,
      "sz": 1757,
      "ude": 1758,
      "conts": 1759,
      "MeasureTheory": 1760,
      "include": 1761,
      "includeRight": 1762,
      "UB": 1763,
      "sIn": 1764,
      "AEStronglyMeasurable": 1765,
      "IsCompactlyGenerated": 1766,
      "_of_lt": 1767,
      "zi": 1768,
      "Preserves": 1769,
      "Count": 1770,
      "MvQPF": 1771,
      "⟨⟨": 1772,
      "LieSubalgebra": 1773,
      "ensity": 1774,
      "hisker": 1775,
      "au": 1776,
      "unit": 1777,
      "_mono": 1778,
      "AddMonoidWith": 1779,
      "AddMonoidWithOne": 1780,
      "Res": 1781,
      "arr": 1782,
      "Modular": 1783,
      "Founded": 1784,
      "hμ": 1785,
      "cop": 1786,
      "Simple": 1787,
      "own": 1788,
      "ValuationRing": 1789,
      "negY": 1790,
      "First": 1791,
      "PartialHomeomorph": 1792,
      "FirstCountableTopology": 1793,
      "down": 1794,
      "posSeq": 1795,
      "NonposSeq": 1796,
      "restrictNonposSeq": 1797,
      "IsLUB": 1798,
      "Commute": 1799,
      "forget": 1800,
      "car": 1801,
      "sphere": 1802,
      "kernelSubobjectIso": 1803,
      "_t": 1804,
      "₅₁₂": 1805,
      "ord": 1806,
      "arrows": 1807,
      "IsNoetherianRing": 1808,
      "rier": 1809,
      "IsIntegral": 1810,
      "divisorsAntidiagonal": 1811,
      "carrier": 1812,
      "hτ": 1813,
      "ediat": 1814,
      "ermediat": 1815,
      "ae_1": 1816,
      "tfae_1": 1817,
      "IsModular": 1818,
      "IsModularLattice": 1819,
      "WellFounded": 1820,
      "_pow": 1821,
      "ULift": 1822,
      "idx": 1823,
      "Factorization": 1824,
      "UniqueFactorization": 1825,
      "UniqueFactorizationMonoid": 1826,
      "entri": 1827,
      "entries": 1828,
      "eField": 1829,
      "Intermediat": 1830,
      "IntermediateField": 1831,
      "elWithCorners": 1832,
      "ModelWithCorners": 1833,
      "io": 1834,
      "hfg": 1835,
      "_nhds": 1836,
      "],": 1837,
      "⇑(": 1838,
      "Numeric": 1839,
      "₁))": 1840,
      "hmem": 1841,
      "Divisors": 1842,
      "gcongr": 1843,
      "union": 1844,
      "Nonneg": 1845,
      "Sᶜ": 1846,
      "⋯).": 1847,
      "Iio": 1848,
      "Bi": 1849,
      "lie": 1850,
      "filterAt": 1851,
      "ty": 1852,
      "CommSq": 1853,
      "perty": 1854,
      "_ro": 1855,
      "eight": 1856,
      "xs": 1857,
      "step1": 1858,
      "forall": 1859,
      "-↑": 1860,
      "_nat": 1861,
      "ContinuousOn": 1862,
      "Acc": 1863,
      "Pos": 1864,
      "Nontrivial": 1865,
      "CatCommSq": 1866,
      "mono": 1867,
      "tl": 1868,
      "IsPath": 1869,
      "Ta": 1870,
      "P1": 1871,
      "']": 1872,
      "erent": 1873,
      "))).": 1874,
      "hκ": 1875,
      "pr": 1876,
      "_mk": 1877,
      "IsSem": 1878,
      "isimple": 1879,
      "IsSemisimple": 1880,
      "init": 1881,
      "directed": 1882,
      "IsPrim": 1883,
      "esc": 1884,
      "onge": 1885,
      "ToHom": 1886,
      "FiniteMeasure": 1887,
      "ring": 1888,
      "Gu": 1889,
      "ContinuousMultilinearMap": 1890,
      "subset": 1891,
      "Imm": 1892,
      "og": 1893,
      "star": 1894,
      "_max": 1895,
      "black": 1896,
      "Immersion": 1897,
      "Dist": 1898,
      "su": 1899,
      "ToLp": 1900,
      "(∃": 1901,
      "_ne": 1902,
      "_3": 1903,
      "εpos": 1904,
      "iable": 1905,
      "ption": 1906,
      "hco": 1907,
      "u_10": 1908,
      "suff": 1909,
      "longe": 1910,
      "stPre": 1911,
      "Tape": 1912,
      "longestPre": 1913,
      "longestPrefix": 1914,
      "ices": 1915,
      "suffices": 1916,
      "toSubmodule": 1917,
      "rwa": 1918,
      "rib": 1919,
      "erase": 1920,
      "exists": 1921,
      "_h": 1922,
      "Floor": 1923,
      "chain": 1924,
      "stepAux": 1925,
      "Trim": 1926,
      "_of_le": 1927,
      "lpMeasToLp": 1928,
      "TrimLie": 1929,
      "lpMeasToLpTrimLie": 1930,
      "sing": 1931,
      "IntegrableOn": 1932,
      "hw": 1933,
      "FloorRing": 1934,
      "UniformSpace": 1935,
      "₂⟩": 1936,
      "eqToHom": 1937,
      "ning": 1938,
      "Const": 1939,
      "IsAffine": 1940,
      "end": 1941,
      "h_int": 1942,
      "(∡": 1943,
      "raph": 1944,
      "extend": 1945,
      "Injective": 1946,
      "IsLocallyFiniteMeasure": 1947,
      "✝).": 1948,
      "HasF": 1949,
      "₁).": 1950,
      "_root_": 1951,
      "LB": 1952,
      "WSeq": 1953,
      "NoZero": 1954,
      "¬((": 1955,
      "pect": 1956,
      "Trans": 1957,
      "ihy": 1958,
      "‖↑": 1959,
      "mem_insert": 1960,
      "Reg": 1961,
      "Regular": 1962,
      "IsOpenImmersion": 1963,
      "mt": 1964,
      "ningSet": 1965,
      "use": 1966,
      "‖₊)": 1967,
      "}).": 1968,
      "preinclusion": 1969,
      "bot": 1970,
      "fixF": 1971,
      "zsmul": 1972,
      "thog": 1973,
      "ablyGenerated": 1974,
      "CountablyGenerated": 1975,
      "thogonal": 1976,
      "Balanced": 1977,
      "Char": 1978,
      "_comm": 1979,
      "SpanningSet": 1980,
      "SpanningSetsIn": 1981,
      "inal": 1982,
      "lem": 1983,
      "✝¹⁵": 1984,
      "LinearEquiv": 1985,
      "h5": 1986,
      "IsM": 1987,
      "nect": 1988,
      "_cast": 1989,
      "gener": 1990,
      "IsS": 1991,
      "Subs": 1992,
      "map_add": 1993,
      "lattice": 1994,
      "condexpL1": 1995,
      "mem_singleton": 1996,
      ".{?": 1997,
      "normalizeIso": 1998,
      "Ad": 1999,
      "For": 2000,
      "met": 2001,
      "icFunction": 2002,
      "ithmet": 2003,
      "Arithmet": 2004,
      "ArithmeticFunction": 2005,
      "_atTop": 2006,
      "ua": 2007,
      "Cover": 2008,
      "Mk": 2009,
      "From": 2010,
      "pconts": 2011,
      "angent": 2012,
      "IsGLB": 2013,
      "Tᶜ": 2014,
      "hα": 2015,
      "Ordered": 2016,
      "++": 2017,
      "oot": 2018,
      "CU": 2019,
      "✝.": 2020,
      "g_nonneg": 2021,
      "_in_": 2022,
      "Rec": 2023,
      "desc": 2024,
      "SMulDivisors": 2025,
      "nonneg": 2026,
      "NoZeroSMulDivisors": 2027,
      "Size": 2028,
      "Orient": 2029,
      "ClosedEmbedding": 2030,
      "lie_mem": 2031,
      "ys": 2032,
      "NormalSpace": 2033,
      ")),": 2034,
      "NoetherianSpace": 2035,
      "MDiff": 2036,
      "repr": 2037,
      "_cancel": 2038,
      "_in_K": 2039,
      "LT": 2040,
      "Pullback": 2041,
      "eff": 2042,
      "_cont": 2043,
      "oid": 2044,
      "has": 2045,
      "oms": 2046,
      "_top": 2047,
      "Generalized": 2048,
      "isRed": 2049,
      "Colex": 2050,
      "✝¹⁶": 2051,
      "Property": 2052,
      "ihxy": 2053,
      "Free": 2054,
      "whisker": 2055,
      "intCast": 2056,
      "Bound": 2057,
      "lement": 2058,
      "seq": 2059,
      "edFraction": 2060,
      "Continu": 2061,
      "GeneralizedContinu": 2062,
      "GeneralizedContinuedFraction": 2063,
      "atoms": 2064,
      "Coeff": 2065,
      "Ir": 2066,
      "urjective": 2067,
      "_assoc": 2068,
      "IsLimit": 2069,
      "FintypeCat": 2070,
      "compExact": 2071,
      "compExactValue": 2072,
      "β_in_K": 2073,
      "Groupoid": 2074,
      "gt": 2075,
      "HasZero": 2076,
      "Homolog": 2077,
      "map_mul": 2078,
      "IsPrimitive": 2079,
      "→*": 2080,
      "s_ind": 2081,
      "RedRed": 2082,
      "_norm": 2083,
      "Prim": 2084,
      "[]": 2085,
      "negPart": 2086,
      "_inf_": 2087,
      "FG": 2088,
      "inhabited": 2089,
      "inhabited_h": 2090,
      "IsCon": 2091,
      "b_inf_": 2092,
      "b_inf_Sup_s": 2093,
      "hxp": 2094,
      "Pl": 2095,
      "hd2": 2096,
      "Cof": 2097,
      "];": 2098,
      "rc": 2099,
      "ram": 2100,
      "s_atoms": 2101,
      "h_meas": 2102,
      "ᵒᵖ": 2103,
      "irc": 2104,
      "Stmt": 2105,
      "hU": 2106,
      "hxl": 2107,
      "Oriented": 2108,
      "kup": 2109,
      "okup": 2110,
      "lookup": 2111,
      "addX": 2112,
      "alc": 2113,
      "Distrib": 2114,
      "Y_n": 2115,
      "s_max": 2116,
      "NormalizedFactors": 2117,
      "MapEquiv": 2118,
      "PolyMk": 2119,
      "head": 2120,
      "normalizedFactorsMapEquiv": 2121,
      "MinPolyMk": 2122,
      "Irreducible": 2123,
      "NormalizedFactorsMinPolyMk": 2124,
      "normalizedFactorsMapEquivNormalizedFactorsMinPolyMk": 2125,
      ")!": 2126,
      "Ap": 2127,
      "✝,": 2128,
      "⟩⟩": 2129,
      "toNat": 2130,
      "_singleton": 2131,
      "true": 2132,
      "Mo": 2133,
      "Moves": 2134,
      "u_11": 2135,
      "ists": 2136,
      "s_fun": 2137,
      "blocks_fun": 2138,
      "bu": 2139,
      "sq": 2140,
      "powers": 2141,
      "dlookup": 2142,
      "cokernel": 2143,
      "hgf": 2144,
      "_mul_": 2145,
      "Root": 2146,
      "Exists": 2147,
      "Fu": 2148,
      "Option": 2149,
      "ihyx": 2150,
      "_zero_eq": 2151,
      "InfinitePl": 2152,
      "InfinitePlace": 2153,
      "hE": 2154,
      "oom": 2155,
      "UpTo": 2156,
      "rpos": 2157,
      "Minimal": 2158,
      "tangent": 2159,
      "Local": 2160,
      "uare": 2161,
      ")‖": 2162,
      ">]": 2163,
      "[>]": 2164,
      "uD": 2165,
      "alle": 2166,
      "rever": 2167,
      "upd": 2168,
      "aralle": 2169,
      "Abelian": 2170,
      "ual": 2171,
      "do": 2172,
      "Coprod": 2173,
      "ardBorelSpace": 2174,
      "Stand": 2175,
      "StandardBorelSpace": 2176,
      "xeq": 2177,
      "Ordnode": 2178,
      "_nonempty": 2179,
      "h_int_": 2180,
      "CompactSpace": 2181,
      "_map": 2182,
      "Cotangent": 2183,
      "nected": 2184,
      "ber": 2185,
      "OrderTopology": 2186,
      "update": 2187,
      "Small": 2188,
      "Graph": 2189,
      "convex": 2190,
      "SimpleGraph": 2191,
      "reverse": 2192,
      "split": 2193,
      "⦄,": 2194,
      "↑(↑": 2195,
      "ance": 2196,
      "(∏": 2197,
      "_f": 2198,
      "ds": 2199,
      "integrable": 2200,
      "g_pos": 2201,
      "mot": 2202,
      "renam": 2203,
      "motive": 2204,
      "lintegral": 2205,
      "IsClosed": 2206,
      "Cochain": 2207,
      "single": 2208,
      "_id": 2209,
      "ki": 2210,
      "⟩)": 2211,
      "hcom": 2212,
      "_r": 2213,
      "mul_comm": 2214,
      "Cpos": 2215,
      "calc": 2216,
      "rum": 2217,
      "ski": 2218,
      "hb2": 2219,
      "pectrum": 2220,
      "field": 2221,
      "jection": 2222,
      "bi": 2223,
      ")))))": 2224,
      "hcp": 2225,
      "Hf": 2226,
      "isoE": 2227,
      "hG": 2228,
      "owski": 2229,
      "hcomm": 2230,
      "toEnd": 2231,
      "os": 2232,
      "ingCoeff": 2233,
      "bit": 2234,
      "ets": 2235,
      "ckets": 2236,
      "StarRing": 2237,
      "_succ_n": 2238,
      "ible": 2239,
      "TopologicalAddGroup": 2240,
      "LeftInvariant": 2241,
      "mul_assoc": 2242,
      "MvPolynomial": 2243,
      "TopologicalGroup": 2244,
      "adingCoeff": 2245,
      "IsMulLeftInvariant": 2246,
      "Integral": 2247,
      "hδ1": 2248,
      "tone": 2249,
      "GCD": 2250,
      "✝¹⁷": 2251,
      "RightInvariant": 2252,
      "Presieve": 2253,
      "hδ2": 2254,
      "GCDMonoid": 2255,
      "sc": 2256,
      "ifp_succ_n": 2257,
      "∞)": 2258,
      "Square": 2259,
      "infer": 2260,
      "Over": 2261,
      "leadingCoeff": 2262,
      "generate": 2263,
      "Singleton": 2264,
      "W_": 2265,
      "nnorm": 2266,
      "udo": 2267,
      "ht2": 2268,
      "seudo": 2269,
      "_measu": 2270,
      "congr_": 2271,
      "isoF": 2272,
      "itting": 2273,
      "Strict": 2274,
      "te": 2275,
      "icon": 2276,
      "Triang": 2277,
      "prox": 2278,
      "Approx": 2279,
      "ary": 2280,
      "nonempty": 2281,
      "True": 2282,
      "2Space": 2283,
      "T2Space": 2284,
      "Normalization": 2285,
      "lastr": 2286,
      "stream_zero_eq": 2287,
      "subset_": 2288,
      "fig": 2289,
      "mγ": 2290,
      "_to_2": 2291,
      "Composition": 2292,
      "icontinuous": 2293,
      "a_": 2294,
      "cod": 2295,
      "idean": 2296,
      "ht1": 2297,
      "clidean": 2298,
      "Euclidean": 2299,
      "..": 2300,
      "insertWith": 2301,
      "_to_4": 2302,
      "IsMulRightInvariant": 2303,
      "tfae_1_to_4": 2304,
      "Pseudo": 2305,
      "hε": 2306,
      "hfs_": 2307,
      "rightInv": 2308,
      "ifp_zero": 2309,
      "inej": 2310,
      "RBCol": 2311,
      "RBColor": 2312,
      "Epi": 2313,
      "hgs_": 2314,
      "aeSeq": 2315,
      "Exp": 2316,
      "✝¹⁸": 2317,
